[{
		"_id": "6203bd57b0d50e4d201d5ef3",
		"title": "Can’t wait for Intel Arc Alchemist GPUs? We may have some bad news...",
		"abstract": " Slight doubts aired over Intel’s Q1 release timeframe via the rumor mill",
		"imageCover": "intel-arc.jpeg",
		"tags": ["technology", "computer"],
		"category": "technology",
		"typeFace": "feature",
		"author": "61ed7e4a3c05a74b3559bb4a",
		"markdown": "Intel’s Arc Alchemist graphics chips have been shown in a video, complete with fresh rumors about the possible launch schedule. This comes from YouTuber Moore’s Law is Dead (MLID), a common source of Intel and AMD leaks, who shared some images in a video (spotted by VideoCardz), with the pics showing what appears to be two different graphics chips, high-end with up to 512 EUs (or Execution Units) and low-end with up to 128 EUs. MLID further speculates on Intel’s launch timeframes for next year, although this is on even shakier territory, and apparently even the chip giant itself has had difficulty pinning down a release schedule, with dates being moved multiple times according to sources.\r\n\r\n![images](https://i.cdn.newsbytesapp.com/images/l24420210817174233.jpeg)\r\n\r\nThe theory as it stands, though, is that while Intel appears confident of a Q1 2022 launch, MLID is still a little doubtful  that we’ll see products out there and available to buy in the first quarter. MLID further asserts that we could see the low-end Alchemist GPU (128 EUs) launch in the form of desktop graphics cards first, rather than mobile (the latter being first out the gate was what the rumor mill previously contended – and of course, that could still happen). These will likely emerge in April, or perhaps late March, meaning Q1 could still be a possibility (just about), to be followed by the high-end GPUs (512 EUs) likely later in April – assuming the drivers are ready.\r\n\r\n![image](https://static.techspot.com/images2/news/bigimage/2021/08/2021-08-24-image-26.jpg)\r\n\r\nThere are a lot of ifs and buts here, and indeed another point mentioned by MLID is that Intel’s flagship desktop reference boards may not be ready until mid-Q2, and there’s a possibility that third-party graphics cards could be out before the actual reference product. Or Intel might just let card makers do a paper launch, and hold up until a simultaneous release with reference boards is possible.\r\n\r\nIt seems possible, then, that we may see a reversal of the situation that was previously rumored whereby Intel would release laptop Alchemist GPUs first, then desktop cards. Desktop GPUs may come first, perhaps, but may not arrive until April, which is slightly disappointing. Then again, MLID also floats the possibility that low-end laptop cards might come first. The picture is unclear, with Intel apparently switching around the intended release schedule with some regularity.\r\n\r\n![image](https://www.notebookcheck.com/fileadmin/Notebooks/News/_nc3/Intel_ARC_Alchemist_Reference_Graphics_Card_Final_Design_Renders__8_2060x1299.png)\r\n\r\nIt sounds like nothing is set in stone, really, and that this has led MLID to doubt whether Intel might have anything but a paper launch in Q1 (and perhaps a tiny amount of product). A lot may depend on the state of play with the graphics driver, too, and while MLID makes it clear that he isn’t worried about the quality of Intel’s work on the driver long-term, Team Blue might struggle to get it fully in shape and optimized (particularly for the high-end GPU) to hit late March or early April. All of which isn’t what we really want to hear – we’d like leaks to be pointing to something definitely happening in Q1, of course, but it seems like there could be a possibility of things slipping.\r\n\r\nAll that said, Intel seems to have been pretty confident talking about a Q1 release, and again confirmed this timeframe in a video showing various games being run by an Alchemist GPU aired last week.\r\n\r\nWhat’s also interesting to hear from MLID is that Intel is set to really push at the budget end of the graphics card market, which will be music to the ears of those hunting for a wallet-friendly GPU, and having real problems finding viable candidates right now. There are fresh budget options purportedly in the pipeline from both AMD and Nvidia in the near future, of course, but it sounds like Intel is shaping up to make an impressive assault on the low-end GPU sector for laptops and desktops alike. Exciting times ahead…"
	},
	{
		"_id": "6203bd57b0d50e4d201d5ef4",
		"title": "Game Awards 2021: Here’s the full list of winners",
		"abstract": "It Take Two wins the Game of the Year, and ties with Forza Horizon 5 for lifting 3 trophies",
		"imageCover": "game-awards.jpg",
		"tags": ["gaming", "entertainment"],
		"category": "gaming",
		"typeFace": "main",
		"author": "61ed7e4a3c05a74b3559bb4a",
		"markdown": "Hosted by Geoff Keighley, The Game Awards 2021 stunned the internet with the biggest reveals and honouring the most well-received titles this year. Arkane Studios’ Deathloop, despite earning nine spots on the nomination list, barely scratched the surface with 2 victories.\r\n\r\nOn the other hand, Hazelight studio’s co-op game, It Takes Two, which bagged five spots on the list, won 3 awards, including the prestigious Game of the Year trophy. This comes as a big relief for director Joseph Fares, who recently received a trademark claim from GTA parent company, Take-Two over similar-sounding names. Following the disastrous launch of the Marvel’s Avengers game, even Square Enix earned a redemption arc when Guardians of the Galaxy lifted the trophy for best narrative.\r\n\r\nIn the Player’s Choice category, Halo Infinite came victorious, despite only having released 2 nights ago. Keanu Reeves made an appearance this year as well, alongside co-star Carrie-Ann Moss to promote their film and the new Unreal Engine 5 tech demo – The Matrix Awakens. Players can download the game for free on their PS5 or Xbox Series X|S consoles and play a few missions based on iconic moments from the franchise.\r\n\r\nWith all that out of the way, here’s a complete list of winners from The Game Awards 2021.\r\n\r\n## Game of the Year\r\n\r\n### WINNER: It Takes Two (Hazelight Studios/EA)\r\n\r\n![image](https://static.digit.in/default/6f18903bae0b3317168eaacb4f93c1a3d915110b.jpeg)\r\n\r\nIt Takes Two is an action-adventure video game with elements from platform games. It is specifically designed for split-screen cooperative multiplayer, which means that it must be played with another player through either local or online play. The game features a large number of game mechanics from various video game genres. These gameplay mechanics are connected to the story and the theme of the level. For instance, in one level, Cody gains the ability to rewind time, whereas May can replicate herself. Players have to cooperate with each other and utilize these abilities in order to progress. The game also features a large number of minigames. \r\n\r\n**Nominees are:**\r\n\r\n- Deathloop (Arkane Studios/Bethesda)\r\n\r\n- It Takes Two (Hazelight Studios/EA)\r\n\r\n- Metroid Dread (Mercury Steam/Nintendo)\r\n\r\n- Psychonauts 2 (Double Fine/Xbox Game Studios)\r\n\r\n- Ratchet & Clank: Rift Apart (Insomniac Games/SIE)\r\n\r\n- Resident Evil Village (Capcom)\r\n\r\n## Best Game Direction\r\n\r\n### WINNER: Deathloop\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/NjKmtsWPWi8FxpXxtT6Grk.jpg)\r\n\r\nIn Deathloop, the player takes on the role of Colt, an assassin stuck in a time loop who has been tasked to take out eight targets called Visionaries across the island before midnight, as leaving even one alive will cause the time loop to reset and undo his work. Further, should Colt die before taking out the eight targets, he will wake back up at the start of the loop. The player uses a combination of stealth, parkour, attack skills, guns, gadgets, and powers as in Arkane's previous Dishonored and Prey games to move about the game world. They must avoid or take out guards, learn the patterns of Colt's targets, and to figure out the right order to eliminate said targets using guns, melee attacks, or other environmental means\r\n\r\n**Nominees are:**\r\n\r\n- Deathloop\r\n\r\n- It Takes Two\r\n\r\n- Returnal\r\n\r\n- Psychonauts 2\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n## Best Narrative\r\n\r\n### WINNER: Marvel’s Guardians of the Galaxy\r\n\r\n![image](https://cdn2.unrealengine.com/egs-marvelsguardiansofthegalaxy-eidosmontral-g1a-00-1920x1080-289382e51c76.jpg)\r\n\r\nIn Marvel's Guardians of the Galaxy, the player assumes control of Peter Quill / Star-Lord from a third-person perspective. The player can utilize Star-Lord's elemental guns to defeat enemies, and fly through the air using his jet boots. Other members of the titular team, which include Gamora, Rocket Raccoon, Groot, and Drax the Destroyer, are not directly playable as they are controlled by artificial intelligence, but players can issue commands to them during combat. Each character has their own unique skills and abilities which can be chained together to inflict more damage. As the player fight enemies, a meter will build up and allow players to unleash a special ability known as \"Team Huddle\", which prompts Star-Lord to create a motivational speech and play a song to inspire his teammates. A good speech will grant the other Guardians gameplay benefits, though Star-Lord's abilities will be boosted regardless of the quality of the speech.\r\n\r\nAt various points of the game, the player can make key decisions, via dialogue trees, that will affect the relationships between the Guardians and the outcomes of certain missions. Throughout the game, Star-Lord's decisions will be referenced by his teammates. Despite the branching dialogue paths, the core story remains the same and the game has one ending\r\n\r\n**Nominees are:**\r\n\r\n- Deathloop\r\n\r\n- It Takes Two\r\n\r\n- Life is Strange: True Colors\r\n\r\n- Marvel’s Guardians of the Galaxy\r\n\r\n- Psychonauts 2\r\n\r\n## Best Art Direction\r\n\r\n### WINNER: Deathloop\r\n\r\n![image](https://cdn.vox-cdn.com/thumbor/2kBy8KhanMObawAjxtC3kZr3JUU=/0x0:3840x2160/1200x675/filters:focal(1613x773:2227x1387)/cdn.vox-cdn.com/uploads/chorus_image/image/69310744/Deathloop_Dual_Spikers_8637260997138ea1827.42474129.0.jpg)\r\n\r\n**Nominees are:**\r\n\r\n- Kena: Bridge of Spirits\r\n\r\n- Deathloop\r\n\r\n- Psychonauts 2\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n- The Artful Escape\r\n\r\n## Best Score and Music\r\n\r\n### WINNER: NieR Replicant ver.1.22474487139\r\n\r\n![image](https://imgix.kotaku.com.au/content/uploads/sites/3/2021/04/23/ihueqnelaahslncmwjpp.jpg)\r\n\r\nPlayers take control of a middle-aged man in Nier Gestalt and a teenaged boy in Nier Replicant, named by the player. The player directly controls the main character through a third-person perspective to interact with people, objects, and enemies throughout the game. The player can also turn the camera around the characters, which allows for a 360° view of the surroundings. The three-dimensional world is divided into areas separated by loading screens, and the player can move freely throughout these areas by walking, running, jumping, and climbing ladders. In some rooms and buildings, the camera swings to the side and the main character is restricted to moving as in a two-dimensional platforming environment, while during certain battles the camera pulls up to simulate a top-down shoot 'em up or other video game genres\r\n\r\n**Nominees are:**\r\n\r\n- Cyberpunk 2077\r\n\r\n- Deathloop\r\n\r\n- NieR Replicant ver.1.22474487139\r\n\r\n- Marvel’s Guardians of the Galaxy\r\n\r\n- The Artful Escape\r\n\r\n## Best Audio Design\r\n\r\n### WINNER: Forza Horizon 5\r\n\r\n![image](https://venturebeat.com/wp-content/uploads/2021/11/forzahorizon5-1.jpg)\r\n\r\nForza Horizon 5 is a racing video game set in an open world environment based in a fictional representation of Mexico. The game has the largest map in the entire Forza Horizon series, being 50% larger than Forza Horizon 4 while also having the highest point in the Horizon series. The map was described by creative director Mike Brown as one of the most diverse Forza Horizon maps the team has built. The map contains an active caldera volcano, jungles and beaches, ancient Mayan temples, and towns and cities such as Guanajuato. Players can explore the open world freely, though they can also compete in multiplayer races and complete the campaign mode. Both the cars featured in the game and the player character can be extensively customised.\r\n\r\n**Nominees are:**\r\n\r\n- Deathloop\r\n\r\n- Forza Horizon 5\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n- Resident Evil Village\r\n\r\n- Returnal\r\n\r\n## Best Indie\r\n\r\n### WINNER: Kena: Bridge of Spirits\r\n\r\n![image](https://www.nme.com/wp-content/uploads/2021/09/kena-bridge-of-spirits-1.jpg)\r\n\r\nKena: Bridge of Spirits is an action-adventure game played from a third-person perspective. The player controls Kena, a young spirit guide with magical abilities. In combat, the player uses Kena's staff for light, heavy, and charged attacks. An upgrade transforms the staff into a bow, which can be used to attack enemies, act as a grappling hook, or hit crystals to solve puzzles. When defending against enemies, the player can activate Kena's pulse ability, which acts as a shield and has a health meter that depletes when attacked; it also serves to provide clues and activate objects, and an upgrade allows the player to dash forwards, which can be used to pass through barriers to the Spirit Realm, dodge attacks and stun enemies, and corporealize spirit enemies. Activating the pulse ability before an attack stuns the enemy. The player also gains the ability to use Spirit Bombs, which can be used to float shimmering rocks for platforming or as an attack against enemies\r\n\r\n**Nominees are:**\r\n\r\n- 12 Minutes\r\n\r\n- Death’s Door\r\n\r\n- Kena: Bridge of Spirits\r\n\r\n- Inscryption\r\n\r\n- Loop Hero\r\n\r\n## Best Debut Indie\r\n\r\n### WINNER: Kena: Bridge of Spirits\r\n\r\n![image](https://crazygamer.ca/wp-content/uploads/2021/08/kena-bridge-of-spirits-1620308200917_160w.jpg)\r\n\r\n**Nominees are:**\r\n\r\n- Sable\r\n\r\n- Kena: Bridge of Spirits\r\n\r\n- The Artful Escape\r\n\r\n- The Forgotten City\r\n\r\n- Valheim\r\n\r\n## Best Mobile Game\r\n\r\n### WINNER: Genshin Impact\r\n\r\n![image](https://cdn1.epicgames.com/salesEvent/salesEvent/EGS_GenshinImpact_miHoYoLimited_S1_2560x1440-91c6cd7312cc2647c3ebccca10f30399)\r\n\r\nGenshin Impact is an open-world action role-playing game that allows the player to control one of four interchangeable characters in a party. Switching between characters can be done quickly during combat, allowing the player to use several different combinations of skills and attacks.  Characters may have their strengths enhanced in various ways, such as increasing a character's level and improving artifacts and the weapons that the character equips. In addition to exploration, the player can attempt various challenges for rewards. Scattered across Teyvat are bosses and challenges that reward highly valuable resources, such as Stormterror and the Electro Hypostasis, but claiming them uses up a currency called resin, which slowly regenerates over time. Completing these challenges grants the player progress towards increasing their Adventure Rank, which in turn unlocks new quests, challenges, and raises the World Level. The World Level is a measure of how strong the enemies within the world are and the rarity of rewards that defeating them gives\r\n\r\n**Nominees are:**\r\n\r\n- Fantasian\r\n\r\n- Genshin Impact\r\n\r\n- League of Legends: Wild Rift\r\n\r\n- MARVEL Future Revolution\r\n\r\n- Pokemon Unite\r\n\r\n## Best Action\r\n\r\n### WINNER: Returnal\r\n\r\n![image](https://i.pinimg.com/originals/08/80/f6/0880f6f95229577094ef8be092498639.png)\r\n\r\nReturnal is a third-person shooter video game featuring roguelike elements and covering the psychological horror genre. Set in a futuristic science fiction setting, the player controls Selene (Jane Perry), a space pilot, equipped with a suit and armed with high-tech weapons, who is stranded on the alien planet Atropos, and stuck in a time loop. After every death, Selene is resurrected, following a pattern of traversing across foreign environments and combating extraterrestrial entities with growing visions in an ever changing world\r\n\r\n**Nominees are:**\r\n\r\n- Back 4 Blood\r\n\r\n- Chivalry II\r\n\r\n- Deathloop\r\n\r\n- Far Cry 6\r\n\r\n- Returnal\r\n\r\n## Best Action/Adventure\r\n\r\n### WINNER: Metroid Dread\r\n\r\n![image](https://media.wired.com/photos/615de4bdcb3eb413e3a033ab/master/pass/Games-Metroid-Dread.jpg)\r\n\r\nMetroid Dread is an action-adventure game in which players control bounty hunter Samus Aran as she explores the planet ZDR. It retains the side-scrolling gameplay of previous Metroid games, alongside the free aim and melee attacks added in Samus Returns (2017). As the player explores, they discover new items and weapons, allowing them to access new areas\r\n\r\nDread adds stealth elements, with Samus avoiding the EMMI robots in certain areas by hiding, reducing her noise, and using the Phantom Cloak, camouflage that makes her invisible but slows her movement. If an EMMI catches Samus, the player has two brief chances to perform melee counters and escape. If they fail, Samus is killed. EMMIs can only be destroyed when Samus obtains the temporary \"Omega Blaster\" upgrade, which is lost upon using it to destroy one; however, destroying an EMMI grants Samus a new permanent upgrade. Players unlock images in an in-game gallery based on their completion time, difficulty level, and percentage of items collected\r\n\r\n**Nominees are:**\r\n\r\n- Marvel’s Guardians of the Galaxy\r\n\r\n- Metroid Dread\r\n\r\n- Psychonauts 2\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n- Resident Evil Village\r\n\r\n## Best Role Playing\r\n\r\n### WINNER: Tales of Arise\r\n\r\n![image](https://i.ytimg.com/vi/95h8JiignvA/maxresdefault.jpg)\r\n\r\nLike previous games in the series, Tales of Arise is an action role-playing game, although its gameplay has gone through unspecified alterations as part of its development goals while retaining the basic Tales battle system, dubbed the Linear Motion Battle System. The game has a big focus on evading and countering, with Tales of Graces, a 2009 entry praised for its combat, cited as inspiration. Unlike many of the previous titles in the series, the game doesn't feature multiplayer, with the development team deciding to focus on various interactions between characters in combat, including the addition of the \"Boost Strike\" feature, allowing multiple party members to perform destructive attacks together under certain conditions\r\n\r\n**Nominees are:**\r\n\r\n- Cyberpunk 2077\r\n\r\n- Monster Hunter Rise\r\n\r\n- Scarlet Nexus\r\n\r\n- Shin Megami Tensei V\r\n\r\n- Tales of Arise\r\n\r\n## Best Fighting\r\n\r\n### WINNER: Guilty Gear: Strive\r\n\r\n![image](https://cdn.akamai.steamstatic.com/steam/apps/1384160/capsule_616x353.jpg)\r\n\r\nIntended as a \"complete reconstruction of the franchise\", Guilty Gear Strive retains the core essence of the series but revamps many features and mechanics, except for the removal of the series’ signature mechanic, the Instant Kill. It introduces the \"Wall Break\" feature, which allows for stage transitions when a combo is initiated in the corner of the arena.\r\n\r\n**Nominees are:**\r\n\r\n- Demon Slayer: Kimetsu no Yaiba – The Hinokami Chronicles\r\n\r\n- Guilty Gear: Strive\r\n\r\n- Melty Blood: Type Lumina\r\n\r\n- Nickelodeon All-Star Brawl\r\n\r\n- Virtua Fighter 5: Ultimate Showdown\r\n\r\n## Best Family\r\n\r\n### WINNER: It Takes Two\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/HXDLVhmdqPzGJMtfysBjti.png)\r\n\r\n**Nominees are:**\r\n\r\n- It Takes Two\r\n\r\n- Mario Party Superstars\r\n\r\n- New Pokémon Snap\r\n\r\n- Super Mario 3D World + Bowser’s Fury\r\n\r\n- WarioWare: Get It Together!\r\n\r\n## Best Multiplayer\r\n\r\n### WINNER: It Takes Two\r\n\r\n![image](https://cdn.vox-cdn.com/thumbor/e7CjCG5gmFXnpbchq2xqUB2OdRY=/0x0:3819x1599/1200x675/filters:focal(1605x495:2215x1105)/cdn.vox-cdn.com/uploads/chorus_image/image/69017949/two.0.png)\r\n\r\n**Nominees are:**\r\n\r\n- Back 4 Blood\r\n\r\n- It Takes Two\r\n\r\n- Knockout City\r\n\r\n- Monster Hunter Rise\r\n\r\n- New World\r\n\r\nValheim\r\n \r\n## Most Anticipated\r\n\r\n### WINNER: Elden Ring\r\n\r\n![image](https://cdn.vox-cdn.com/thumbor/1A4-XjfBdFlaazdEv-74Nr4Hcnc=/0x0:1920x1280/1400x933/filters:focal(807x487:1113x793):no_upscale()/cdn.vox-cdn.com/uploads/chorus_image/image/70124039/elden_ring_1.0.jpg)\r\n\r\nElden Ring is an action role-playing game played in a third-person perspective and features elements similar to those found in its predecessors, the Souls series as well as Bloodborne and Sekiro: Shadows Die Twice, with gameplay focusing on combat and exploration. Director Hidetaka Miyazaki explained that players start with a linear opening but will eventually progress to freely explore the Lands Between, including its six main areas, as well as castles, fortresses, and catacombs scattered throughout the vast open-world map. These main areas are interconnected through a central hub that players can access later in the game's progression—similar to Firelink Shrine from Dark Souls—and will be explorable using the character's mount as the main mode of transport, although a fast travel system will be an available option. Throughout the game, players will encounter non-player characters (NPCs) and enemies alike, including the demigods who rule each main area and will serve as the game's main bosses\r\n\r\n**Nominees are:**\r\n\r\n- God of War Ragnarok\r\n\r\n- Elden Ring\r\n\r\n- Horizon Forbidden West\r\n\r\n- Sequel to The Legend of Zelda: Breath of the Wild\r\n\r\n- Starfield\r\n\r\n \r\n## Innovation in Accessibility\r\n\r\n### WINNER: Forza Horizon 5\r\n\r\n![image](https://assets.gamepur.com/wp-content/uploads/2021/06/13134935/Forza-Horizon-5-Official-Release-Date-Trailer-4K-_-E3-2021-00-01-44-.jpg)\r\n\r\n**Nominees are:**\r\n\r\n- Far Cry 6\r\n\r\n- Forza Horizon 5\r\n\r\n- Marvel’s Guardians of the Galaxy\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n- The Vale: Shadow of the Crown\r\n \r\n## Best Esports Game\r\n\r\n### WINNER: League of Legends\r\n\r\n![image](https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_obituary/public/d8/images/methode/2020/10/29/9ae7fa98-1902-11eb-8f67-a484f6db61a1_image_hires_022408.jpeg?itok=E90OZb1k&v=1603909455)\r\n\r\nSummoner's Rift is the flagship game mode of League of Legends and the most prominent in professional-level play. The mode has a ranked competitive ladder; a matchmaking system determines a player's skill level and generates a starting rank from which they can climb. There are nine tiers; the least skilled are Iron, Bronze, and Silver, and the highest are Master, Grandmaster, and Challenger\r\n\r\n**Nominees are:**\r\n\r\n- Call of Duty: Warzone\r\n\r\n- Counter-Strike: Global Offensive\r\n\r\n- DOTA2\r\n\r\n- League of Legends\r\n\r\n- Valorant"
	},
	{
		"_id": "6203bd57b0d50e4d201d5ef5",
		"title": " CES 2022: what will we see at the world’s largest electronics expo in January?",
		"abstract": "CES 2022 will return to Las Vegas – but will it be worth attending in-person?",
		"imageCover": "ces-logo.jpg",
		"tags": ["computer", "technology", "science", "events"],
		"category": "events",
		"typeFace": "feature",
		"author": "61ed7e4a3c05a74b3559bb4a",
		"markdown": "Watching CES online last year was certainly an experience – but we’re happy to see it return to its regular old in-person format for 2022. \r\n\r\nWhen it kicks off in January, CES 2022 will bring us a bevy of new devices from all the major players in the industry. We’ll see some cutting-edge TV technology from the likes of LG, Samsung and Sony, plus new laptops, smartphones, wearables and headphones, too. \r\n\r\nThat said, we’re expecting a slightly more subdued show than in years past due to the ongoing Covid-19 pandemic and its impact on international travel – but as of right now, the CTA says that most of the main players will be returning to their usual spots on the Las Vegas Convention Center show floor. It sounds like it will be slightly smaller than in years past, but with all of the same tech-y goodness that you’d expect from a CES.\r\n\r\n## CES 2022: Date and Timings\r\n\r\n![image](https://miro.medium.com/max/1000/1*MgdcQrN0nQa5DF2VqmVV4Q.jpeg)\r\n\r\nOfficially, CES 2022 runs from Wednesday, January 5 through Saturday, January 8, 2022. That’s when the show floor will be open, and you’ll be able to walk around to check out the different booths - as long as you have official documentation that you’ve been vaccinated.\r\n\r\nLike previous conferences, however, there are two days of press conferences that happen before the show floor opens that take place on Monday, January 3 and Tuesday, January 4. That includes CES Unveiled that takes place from 5 - 8 pm PST on Monday, January 3 and the big press events from LG, Samsung and Sony that happen on Tuesday at 8 am PST and run through the entire day.\r\n\r\nWhen most folks get there on Wednesday, the CES show floor will be open from 10 am PST until 6 pm PST then from 9 am to 6pm PST from Thursday to Friday. CES 2022 will officially wrap up at 4 pm PST on Saturday, January 8. \r\n\r\nSo what are we going to see there?\r\n\r\n## Samsung at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/XgiCMPpcmAXxJaPjkK8DLc-970-80.jpg.webp)\r\n\r\nFrom TVs to phones to appliances you’ll be able to buy next year, as well as chef bots and ball robot concepts that may never reach the market, Samsung always has a lot to show at CES, and we anticipate a similar range of products shown off at CES 2022. \r\n\r\nWe expect Samsung to show off a number of new 4K and 8K Neo QLED TVs, following up last year’s excellent Samsung QN90A and QN900A models. As far as phones go, we anticipate seeing some of its more recent mid-range phones as well as the long-delayed Samsung Galaxy S21 FE, and maybe even a hint of the upcoming Samsung Galaxy S22 flagship range.\r\n\r\n## Sony at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/3b1e077c48920e8f8fee4a0c4c3f3de6-970-80.jpg.webp)\r\n\r\nSony is always tough to nail down when it comes to CES plans. Some years they show up with a concept car. Other times they show up with an animatronic dog. You never really know what Sony will have in any given year. \r\n\r\nThat being said, we do have a few hunches of what we’re going to see there. From Sony’s audio department, we’re likely to see a new lineup of digital media players (i.e. Walkmans) as well as a pair of premium headphones or two. We’ll see some wireless speakers and, from the TV side, at least three to four new 4K and 8K screens to whet our appetites for the 2022 Sony TV lineup. \r\n\r\nSony usually doesn’t show off much from its camera business at CES but expect to at least hear how the company’s music and movie arms are doing. Will we see the PlayStation VR 2 there? Probably not, but we’ll certainly keep our eyes peeled just in case Sony surprises us.\r\n\r\n## TCL at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/2cEj53dGM34jiECtLEfuug-970-80.jpg.webp)\r\n\r\nTCL has embraced CES as a launchpad for its new products coming out in the year and concepts we might not see for awhile. Though some of those devices slated to come out get quietly delayed (or never release at all), there’s always an interesting range of TVs, phones, flexible-screen devices, and other gadgets from TCL, and we expect CES 2022 to be no different.\r\n\r\nGiven TVs are TCL’s bread and butter, we expect new 6-Series Mini LED TVs following up on last year's fantastic TCL 6-Series 8K. TCL is only a few years into releasing phones under its own name, and we expect a follow-up to the TCL 20 series released last year – perhaps the TCL 30 line. There could also be TCL Tab tablets to see, along with concept devices we can’t begin to predict.\r\n\r\n## Hisense at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/FLtFpvfPCcrk827heqRSzF-970-80.png.webp)\r\n\r\nHisense never gets the same amount of airtime as companies like Sony, Samsung and LG at CES, but it’s still worth a stop at the company’s booth if you’re walking around the Las Vegas Convention Center. What we’re expecting from Hisense this year is another lineup of Google TV-toting smart TVs for the UK as well as some nice new laser TVs for the US. \r\n\r\nIf you’re looking for super futuristic display technology, you’ll find it at Hisense’s booth as well – however, most of it is either conceptual or exclusive to the Chinese market. \r\n\r\n## Intel at CES 2022\r\n\r\n![image](https://static.techspot.com/images2/news/bigimage/2021/08/2021-08-19-image-12-j.webp)\r\n\r\nThe biggest reveal we expect from Intel at CES is the continued release of new Alder Lake CPUs. We’re expecting some of its flagship enthusiast silicon to be released in November, but those will mostly be high-end desktop chip. CES 2022 might see Alder Lake chips making it to the mobile computing segment, where the big.LITTLE architecture should significantly boost laptop energy efficiency.\r\n\r\nIf early indications hold up, the new Alder Lake chips might leave the Apple M1 and M1X processors in the dust along with AMD’s Zen 3 chips.\r\n\r\n## Panasonic at CES 2022\r\n\r\n![image](https://m.thepeninsulaqatar.com/get/maximage/20171010_1507665098-180025.jpg)\r\n\r\nPanasonic usually shows up to CES with two big announcements – one for its new OLED TV and another for its Technics line of vinyl players and headphones. This year, that could certainly change and Panasonic might surprise us with something totally new and different, but this game plan has always served Panasonic well in the past.\r\n\r\nUnfortunately, the rest of Panasonic’s announcement will likely come during IFA 2022 – which isn’t happening until September of next year. \r\nOur predictions for...\r\n\r\n## Phones at CES 2022\r\n\r\n![image](https://i2.wp.com/www.maggt.com/wp-content/uploads/2021/11/samsung-s21-fe-ces-launch.jpg)\r\n\r\nCES isn’t a big stage for phones coming out this year – that’s usually Mobile World Congress (MWC), which happens in February – but several brands choose to debut some new handsets at the first big annual show. These include some flagship devices but mostly mid-range and budget phones, as companies save their heavy hitters for MWC.\r\n\r\nAs previously mentioned in their own sections, we expect Samsung and TCL to have several devices on display, if previous CES shows are anything to go by. That includes pricier Samsung mid-range devices like follow-ups to the Samsung Galaxy A52 and Samsung Galaxy A72, as well as the potential debut of the still-unseen Samsung Galaxy S21 FE. For TCL, we’d expect the first round of devices in the TCL 30 lineup, with others coming later in the year.\r\n\r\nIt’s possible we see other brands show off their traditional phones, as Motorola has done with Moto G phones in years past. But we’re also expecting non-traditional phones, especially flexible-display devices: both the TCL Rollable and LG Rollable were shown off at CES 2021, and though neither has reached the market (RIP LG phones), they’re still showing where phone design could go.\r\n\r\n## Audio at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/vazDB9FLc4i3xaTE5B7yL4-970-80.jpg.webp)\r\n\r\nWe’re spoiled when it comes to audio products at trade shows. Between NAB, The Bristol Hi-Fi Show and CanJam, we have a new event every three months that will show us what’s hot in the world of hi-fi headphones, speakers and soundbars. That said, while we have plenty of opportunities to get our ears on the latest and greatest cans, CES provides the unique opportunity of seeing what comes next – i.e. the experimental stuff.\r\n\r\nIn years past, that’s included Creative’s Super X-Fi technology and Sony 360 Reality Audio and we’re expecting to see more upgrades to both technologies at this year’s event. \r\n\r\nBeyond headphones, expect to see plenty of new Bluetooth speakers and soundbars from LG, Samsung and Sony – plus bookshelves and standing speakers from Klipsch, JBL and more. That’s a fairly murky prediction, honestly, but the world of hi-fi moves fast and products are announced and released faster than most folks can keep up with them.\r\n\r\nTVs at CES 2022\r\n\r\n![image](https://mma.prnewswire.com/media/1685539/SKYWORTH_W82.jpg?p=facebook)\r\n\r\nBigger. Brighter. More pixels. Better contrast. It sounds so simple when you break it down like that, but in reality those are the four traits that every TV maker in the whole world are chasing right now. Bigger screens have always been a trend at CES but these past few years we’ve seen some truly super-sized models reaching upwards of 90 inches. Crossing that barrier will be difficult - and expensive - but it’s only a matter of time until we see affordable 100-inch TVs.\r\nAdvertisement\r\n\r\nIn terms of brightness and contrast, we’ll be looking for new Mini LED TVs to push the envelope on both fronts. We got our first batch of models from LG and Samsung this year in the form of the Samsung QN90A QLED TV and LG QNED99, and both blew us away. \r\n\r\nThere are some interesting rumors floating around about what could come next for display technologies - holographic and transparent TVs anyone? - but we’ll just have to wait until we get to Vegas to find out what the big three have in store for us.\r\n\r\n## Smart Home at CES 2022\r\n\r\n![image](https://d1wa5qhtul915h.cloudfront.net/app/uploads/2021/07/Bike-Europe-CES-2020.jpg)\r\n\r\nTouchless tech was a big thing at CES 2021; from Kohler’s kitchen faucet that can dispense water by simply placing a hand in front of it, to Arlo’s video doorbell that can alert you when someone is standing on your doorstep rather than actually needing to push the doorbell itself. Thanks to the on-going effects from the global pandemic we expect to see a lot more touchless tech at CES 2022. \r\n\r\nThere’s likely to also be the usual crop of smart home devices including home security cameras with better resolutions and smarter AI that can help ensure you’re not plagued by unwanted motions alerts. We also expect to see a plethora of robot vacuums that offer better suction and utilize AI to navigate around your home, carefully avoiding obstacles such as socks that have escaped from the laundry pile and rogue phone charging cables. \r\n\r\n## Wearables at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/XuFbfK4dg9YixtxCsrEPdP-970-80.jpg.webp)\r\n\r\nMost of the big names in fitness tracking (including Garmin and Fitbit) prefer to host their own events for each of their product launches rather than doing a big reveal at CES. That doesn’t mean Fitbit will be entirely absent from CES 2022, though.\r\n\r\nFitbit is now owned by Google, which is working to bring Fitbit apps and celebrations to its own smartwatch operating system, WearOS. CES is traditionally used as a showcase for new Wear OS watches, with companies like Skagen, Suunto, and Withings all showing off their latest Google-powered devices, so the 2022 show could give us our first glimpse of how the Fitbit integration will work on a smartwatch.\r\n\r\nWe could also see some fitness trackers that are a little outside the norm. At CES 2021, UK-based DNABand revealed a watch that uses data derived from a saliva sample to provide customized advice while you’re shopping for groceries. It’s likely that we’ll see something equally unusual at the 2022 show, and we’ll be keeping a close eye on the startups showing off weird and wonderful wearables in the hopes of attracting an investor’s attention.\r\n\r\nOne final possibility is the appearance of ‘fitness tracking as a service’. We’ve seen some interesting developments in this area recently, with Amazon and Fitbit both releasing new devices that keep some insights hidden behind a paywall. At CES 2022, it’s possible that we might get our first glimpse of a fitness tracker that’s free up-front, but requires a rolling monthly subscription if you want to see your health data.\r\n\r\n## CES 2022: how to register\r\n\r\n![image](https://larepublica.pe/resizer/vvGDWnZ22WVd5KPxzoNVqt6XDbU=/1200x660/top/cloudfront-us-east-1.images.arcpublishing.com/gruporepublica/WPYHOGS5YNDHRJULOUXR3N2CDI.jpg)\r\n\r\nRegistration for CES 2022 is available now to the consumer technology industry now at the [CES website.](https://www.ces.tech/Logistics/Register-Now.aspx) In terms of cost, the CTA plans to charge a $300 fee. The fee will apply to most attendees, including retailers, but like in past years, credentialed journalists and analysts will be exempt."
	},
	{
		"_id": "6203bd57b0d50e4d201d5ef6",
		"title": " Best college laptops for students, from budget laptops to workstations.",
		"abstract": "The complete list of best laptops available for the college students to help their coding.",
		"imageCover": "laptop-cover.jpg",
		"tags": ["computer", "technology", "general"],
		"category": "general",
		"typeFace": "feature",
		"author": "61ed7e4a3c05a74b3559bb4d",
		"markdown": "If you're a student, you'll want one of the best college laptops so you can ace your exams then stream TV or play games when it's time to relax. But with so many choices at so many different prices, it can be homework in itself to find the very best laptops for students. \r\n\r\nWhen you're buying a laptop for school, make sure it has long battery life and fast CPU performance. You can find a lot of these units on our main best laptops page, which gives you a wide selection of the top notebooks to choose from. And if you prefer to take notes by hand, buy one of the best 2-in-1 laptops. We've also ranked the best gaming laptops for those who like to unwind after the coursework is wrapped up. We're still in a process of reviewing some laptops that could find their way on this list, so be sure to check back in regularly for the latest and great laptops for students. \r\n\r\n## HP Envy . \r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/X65pzFAjWZpsydiR8L5XoK-970-80.jpg.webp)\r\n\r\nThe best laptop for students is now better than ever. Refreshed with a new design and a Thunderbolt 4 port, the new HP Envy 13 is the best sub-$1,000 laptop for students or anyone who needs a portable machine with loads of power and long battery life (11:15 on the FHD model). \r\n\r\nWith even slimmer bezels and faster performance, the 2021 model shows that it can hang with much pricier flagship models. Combine those features with a sleek chassis, bright and vivid 1080p display and plenty of performance from an 11th Gen Core i5 CPU, and it's easy to see why the Envy 13 is the best college laptop for students. And frankly, given that this is a budget laptop compared to many of the others on this list, the Envy 13 is an awesome choice. If you need a larger display, see our HP Envy 14 review. \r\n\r\n## MacBook Air with M1\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/AUaDk6VmkFriSBiQJHrx4V-970-80.jpg.webp)\r\n\r\nIf you prefer macOS to Windows 10, then go with the Apple MacBook Air. The biggest improvement to this year's model is the new M1 chip, which delivers outstanding performance and excellent battery life, making the new MacBook Air the fastest ultrathin laptop ever.  \r\n\r\nBest of all, the MacBook Air still costs only $999, and yet, you can unrivaled performance along with 14 hours and 41 minutes of battery life. This is a combination you'll only find from the very best Windows 10 laptops, and even they can't compete in head-to-head performance. \r\n\r\nSo why buy the MacBook Air instead of the Pro? While the Pro has better sustained performance, the MacBook Air is cheaper and is pin-drop silent because it doesn't have a fan. And, of course, Apple's least expensive 13.3-inch model is the most portable, coming in at only 0.6 inches thick and 2.8 pounds. \r\n\r\nBut now the MacBook Air is slower to parity with the MacBook Pro than ever before. It has similar speed and battery life, the same 720p webcam, a comfortable Magic keyboard and two USB-C ports. Also, the 13.3-inch, 2560 x 1600-pixel Retina display on the M1 model was improved with P3 color coverage, making it more vibrant than the previous panel. \r\n\r\n## Dell XPS 13 \r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/8dTpBaD5tdkcVwYhFpJvfb-970-80.jpeg.webp)\r\n\r\nThe Dell XPS 13 is a serious workhorse and the best premium laptop for college students. Powered by an 11th Gen Intel Core i7 processor with integrated Intel Iris Xe graphics, the notebook is ready for work or play. And with more than 11 hours of battery life, you've got plenty of time for both. The laptop consistently performed either better or on a par with competing systems.\r\n\r\nBut rest assured, the XPS 13 is just as pretty as it is powerful. The company managed to make a laptop that's smaller and lighter than previous models. Despite the smaller size, Dell added some big changes, including a larger trackpad and keyboard. Plus, you get a 13.4-inch, near-bezelless display on every side –– the first in the world to do so. \r\nAdvertisement\r\n\r\nIt's an exercise in patient restraint, improving the notebook in a bunch of small ways that add up to a big leap for the system. If you're looking for the total package, the Dell XPS 13 is the laptop for you. \r\n\r\n\r\n## HP Envy x360 \r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/rZxKJRZLwQ6RDgWHCJnRTM-970-80.jpg.webp)\r\n\r\nThe HP Envy x360 13 is the best laptop for under $1,000 and one of the best Ultrabooks on the market. While it doesn't come with a stylus (neither does the Surface Pro), the Envy is a 2-in-1, which lets you flip it into tent or tablet mode. What makes this such a fantastic value is its entirely aluminum design and Herculian AMD Ryzen processors. \r\n\r\nIn our testing, we found that an Envy x360 13 with a Ryzen 5 4500U CPU can outperform laptops with 10th Gen Intel chips. This specific Envy costs just $800 and can outmuscle laptops that cost well over $1,000, including the exorbitant MacBook Pro. Moreover, the Envy x360 13 has a bright, vivid 13.3-inch display and a comfortable keyboard. \r\n\r\nThere is very little we don't like about the Envy x360. If you can get over the lack of a Thunderbolt 3 port and IR camera, then it is the ultimate money-saving laptop. If you prefer a larger display, see our HP Envy x360 15 review. \r\n\r\n\r\n## Apple MacBook Pro \r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/GhzFxPPWGGom7wLjUjQYDA-970-80.jpg.webp)\r\n\r\nThis is the huge leap forward we've been waiting on. It is all thanks to the new M1 chip, Apple's first-ever custom SoC for laptops. With the best power-per-watt performance of any processor, the M1 brings the MacBook Pro's performance and battery life to the next level.\r\n\r\nMore specifically, the MacBook Pro is more powerful than nearly every PC on the market, including some workstations. And despite cramming so much power into such a slim and sleek chassis, the Pro lasted for an outstanding 16 hours and 32 minutes on our battery test, which simulates real-world testing.\r\n\r\nWith an image processing unit, the webcam (sadly, still 720p) is better than before and since it runs on Apple's ARM-based architecture, iPad and iPhone apps are now available on Mac. Yep, you can run all your favorite iOS games and apps on your laptop now. \r\n\r\nRounding out the numerous enhancements found in the latest MacBook Pro is Big Sur, the latest version of macOS. The largest update since OS X launched a decade ago, Big Sur is a beautiful redesign of the desktop OS.  \r\n\r\n## HP Spectre x360 14\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/qBfGdkRvjJszWvRJGJfdhS-970-80.jpg.webp)\r\n\r\nThe Spectre x360 14 is the best 2-in-1 laptop ever. Newly released for 2021, the 13.5-inch model builds upon its predecessors but adds useful new features including a 3:2 aspect ratio display and 11th Gen Intel CPUs with Iris Xe graphics. Highlights of this laptop include a stunning design, bright and vivid 1920 x 1280-pixel IPS and 3K2K OLED display options, epic 12+ hour battery life and fast overall performance. \r\n\r\nAdd to that a generously sized touchpad that is silky to the touch as well as a comfortable (albeit shallow) keyboard, excellent security options (fingerprint sensor and facial recognition) and a good selection of ports, and well, it's easy to see why we like this laptop so much. \r\n\r\nWe recommend buying the Spectre x360 14 over the Envy 13 if you have the money, especially if you need the flexible design. In fact, the Spectre x360 14 is the best laptop if you want a convertible notebook, period. Sure, it has a few faults, but those are easily forgotten once you get this beauty in your hands. \r\n\r\n## Acer Swift 3 (2020, AMD Ryzen)\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/ZwJ97S9pSrMho8diQwGUp6-970-80.jpg.webp)\r\n\r\nIf you want blistering performance at a budget price, look no further than the Acer Swift 3 with AMD Ryzen CPUs. This $649 laptop can outperform the Dell XPS 13 and even make a run at the MacBook Pro. It's really all about the Ryzen 7 4700U CPU inside, which trounces its Intel opposites in raw performance.\r\n\r\nWe also like the Swift 3's clicky keyboard, which was comfortable to type on thanks to the springy feedback. You also get a fingerprint reader on the deck for quick login and the chassis is made of aluminum and magnesium, not plastic. Our biggest beef with the Swift 3 is the dim and dull display. If that isn't a concern for you, the Swift 3 is an excellent choice at a reasonable price.\r\n\r\n## Lenovo ThinkPad X1 Carbon (Gen 9)\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/BqTQ8aW42Gur7FfwNBayeZ-970-80.jpg.webp)\r\n\r\nLenovo made several welcome changes to the 9th Gen edition of its flagship business laptop. Along with fast performance from 11th Gen Intel CPUs, you get longer battery life (15 hours!), powerful quad speakers, a new 14-inch display with a 16:10 aspect ratio, and plenty of ports, all in an impossibly lightweight chassis (2.5 pounds). \r\n\r\nBut it's still those classic ThinkPad features —  a durable design (with MIL-STD-810G strength), best-in-class keyboard and stealthy black/red aesthetics — that carry the X1 Carbon to greatness.\r\n\r\nYes, we wish the ThinkPad X1 Carbon had a better webcam and hadn't ditched the SD card reader in the previous. Also, top configurations can get very expensive; still, you'd be hard-pressed to find a better business laptop for students going to college. If you want a 2-in-1 laptop with business features, consider the ThinkPad X1 Yoga (Gen 6).\r\n\r\n## Google Pixelbook Go\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/joGUDW4Gb6K49nGB4YHDcH-970-80.jpg.webp)\r\n\r\nThe Google Pixelbook Go is a fantastic laptop for students because you get the same sleek elegance as the Pixelbook but at a much lower cost. Starting at $649, the Pixelbook Go is among the cheapest laptops on this list, yet it delivers a lightweight chassis, fast performance and epic battery life. \r\nAdvertisement\r\n\r\nMore classrooms are shifting to Chromebooks, so the Pixelbook Go should feel familiar to students. It's an easy-to-use, lightweight operating system centered around the Chrome browser. What makes the Pixelbook Go such a good option is that it's durable and powerful enough to survive for several years, so buy it for your freshman child and it should last him through high school graduation and into college.\r\n\r\n## Lenovo Legion 5 Pro\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/zrRpB2DYw3MqQEPXwFtBSN-970-80.jpg.webp)\r\n\r\nLenovo's Legion 5 Pro proves what's possible when two opposing forces come together for the greater good. Those forces are AMD and Nvidia, and the greater good is the gaming community. Armed with an AMD Ryzen 7 5800 CPU and Nvidia GeForce RTX 3070 graphics, the Legion 5 Pro gives gamers the power they need to run the latest AAA titles at Ultra graphics settings. \r\n\r\nWhat it lacks in flashy aesthetics, it makes up for with a gorgeous 16-inch QHD display, an exceptional keyboard and touchpad, plenty of ports, and outstanding performance from the one-two punch of an AMD CPU and Nvidia GPU. And despite harnessing so much power, the Legion 5 Pro delivers respectable battery life. \r\n\r\nThanks for reading this far!"
	},
	{
		"_id": "6203bd57b0d50e4d201d5ef7",
		"title": "AMD could have a secret weapon to make gaming laptops better",
		"abstract": "RX 6000S mobile graphics cards might make their presence felt soon",
		"imageCover": "amd-cover.jpg",
		"tags": ["computer", "technology", "gaming"],
		"category": "technology",
		"typeFace": "main",
		"author": "61ed7e4a3c05a74b3559bb4d",
		"markdown": "AMD could be about to introduce new graphics cards for laptops, at least going by the rumor mill which predicts revamped RDNA 2 GPUs are waiting in the wings. The possible refresh of RX 6000 mobile GPUs might be based on TSMC’s 6nm process, and could be named as the RX 6000S series. VideoCardz cites hardware leaker Disclosuzen on Twitter as the source for details on these purported new graphics solutions (though note that as PC Gamer, which spotted this, observes, the leaker’s Twitter account has been suspended).\r\n\r\n![image](https://www.amd.com/system/files/2021-03/749511-amd-radeon-6000-series-4-gpus-1290x709_0.png)\r\n\r\nBacking this up, another well-known hardware leaker on Twitter, Greymon55, has previously theorized (a few months back) that AMD has a 6nm-based refresh of the 6000 mobile series inbound, though they believed it would be kick off with the RX 6900M, whereas this fresh leak claims it’ll be the RX 6800S.\r\n\r\nThe charge could be led by that RX 6800S, and apparently there may be other revamped laptop GPUs in line with that, as you might expect; but not the whole range. Greymon55 has previously guessed that we could see up to four models in the new ‘S’ series. Heavy salt with all this, it goes without saying.\r\n\r\nAs for rumored specs, apparently the RX 6800S will keep the same core count (2,560) and bus as the existing 6800M, but due to dropping to 6nm (from 7nm with the existing GPU), the 6800S should be capable of higher clock speeds for better performance.\r\n\r\n![image](https://i.itworldcanada.com/wp-content/uploads/2020/10/amd-radeon-rx-6000-feature.jpg)\r\n\r\nThe RX 6800S (the ‘S’ stands for Super, right?) could obviously be a useful boost for AMD’s laptop GPU line-up, and on 6nm rather than 7nm, as we observed above, it could potentially ramp up clocks nicely; and the other big plus would be improved power-efficiency, too. Of course, when it comes to laptop hardware which is packed into a tight chassis – where heat and the space for adequate cooling solutions becomes a trickier balancing act – more efficiency is a major boon.\r\n\r\nThat said, there’s little info on the potential spec yet, so we shouldn’t build up any expectations on the performance front. We’ve also heard arguments pushing the idea that 6nm may not offer much in terms of extra oomph or efficiency (but even if any performance gains were minimal, dropping to 6nm would still improve availability of GPUs – always an issue these days – simply because there’ll be more chips from a single wafer).\r\n\r\nWe’ll just have to see how things pan out, but if these new laptop graphics cards are indeed real, we’ll likely witness more spillage on them soon enough. Meanwhile, Nvidia is rumored to have new RTX 3000 Ti GPUs for laptops ready to launch at CES 2022, just around the corner at the start of January, with an RTX 3070 Ti mobile version recently being spotted in leaked product details of an Acer laptop."
	}, {
		"_id": "6203bd57b0d50e4d201d5ef8",
		"title": "DUPLICATE Can’t wait for Intel Arc Alchemist GPUs? We may have some bad news...",
		"abstract": " Slight doubts aired over Intel’s Q1 release timeframe via the rumor mill",
		"imageCover": "intel-arc.jpeg",
		"tags": ["technology", "computer"],
		"category": "technology",
		"typeFace": "feature",
		"author": "61ed7e4a3c05a74b3559bb4a",
		"markdown": "Intel’s Arc Alchemist graphics chips have been shown in a video, complete with fresh rumors about the possible launch schedule. This comes from YouTuber Moore’s Law is Dead (MLID), a common source of Intel and AMD leaks, who shared some images in a video (spotted by VideoCardz), with the pics showing what appears to be two different graphics chips, high-end with up to 512 EUs (or Execution Units) and low-end with up to 128 EUs. MLID further speculates on Intel’s launch timeframes for next year, although this is on even shakier territory, and apparently even the chip giant itself has had difficulty pinning down a release schedule, with dates being moved multiple times according to sources.\r\n\r\n![images](https://i.cdn.newsbytesapp.com/images/l24420210817174233.jpeg)\r\n\r\nThe theory as it stands, though, is that while Intel appears confident of a Q1 2022 launch, MLID is still a little doubtful  that we’ll see products out there and available to buy in the first quarter. MLID further asserts that we could see the low-end Alchemist GPU (128 EUs) launch in the form of desktop graphics cards first, rather than mobile (the latter being first out the gate was what the rumor mill previously contended – and of course, that could still happen). These will likely emerge in April, or perhaps late March, meaning Q1 could still be a possibility (just about), to be followed by the high-end GPUs (512 EUs) likely later in April – assuming the drivers are ready.\r\n\r\n![image](https://static.techspot.com/images2/news/bigimage/2021/08/2021-08-24-image-26.jpg)\r\n\r\nThere are a lot of ifs and buts here, and indeed another point mentioned by MLID is that Intel’s flagship desktop reference boards may not be ready until mid-Q2, and there’s a possibility that third-party graphics cards could be out before the actual reference product. Or Intel might just let card makers do a paper launch, and hold up until a simultaneous release with reference boards is possible.\r\n\r\nIt seems possible, then, that we may see a reversal of the situation that was previously rumored whereby Intel would release laptop Alchemist GPUs first, then desktop cards. Desktop GPUs may come first, perhaps, but may not arrive until April, which is slightly disappointing. Then again, MLID also floats the possibility that low-end laptop cards might come first. The picture is unclear, with Intel apparently switching around the intended release schedule with some regularity.\r\n\r\n![image](https://www.notebookcheck.com/fileadmin/Notebooks/News/_nc3/Intel_ARC_Alchemist_Reference_Graphics_Card_Final_Design_Renders__8_2060x1299.png)\r\n\r\nIt sounds like nothing is set in stone, really, and that this has led MLID to doubt whether Intel might have anything but a paper launch in Q1 (and perhaps a tiny amount of product). A lot may depend on the state of play with the graphics driver, too, and while MLID makes it clear that he isn’t worried about the quality of Intel’s work on the driver long-term, Team Blue might struggle to get it fully in shape and optimized (particularly for the high-end GPU) to hit late March or early April. All of which isn’t what we really want to hear – we’d like leaks to be pointing to something definitely happening in Q1, of course, but it seems like there could be a possibility of things slipping.\r\n\r\nAll that said, Intel seems to have been pretty confident talking about a Q1 release, and again confirmed this timeframe in a video showing various games being run by an Alchemist GPU aired last week.\r\n\r\nWhat’s also interesting to hear from MLID is that Intel is set to really push at the budget end of the graphics card market, which will be music to the ears of those hunting for a wallet-friendly GPU, and having real problems finding viable candidates right now. There are fresh budget options purportedly in the pipeline from both AMD and Nvidia in the near future, of course, but it sounds like Intel is shaping up to make an impressive assault on the low-end GPU sector for laptops and desktops alike. Exciting times ahead…"
	},
	{
		"_id": "6203bd57b0d50e4d201d5ef9",
		"title": "DUPLICATE Game Awards 2021: Here’s the full list of winners",
		"abstract": "It Take Two wins the Game of the Year, and ties with Forza Horizon 5 for lifting 3 trophies",
		"imageCover": "game-awards.jpg",
		"tags": ["gaming", "entertainment"],
		"category": "gaming",
		"typeFace": "main",
		"author": "61ed7e4a3c05a74b3559bb4a",
		"markdown": "Hosted by Geoff Keighley, The Game Awards 2021 stunned the internet with the biggest reveals and honouring the most well-received titles this year. Arkane Studios’ Deathloop, despite earning nine spots on the nomination list, barely scratched the surface with 2 victories.\r\n\r\nOn the other hand, Hazelight studio’s co-op game, It Takes Two, which bagged five spots on the list, won 3 awards, including the prestigious Game of the Year trophy. This comes as a big relief for director Joseph Fares, who recently received a trademark claim from GTA parent company, Take-Two over similar-sounding names. Following the disastrous launch of the Marvel’s Avengers game, even Square Enix earned a redemption arc when Guardians of the Galaxy lifted the trophy for best narrative.\r\n\r\nIn the Player’s Choice category, Halo Infinite came victorious, despite only having released 2 nights ago. Keanu Reeves made an appearance this year as well, alongside co-star Carrie-Ann Moss to promote their film and the new Unreal Engine 5 tech demo – The Matrix Awakens. Players can download the game for free on their PS5 or Xbox Series X|S consoles and play a few missions based on iconic moments from the franchise.\r\n\r\nWith all that out of the way, here’s a complete list of winners from The Game Awards 2021.\r\n\r\n## Game of the Year\r\n\r\n### WINNER: It Takes Two (Hazelight Studios/EA)\r\n\r\n![image](https://static.digit.in/default/6f18903bae0b3317168eaacb4f93c1a3d915110b.jpeg)\r\n\r\nIt Takes Two is an action-adventure video game with elements from platform games. It is specifically designed for split-screen cooperative multiplayer, which means that it must be played with another player through either local or online play. The game features a large number of game mechanics from various video game genres. These gameplay mechanics are connected to the story and the theme of the level. For instance, in one level, Cody gains the ability to rewind time, whereas May can replicate herself. Players have to cooperate with each other and utilize these abilities in order to progress. The game also features a large number of minigames. \r\n\r\n**Nominees are:**\r\n\r\n- Deathloop (Arkane Studios/Bethesda)\r\n\r\n- It Takes Two (Hazelight Studios/EA)\r\n\r\n- Metroid Dread (Mercury Steam/Nintendo)\r\n\r\n- Psychonauts 2 (Double Fine/Xbox Game Studios)\r\n\r\n- Ratchet & Clank: Rift Apart (Insomniac Games/SIE)\r\n\r\n- Resident Evil Village (Capcom)\r\n\r\n## Best Game Direction\r\n\r\n### WINNER: Deathloop\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/NjKmtsWPWi8FxpXxtT6Grk.jpg)\r\n\r\nIn Deathloop, the player takes on the role of Colt, an assassin stuck in a time loop who has been tasked to take out eight targets called Visionaries across the island before midnight, as leaving even one alive will cause the time loop to reset and undo his work. Further, should Colt die before taking out the eight targets, he will wake back up at the start of the loop. The player uses a combination of stealth, parkour, attack skills, guns, gadgets, and powers as in Arkane's previous Dishonored and Prey games to move about the game world. They must avoid or take out guards, learn the patterns of Colt's targets, and to figure out the right order to eliminate said targets using guns, melee attacks, or other environmental means\r\n\r\n**Nominees are:**\r\n\r\n- Deathloop\r\n\r\n- It Takes Two\r\n\r\n- Returnal\r\n\r\n- Psychonauts 2\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n## Best Narrative\r\n\r\n### WINNER: Marvel’s Guardians of the Galaxy\r\n\r\n![image](https://cdn2.unrealengine.com/egs-marvelsguardiansofthegalaxy-eidosmontral-g1a-00-1920x1080-289382e51c76.jpg)\r\n\r\nIn Marvel's Guardians of the Galaxy, the player assumes control of Peter Quill / Star-Lord from a third-person perspective. The player can utilize Star-Lord's elemental guns to defeat enemies, and fly through the air using his jet boots. Other members of the titular team, which include Gamora, Rocket Raccoon, Groot, and Drax the Destroyer, are not directly playable as they are controlled by artificial intelligence, but players can issue commands to them during combat. Each character has their own unique skills and abilities which can be chained together to inflict more damage. As the player fight enemies, a meter will build up and allow players to unleash a special ability known as \"Team Huddle\", which prompts Star-Lord to create a motivational speech and play a song to inspire his teammates. A good speech will grant the other Guardians gameplay benefits, though Star-Lord's abilities will be boosted regardless of the quality of the speech.\r\n\r\nAt various points of the game, the player can make key decisions, via dialogue trees, that will affect the relationships between the Guardians and the outcomes of certain missions. Throughout the game, Star-Lord's decisions will be referenced by his teammates. Despite the branching dialogue paths, the core story remains the same and the game has one ending\r\n\r\n**Nominees are:**\r\n\r\n- Deathloop\r\n\r\n- It Takes Two\r\n\r\n- Life is Strange: True Colors\r\n\r\n- Marvel’s Guardians of the Galaxy\r\n\r\n- Psychonauts 2\r\n\r\n## Best Art Direction\r\n\r\n### WINNER: Deathloop\r\n\r\n![image](https://cdn.vox-cdn.com/thumbor/2kBy8KhanMObawAjxtC3kZr3JUU=/0x0:3840x2160/1200x675/filters:focal(1613x773:2227x1387)/cdn.vox-cdn.com/uploads/chorus_image/image/69310744/Deathloop_Dual_Spikers_8637260997138ea1827.42474129.0.jpg)\r\n\r\n**Nominees are:**\r\n\r\n- Kena: Bridge of Spirits\r\n\r\n- Deathloop\r\n\r\n- Psychonauts 2\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n- The Artful Escape\r\n\r\n## Best Score and Music\r\n\r\n### WINNER: NieR Replicant ver.1.22474487139\r\n\r\n![image](https://imgix.kotaku.com.au/content/uploads/sites/3/2021/04/23/ihueqnelaahslncmwjpp.jpg)\r\n\r\nPlayers take control of a middle-aged man in Nier Gestalt and a teenaged boy in Nier Replicant, named by the player. The player directly controls the main character through a third-person perspective to interact with people, objects, and enemies throughout the game. The player can also turn the camera around the characters, which allows for a 360° view of the surroundings. The three-dimensional world is divided into areas separated by loading screens, and the player can move freely throughout these areas by walking, running, jumping, and climbing ladders. In some rooms and buildings, the camera swings to the side and the main character is restricted to moving as in a two-dimensional platforming environment, while during certain battles the camera pulls up to simulate a top-down shoot 'em up or other video game genres\r\n\r\n**Nominees are:**\r\n\r\n- Cyberpunk 2077\r\n\r\n- Deathloop\r\n\r\n- NieR Replicant ver.1.22474487139\r\n\r\n- Marvel’s Guardians of the Galaxy\r\n\r\n- The Artful Escape\r\n\r\n## Best Audio Design\r\n\r\n### WINNER: Forza Horizon 5\r\n\r\n![image](https://venturebeat.com/wp-content/uploads/2021/11/forzahorizon5-1.jpg)\r\n\r\nForza Horizon 5 is a racing video game set in an open world environment based in a fictional representation of Mexico. The game has the largest map in the entire Forza Horizon series, being 50% larger than Forza Horizon 4 while also having the highest point in the Horizon series. The map was described by creative director Mike Brown as one of the most diverse Forza Horizon maps the team has built. The map contains an active caldera volcano, jungles and beaches, ancient Mayan temples, and towns and cities such as Guanajuato. Players can explore the open world freely, though they can also compete in multiplayer races and complete the campaign mode. Both the cars featured in the game and the player character can be extensively customised.\r\n\r\n**Nominees are:**\r\n\r\n- Deathloop\r\n\r\n- Forza Horizon 5\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n- Resident Evil Village\r\n\r\n- Returnal\r\n\r\n## Best Indie\r\n\r\n### WINNER: Kena: Bridge of Spirits\r\n\r\n![image](https://www.nme.com/wp-content/uploads/2021/09/kena-bridge-of-spirits-1.jpg)\r\n\r\nKena: Bridge of Spirits is an action-adventure game played from a third-person perspective. The player controls Kena, a young spirit guide with magical abilities. In combat, the player uses Kena's staff for light, heavy, and charged attacks. An upgrade transforms the staff into a bow, which can be used to attack enemies, act as a grappling hook, or hit crystals to solve puzzles. When defending against enemies, the player can activate Kena's pulse ability, which acts as a shield and has a health meter that depletes when attacked; it also serves to provide clues and activate objects, and an upgrade allows the player to dash forwards, which can be used to pass through barriers to the Spirit Realm, dodge attacks and stun enemies, and corporealize spirit enemies. Activating the pulse ability before an attack stuns the enemy. The player also gains the ability to use Spirit Bombs, which can be used to float shimmering rocks for platforming or as an attack against enemies\r\n\r\n**Nominees are:**\r\n\r\n- 12 Minutes\r\n\r\n- Death’s Door\r\n\r\n- Kena: Bridge of Spirits\r\n\r\n- Inscryption\r\n\r\n- Loop Hero\r\n\r\n## Best Debut Indie\r\n\r\n### WINNER: Kena: Bridge of Spirits\r\n\r\n![image](https://crazygamer.ca/wp-content/uploads/2021/08/kena-bridge-of-spirits-1620308200917_160w.jpg)\r\n\r\n**Nominees are:**\r\n\r\n- Sable\r\n\r\n- Kena: Bridge of Spirits\r\n\r\n- The Artful Escape\r\n\r\n- The Forgotten City\r\n\r\n- Valheim\r\n\r\n## Best Mobile Game\r\n\r\n### WINNER: Genshin Impact\r\n\r\n![image](https://cdn1.epicgames.com/salesEvent/salesEvent/EGS_GenshinImpact_miHoYoLimited_S1_2560x1440-91c6cd7312cc2647c3ebccca10f30399)\r\n\r\nGenshin Impact is an open-world action role-playing game that allows the player to control one of four interchangeable characters in a party. Switching between characters can be done quickly during combat, allowing the player to use several different combinations of skills and attacks.  Characters may have their strengths enhanced in various ways, such as increasing a character's level and improving artifacts and the weapons that the character equips. In addition to exploration, the player can attempt various challenges for rewards. Scattered across Teyvat are bosses and challenges that reward highly valuable resources, such as Stormterror and the Electro Hypostasis, but claiming them uses up a currency called resin, which slowly regenerates over time. Completing these challenges grants the player progress towards increasing their Adventure Rank, which in turn unlocks new quests, challenges, and raises the World Level. The World Level is a measure of how strong the enemies within the world are and the rarity of rewards that defeating them gives\r\n\r\n**Nominees are:**\r\n\r\n- Fantasian\r\n\r\n- Genshin Impact\r\n\r\n- League of Legends: Wild Rift\r\n\r\n- MARVEL Future Revolution\r\n\r\n- Pokemon Unite\r\n\r\n## Best Action\r\n\r\n### WINNER: Returnal\r\n\r\n![image](https://i.pinimg.com/originals/08/80/f6/0880f6f95229577094ef8be092498639.png)\r\n\r\nReturnal is a third-person shooter video game featuring roguelike elements and covering the psychological horror genre. Set in a futuristic science fiction setting, the player controls Selene (Jane Perry), a space pilot, equipped with a suit and armed with high-tech weapons, who is stranded on the alien planet Atropos, and stuck in a time loop. After every death, Selene is resurrected, following a pattern of traversing across foreign environments and combating extraterrestrial entities with growing visions in an ever changing world\r\n\r\n**Nominees are:**\r\n\r\n- Back 4 Blood\r\n\r\n- Chivalry II\r\n\r\n- Deathloop\r\n\r\n- Far Cry 6\r\n\r\n- Returnal\r\n\r\n## Best Action/Adventure\r\n\r\n### WINNER: Metroid Dread\r\n\r\n![image](https://media.wired.com/photos/615de4bdcb3eb413e3a033ab/master/pass/Games-Metroid-Dread.jpg)\r\n\r\nMetroid Dread is an action-adventure game in which players control bounty hunter Samus Aran as she explores the planet ZDR. It retains the side-scrolling gameplay of previous Metroid games, alongside the free aim and melee attacks added in Samus Returns (2017). As the player explores, they discover new items and weapons, allowing them to access new areas\r\n\r\nDread adds stealth elements, with Samus avoiding the EMMI robots in certain areas by hiding, reducing her noise, and using the Phantom Cloak, camouflage that makes her invisible but slows her movement. If an EMMI catches Samus, the player has two brief chances to perform melee counters and escape. If they fail, Samus is killed. EMMIs can only be destroyed when Samus obtains the temporary \"Omega Blaster\" upgrade, which is lost upon using it to destroy one; however, destroying an EMMI grants Samus a new permanent upgrade. Players unlock images in an in-game gallery based on their completion time, difficulty level, and percentage of items collected\r\n\r\n**Nominees are:**\r\n\r\n- Marvel’s Guardians of the Galaxy\r\n\r\n- Metroid Dread\r\n\r\n- Psychonauts 2\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n- Resident Evil Village\r\n\r\n## Best Role Playing\r\n\r\n### WINNER: Tales of Arise\r\n\r\n![image](https://i.ytimg.com/vi/95h8JiignvA/maxresdefault.jpg)\r\n\r\nLike previous games in the series, Tales of Arise is an action role-playing game, although its gameplay has gone through unspecified alterations as part of its development goals while retaining the basic Tales battle system, dubbed the Linear Motion Battle System. The game has a big focus on evading and countering, with Tales of Graces, a 2009 entry praised for its combat, cited as inspiration. Unlike many of the previous titles in the series, the game doesn't feature multiplayer, with the development team deciding to focus on various interactions between characters in combat, including the addition of the \"Boost Strike\" feature, allowing multiple party members to perform destructive attacks together under certain conditions\r\n\r\n**Nominees are:**\r\n\r\n- Cyberpunk 2077\r\n\r\n- Monster Hunter Rise\r\n\r\n- Scarlet Nexus\r\n\r\n- Shin Megami Tensei V\r\n\r\n- Tales of Arise\r\n\r\n## Best Fighting\r\n\r\n### WINNER: Guilty Gear: Strive\r\n\r\n![image](https://cdn.akamai.steamstatic.com/steam/apps/1384160/capsule_616x353.jpg)\r\n\r\nIntended as a \"complete reconstruction of the franchise\", Guilty Gear Strive retains the core essence of the series but revamps many features and mechanics, except for the removal of the series’ signature mechanic, the Instant Kill. It introduces the \"Wall Break\" feature, which allows for stage transitions when a combo is initiated in the corner of the arena.\r\n\r\n**Nominees are:**\r\n\r\n- Demon Slayer: Kimetsu no Yaiba – The Hinokami Chronicles\r\n\r\n- Guilty Gear: Strive\r\n\r\n- Melty Blood: Type Lumina\r\n\r\n- Nickelodeon All-Star Brawl\r\n\r\n- Virtua Fighter 5: Ultimate Showdown\r\n\r\n## Best Family\r\n\r\n### WINNER: It Takes Two\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/HXDLVhmdqPzGJMtfysBjti.png)\r\n\r\n**Nominees are:**\r\n\r\n- It Takes Two\r\n\r\n- Mario Party Superstars\r\n\r\n- New Pokémon Snap\r\n\r\n- Super Mario 3D World + Bowser’s Fury\r\n\r\n- WarioWare: Get It Together!\r\n\r\n## Best Multiplayer\r\n\r\n### WINNER: It Takes Two\r\n\r\n![image](https://cdn.vox-cdn.com/thumbor/e7CjCG5gmFXnpbchq2xqUB2OdRY=/0x0:3819x1599/1200x675/filters:focal(1605x495:2215x1105)/cdn.vox-cdn.com/uploads/chorus_image/image/69017949/two.0.png)\r\n\r\n**Nominees are:**\r\n\r\n- Back 4 Blood\r\n\r\n- It Takes Two\r\n\r\n- Knockout City\r\n\r\n- Monster Hunter Rise\r\n\r\n- New World\r\n\r\nValheim\r\n \r\n## Most Anticipated\r\n\r\n### WINNER: Elden Ring\r\n\r\n![image](https://cdn.vox-cdn.com/thumbor/1A4-XjfBdFlaazdEv-74Nr4Hcnc=/0x0:1920x1280/1400x933/filters:focal(807x487:1113x793):no_upscale()/cdn.vox-cdn.com/uploads/chorus_image/image/70124039/elden_ring_1.0.jpg)\r\n\r\nElden Ring is an action role-playing game played in a third-person perspective and features elements similar to those found in its predecessors, the Souls series as well as Bloodborne and Sekiro: Shadows Die Twice, with gameplay focusing on combat and exploration. Director Hidetaka Miyazaki explained that players start with a linear opening but will eventually progress to freely explore the Lands Between, including its six main areas, as well as castles, fortresses, and catacombs scattered throughout the vast open-world map. These main areas are interconnected through a central hub that players can access later in the game's progression—similar to Firelink Shrine from Dark Souls—and will be explorable using the character's mount as the main mode of transport, although a fast travel system will be an available option. Throughout the game, players will encounter non-player characters (NPCs) and enemies alike, including the demigods who rule each main area and will serve as the game's main bosses\r\n\r\n**Nominees are:**\r\n\r\n- God of War Ragnarok\r\n\r\n- Elden Ring\r\n\r\n- Horizon Forbidden West\r\n\r\n- Sequel to The Legend of Zelda: Breath of the Wild\r\n\r\n- Starfield\r\n\r\n \r\n## Innovation in Accessibility\r\n\r\n### WINNER: Forza Horizon 5\r\n\r\n![image](https://assets.gamepur.com/wp-content/uploads/2021/06/13134935/Forza-Horizon-5-Official-Release-Date-Trailer-4K-_-E3-2021-00-01-44-.jpg)\r\n\r\n**Nominees are:**\r\n\r\n- Far Cry 6\r\n\r\n- Forza Horizon 5\r\n\r\n- Marvel’s Guardians of the Galaxy\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n- The Vale: Shadow of the Crown\r\n \r\n## Best Esports Game\r\n\r\n### WINNER: League of Legends\r\n\r\n![image](https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_obituary/public/d8/images/methode/2020/10/29/9ae7fa98-1902-11eb-8f67-a484f6db61a1_image_hires_022408.jpeg?itok=E90OZb1k&v=1603909455)\r\n\r\nSummoner's Rift is the flagship game mode of League of Legends and the most prominent in professional-level play. The mode has a ranked competitive ladder; a matchmaking system determines a player's skill level and generates a starting rank from which they can climb. There are nine tiers; the least skilled are Iron, Bronze, and Silver, and the highest are Master, Grandmaster, and Challenger\r\n\r\n**Nominees are:**\r\n\r\n- Call of Duty: Warzone\r\n\r\n- Counter-Strike: Global Offensive\r\n\r\n- DOTA2\r\n\r\n- League of Legends\r\n\r\n- Valorant"
	},
	{
		"_id": "6203bd57b0d50e4d201d5ef2",
		"title": "DUPLICATE CES 2022: what will we see at the world’s largest electronics expo in January?",
		"abstract": "CES 2022 will return to Las Vegas – but will it be worth attending in-person?",
		"imageCover": "ces-logo.jpg",
		"tags": ["computer", "technology", "science", "events"],
		"category": "events",
		"typeFace": "feature",
		"author": "61ed7e4a3c05a74b3559bb4a",
		"markdown": "Watching CES online last year was certainly an experience – but we’re happy to see it return to its regular old in-person format for 2022. \r\n\r\nWhen it kicks off in January, CES 2022 will bring us a bevy of new devices from all the major players in the industry. We’ll see some cutting-edge TV technology from the likes of LG, Samsung and Sony, plus new laptops, smartphones, wearables and headphones, too. \r\n\r\nThat said, we’re expecting a slightly more subdued show than in years past due to the ongoing Covid-19 pandemic and its impact on international travel – but as of right now, the CTA says that most of the main players will be returning to their usual spots on the Las Vegas Convention Center show floor. It sounds like it will be slightly smaller than in years past, but with all of the same tech-y goodness that you’d expect from a CES.\r\n\r\n## CES 2022: Date and Timings\r\n\r\n![image](https://miro.medium.com/max/1000/1*MgdcQrN0nQa5DF2VqmVV4Q.jpeg)\r\n\r\nOfficially, CES 2022 runs from Wednesday, January 5 through Saturday, January 8, 2022. That’s when the show floor will be open, and you’ll be able to walk around to check out the different booths - as long as you have official documentation that you’ve been vaccinated.\r\n\r\nLike previous conferences, however, there are two days of press conferences that happen before the show floor opens that take place on Monday, January 3 and Tuesday, January 4. That includes CES Unveiled that takes place from 5 - 8 pm PST on Monday, January 3 and the big press events from LG, Samsung and Sony that happen on Tuesday at 8 am PST and run through the entire day.\r\n\r\nWhen most folks get there on Wednesday, the CES show floor will be open from 10 am PST until 6 pm PST then from 9 am to 6pm PST from Thursday to Friday. CES 2022 will officially wrap up at 4 pm PST on Saturday, January 8. \r\n\r\nSo what are we going to see there?\r\n\r\n## Samsung at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/XgiCMPpcmAXxJaPjkK8DLc-970-80.jpg.webp)\r\n\r\nFrom TVs to phones to appliances you’ll be able to buy next year, as well as chef bots and ball robot concepts that may never reach the market, Samsung always has a lot to show at CES, and we anticipate a similar range of products shown off at CES 2022. \r\n\r\nWe expect Samsung to show off a number of new 4K and 8K Neo QLED TVs, following up last year’s excellent Samsung QN90A and QN900A models. As far as phones go, we anticipate seeing some of its more recent mid-range phones as well as the long-delayed Samsung Galaxy S21 FE, and maybe even a hint of the upcoming Samsung Galaxy S22 flagship range.\r\n\r\n## Sony at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/3b1e077c48920e8f8fee4a0c4c3f3de6-970-80.jpg.webp)\r\n\r\nSony is always tough to nail down when it comes to CES plans. Some years they show up with a concept car. Other times they show up with an animatronic dog. You never really know what Sony will have in any given year. \r\n\r\nThat being said, we do have a few hunches of what we’re going to see there. From Sony’s audio department, we’re likely to see a new lineup of digital media players (i.e. Walkmans) as well as a pair of premium headphones or two. We’ll see some wireless speakers and, from the TV side, at least three to four new 4K and 8K screens to whet our appetites for the 2022 Sony TV lineup. \r\n\r\nSony usually doesn’t show off much from its camera business at CES but expect to at least hear how the company’s music and movie arms are doing. Will we see the PlayStation VR 2 there? Probably not, but we’ll certainly keep our eyes peeled just in case Sony surprises us.\r\n\r\n## TCL at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/2cEj53dGM34jiECtLEfuug-970-80.jpg.webp)\r\n\r\nTCL has embraced CES as a launchpad for its new products coming out in the year and concepts we might not see for awhile. Though some of those devices slated to come out get quietly delayed (or never release at all), there’s always an interesting range of TVs, phones, flexible-screen devices, and other gadgets from TCL, and we expect CES 2022 to be no different.\r\n\r\nGiven TVs are TCL’s bread and butter, we expect new 6-Series Mini LED TVs following up on last year's fantastic TCL 6-Series 8K. TCL is only a few years into releasing phones under its own name, and we expect a follow-up to the TCL 20 series released last year – perhaps the TCL 30 line. There could also be TCL Tab tablets to see, along with concept devices we can’t begin to predict.\r\n\r\n## Hisense at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/FLtFpvfPCcrk827heqRSzF-970-80.png.webp)\r\n\r\nHisense never gets the same amount of airtime as companies like Sony, Samsung and LG at CES, but it’s still worth a stop at the company’s booth if you’re walking around the Las Vegas Convention Center. What we’re expecting from Hisense this year is another lineup of Google TV-toting smart TVs for the UK as well as some nice new laser TVs for the US. \r\n\r\nIf you’re looking for super futuristic display technology, you’ll find it at Hisense’s booth as well – however, most of it is either conceptual or exclusive to the Chinese market. \r\n\r\n## Intel at CES 2022\r\n\r\n![image](https://static.techspot.com/images2/news/bigimage/2021/08/2021-08-19-image-12-j.webp)\r\n\r\nThe biggest reveal we expect from Intel at CES is the continued release of new Alder Lake CPUs. We’re expecting some of its flagship enthusiast silicon to be released in November, but those will mostly be high-end desktop chip. CES 2022 might see Alder Lake chips making it to the mobile computing segment, where the big.LITTLE architecture should significantly boost laptop energy efficiency.\r\n\r\nIf early indications hold up, the new Alder Lake chips might leave the Apple M1 and M1X processors in the dust along with AMD’s Zen 3 chips.\r\n\r\n## Panasonic at CES 2022\r\n\r\n![image](https://m.thepeninsulaqatar.com/get/maximage/20171010_1507665098-180025.jpg)\r\n\r\nPanasonic usually shows up to CES with two big announcements – one for its new OLED TV and another for its Technics line of vinyl players and headphones. This year, that could certainly change and Panasonic might surprise us with something totally new and different, but this game plan has always served Panasonic well in the past.\r\n\r\nUnfortunately, the rest of Panasonic’s announcement will likely come during IFA 2022 – which isn’t happening until September of next year. \r\nOur predictions for...\r\n\r\n## Phones at CES 2022\r\n\r\n![image](https://i2.wp.com/www.maggt.com/wp-content/uploads/2021/11/samsung-s21-fe-ces-launch.jpg)\r\n\r\nCES isn’t a big stage for phones coming out this year – that’s usually Mobile World Congress (MWC), which happens in February – but several brands choose to debut some new handsets at the first big annual show. These include some flagship devices but mostly mid-range and budget phones, as companies save their heavy hitters for MWC.\r\n\r\nAs previously mentioned in their own sections, we expect Samsung and TCL to have several devices on display, if previous CES shows are anything to go by. That includes pricier Samsung mid-range devices like follow-ups to the Samsung Galaxy A52 and Samsung Galaxy A72, as well as the potential debut of the still-unseen Samsung Galaxy S21 FE. For TCL, we’d expect the first round of devices in the TCL 30 lineup, with others coming later in the year.\r\n\r\nIt’s possible we see other brands show off their traditional phones, as Motorola has done with Moto G phones in years past. But we’re also expecting non-traditional phones, especially flexible-display devices: both the TCL Rollable and LG Rollable were shown off at CES 2021, and though neither has reached the market (RIP LG phones), they’re still showing where phone design could go.\r\n\r\n## Audio at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/vazDB9FLc4i3xaTE5B7yL4-970-80.jpg.webp)\r\n\r\nWe’re spoiled when it comes to audio products at trade shows. Between NAB, The Bristol Hi-Fi Show and CanJam, we have a new event every three months that will show us what’s hot in the world of hi-fi headphones, speakers and soundbars. That said, while we have plenty of opportunities to get our ears on the latest and greatest cans, CES provides the unique opportunity of seeing what comes next – i.e. the experimental stuff.\r\n\r\nIn years past, that’s included Creative’s Super X-Fi technology and Sony 360 Reality Audio and we’re expecting to see more upgrades to both technologies at this year’s event. \r\n\r\nBeyond headphones, expect to see plenty of new Bluetooth speakers and soundbars from LG, Samsung and Sony – plus bookshelves and standing speakers from Klipsch, JBL and more. That’s a fairly murky prediction, honestly, but the world of hi-fi moves fast and products are announced and released faster than most folks can keep up with them.\r\n\r\nTVs at CES 2022\r\n\r\n![image](https://mma.prnewswire.com/media/1685539/SKYWORTH_W82.jpg?p=facebook)\r\n\r\nBigger. Brighter. More pixels. Better contrast. It sounds so simple when you break it down like that, but in reality those are the four traits that every TV maker in the whole world are chasing right now. Bigger screens have always been a trend at CES but these past few years we’ve seen some truly super-sized models reaching upwards of 90 inches. Crossing that barrier will be difficult - and expensive - but it’s only a matter of time until we see affordable 100-inch TVs.\r\nAdvertisement\r\n\r\nIn terms of brightness and contrast, we’ll be looking for new Mini LED TVs to push the envelope on both fronts. We got our first batch of models from LG and Samsung this year in the form of the Samsung QN90A QLED TV and LG QNED99, and both blew us away. \r\n\r\nThere are some interesting rumors floating around about what could come next for display technologies - holographic and transparent TVs anyone? - but we’ll just have to wait until we get to Vegas to find out what the big three have in store for us.\r\n\r\n## Smart Home at CES 2022\r\n\r\n![image](https://d1wa5qhtul915h.cloudfront.net/app/uploads/2021/07/Bike-Europe-CES-2020.jpg)\r\n\r\nTouchless tech was a big thing at CES 2021; from Kohler’s kitchen faucet that can dispense water by simply placing a hand in front of it, to Arlo’s video doorbell that can alert you when someone is standing on your doorstep rather than actually needing to push the doorbell itself. Thanks to the on-going effects from the global pandemic we expect to see a lot more touchless tech at CES 2022. \r\n\r\nThere’s likely to also be the usual crop of smart home devices including home security cameras with better resolutions and smarter AI that can help ensure you’re not plagued by unwanted motions alerts. We also expect to see a plethora of robot vacuums that offer better suction and utilize AI to navigate around your home, carefully avoiding obstacles such as socks that have escaped from the laundry pile and rogue phone charging cables. \r\n\r\n## Wearables at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/XuFbfK4dg9YixtxCsrEPdP-970-80.jpg.webp)\r\n\r\nMost of the big names in fitness tracking (including Garmin and Fitbit) prefer to host their own events for each of their product launches rather than doing a big reveal at CES. That doesn’t mean Fitbit will be entirely absent from CES 2022, though.\r\n\r\nFitbit is now owned by Google, which is working to bring Fitbit apps and celebrations to its own smartwatch operating system, WearOS. CES is traditionally used as a showcase for new Wear OS watches, with companies like Skagen, Suunto, and Withings all showing off their latest Google-powered devices, so the 2022 show could give us our first glimpse of how the Fitbit integration will work on a smartwatch.\r\n\r\nWe could also see some fitness trackers that are a little outside the norm. At CES 2021, UK-based DNABand revealed a watch that uses data derived from a saliva sample to provide customized advice while you’re shopping for groceries. It’s likely that we’ll see something equally unusual at the 2022 show, and we’ll be keeping a close eye on the startups showing off weird and wonderful wearables in the hopes of attracting an investor’s attention.\r\n\r\nOne final possibility is the appearance of ‘fitness tracking as a service’. We’ve seen some interesting developments in this area recently, with Amazon and Fitbit both releasing new devices that keep some insights hidden behind a paywall. At CES 2022, it’s possible that we might get our first glimpse of a fitness tracker that’s free up-front, but requires a rolling monthly subscription if you want to see your health data.\r\n\r\n## CES 2022: how to register\r\n\r\n![image](https://larepublica.pe/resizer/vvGDWnZ22WVd5KPxzoNVqt6XDbU=/1200x660/top/cloudfront-us-east-1.images.arcpublishing.com/gruporepublica/WPYHOGS5YNDHRJULOUXR3N2CDI.jpg)\r\n\r\nRegistration for CES 2022 is available now to the consumer technology industry now at the [CES website.](https://www.ces.tech/Logistics/Register-Now.aspx) In terms of cost, the CTA plans to charge a $300 fee. The fee will apply to most attendees, including retailers, but like in past years, credentialed journalists and analysts will be exempt."
	},
	{
		"_id": "6203bd57b0d50e4d201d5ef1",
		"title": "DUPLICATE Best college laptops for students, from budget laptops to workstations.",
		"abstract": "The complete list of best laptops available for the college students to help their coding.",
		"imageCover": "laptop-cover.jpg",
		"tags": ["computer", "technology", "general"],
		"category": "general",
		"typeFace": "main",
		"author": "61ed7e4a3c05a74b3559bb4d",
		"markdown": "If you're a student, you'll want one of the best college laptops so you can ace your exams then stream TV or play games when it's time to relax. But with so many choices at so many different prices, it can be homework in itself to find the very best laptops for students. \r\n\r\nWhen you're buying a laptop for school, make sure it has long battery life and fast CPU performance. You can find a lot of these units on our main best laptops page, which gives you a wide selection of the top notebooks to choose from. And if you prefer to take notes by hand, buy one of the best 2-in-1 laptops. We've also ranked the best gaming laptops for those who like to unwind after the coursework is wrapped up. We're still in a process of reviewing some laptops that could find their way on this list, so be sure to check back in regularly for the latest and great laptops for students. \r\n\r\n## HP Envy . \r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/X65pzFAjWZpsydiR8L5XoK-970-80.jpg.webp)\r\n\r\nThe best laptop for students is now better than ever. Refreshed with a new design and a Thunderbolt 4 port, the new HP Envy 13 is the best sub-$1,000 laptop for students or anyone who needs a portable machine with loads of power and long battery life (11:15 on the FHD model). \r\n\r\nWith even slimmer bezels and faster performance, the 2021 model shows that it can hang with much pricier flagship models. Combine those features with a sleek chassis, bright and vivid 1080p display and plenty of performance from an 11th Gen Core i5 CPU, and it's easy to see why the Envy 13 is the best college laptop for students. And frankly, given that this is a budget laptop compared to many of the others on this list, the Envy 13 is an awesome choice. If you need a larger display, see our HP Envy 14 review. \r\n\r\n## MacBook Air with M1\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/AUaDk6VmkFriSBiQJHrx4V-970-80.jpg.webp)\r\n\r\nIf you prefer macOS to Windows 10, then go with the Apple MacBook Air. The biggest improvement to this year's model is the new M1 chip, which delivers outstanding performance and excellent battery life, making the new MacBook Air the fastest ultrathin laptop ever.  \r\n\r\nBest of all, the MacBook Air still costs only $999, and yet, you can unrivaled performance along with 14 hours and 41 minutes of battery life. This is a combination you'll only find from the very best Windows 10 laptops, and even they can't compete in head-to-head performance. \r\n\r\nSo why buy the MacBook Air instead of the Pro? While the Pro has better sustained performance, the MacBook Air is cheaper and is pin-drop silent because it doesn't have a fan. And, of course, Apple's least expensive 13.3-inch model is the most portable, coming in at only 0.6 inches thick and 2.8 pounds. \r\n\r\nBut now the MacBook Air is slower to parity with the MacBook Pro than ever before. It has similar speed and battery life, the same 720p webcam, a comfortable Magic keyboard and two USB-C ports. Also, the 13.3-inch, 2560 x 1600-pixel Retina display on the M1 model was improved with P3 color coverage, making it more vibrant than the previous panel. \r\n\r\n## Dell XPS 13 \r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/8dTpBaD5tdkcVwYhFpJvfb-970-80.jpeg.webp)\r\n\r\nThe Dell XPS 13 is a serious workhorse and the best premium laptop for college students. Powered by an 11th Gen Intel Core i7 processor with integrated Intel Iris Xe graphics, the notebook is ready for work or play. And with more than 11 hours of battery life, you've got plenty of time for both. The laptop consistently performed either better or on a par with competing systems.\r\n\r\nBut rest assured, the XPS 13 is just as pretty as it is powerful. The company managed to make a laptop that's smaller and lighter than previous models. Despite the smaller size, Dell added some big changes, including a larger trackpad and keyboard. Plus, you get a 13.4-inch, near-bezelless display on every side –– the first in the world to do so. \r\nAdvertisement\r\n\r\nIt's an exercise in patient restraint, improving the notebook in a bunch of small ways that add up to a big leap for the system. If you're looking for the total package, the Dell XPS 13 is the laptop for you. \r\n\r\n\r\n## HP Envy x360 \r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/rZxKJRZLwQ6RDgWHCJnRTM-970-80.jpg.webp)\r\n\r\nThe HP Envy x360 13 is the best laptop for under $1,000 and one of the best Ultrabooks on the market. While it doesn't come with a stylus (neither does the Surface Pro), the Envy is a 2-in-1, which lets you flip it into tent or tablet mode. What makes this such a fantastic value is its entirely aluminum design and Herculian AMD Ryzen processors. \r\n\r\nIn our testing, we found that an Envy x360 13 with a Ryzen 5 4500U CPU can outperform laptops with 10th Gen Intel chips. This specific Envy costs just $800 and can outmuscle laptops that cost well over $1,000, including the exorbitant MacBook Pro. Moreover, the Envy x360 13 has a bright, vivid 13.3-inch display and a comfortable keyboard. \r\n\r\nThere is very little we don't like about the Envy x360. If you can get over the lack of a Thunderbolt 3 port and IR camera, then it is the ultimate money-saving laptop. If you prefer a larger display, see our HP Envy x360 15 review. \r\n\r\n\r\n## Apple MacBook Pro \r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/GhzFxPPWGGom7wLjUjQYDA-970-80.jpg.webp)\r\n\r\nThis is the huge leap forward we've been waiting on. It is all thanks to the new M1 chip, Apple's first-ever custom SoC for laptops. With the best power-per-watt performance of any processor, the M1 brings the MacBook Pro's performance and battery life to the next level.\r\n\r\nMore specifically, the MacBook Pro is more powerful than nearly every PC on the market, including some workstations. And despite cramming so much power into such a slim and sleek chassis, the Pro lasted for an outstanding 16 hours and 32 minutes on our battery test, which simulates real-world testing.\r\n\r\nWith an image processing unit, the webcam (sadly, still 720p) is better than before and since it runs on Apple's ARM-based architecture, iPad and iPhone apps are now available on Mac. Yep, you can run all your favorite iOS games and apps on your laptop now. \r\n\r\nRounding out the numerous enhancements found in the latest MacBook Pro is Big Sur, the latest version of macOS. The largest update since OS X launched a decade ago, Big Sur is a beautiful redesign of the desktop OS.  \r\n\r\n## HP Spectre x360 14\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/qBfGdkRvjJszWvRJGJfdhS-970-80.jpg.webp)\r\n\r\nThe Spectre x360 14 is the best 2-in-1 laptop ever. Newly released for 2021, the 13.5-inch model builds upon its predecessors but adds useful new features including a 3:2 aspect ratio display and 11th Gen Intel CPUs with Iris Xe graphics. Highlights of this laptop include a stunning design, bright and vivid 1920 x 1280-pixel IPS and 3K2K OLED display options, epic 12+ hour battery life and fast overall performance. \r\n\r\nAdd to that a generously sized touchpad that is silky to the touch as well as a comfortable (albeit shallow) keyboard, excellent security options (fingerprint sensor and facial recognition) and a good selection of ports, and well, it's easy to see why we like this laptop so much. \r\n\r\nWe recommend buying the Spectre x360 14 over the Envy 13 if you have the money, especially if you need the flexible design. In fact, the Spectre x360 14 is the best laptop if you want a convertible notebook, period. Sure, it has a few faults, but those are easily forgotten once you get this beauty in your hands. \r\n\r\n## Acer Swift 3 (2020, AMD Ryzen)\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/ZwJ97S9pSrMho8diQwGUp6-970-80.jpg.webp)\r\n\r\nIf you want blistering performance at a budget price, look no further than the Acer Swift 3 with AMD Ryzen CPUs. This $649 laptop can outperform the Dell XPS 13 and even make a run at the MacBook Pro. It's really all about the Ryzen 7 4700U CPU inside, which trounces its Intel opposites in raw performance.\r\n\r\nWe also like the Swift 3's clicky keyboard, which was comfortable to type on thanks to the springy feedback. You also get a fingerprint reader on the deck for quick login and the chassis is made of aluminum and magnesium, not plastic. Our biggest beef with the Swift 3 is the dim and dull display. If that isn't a concern for you, the Swift 3 is an excellent choice at a reasonable price.\r\n\r\n## Lenovo ThinkPad X1 Carbon (Gen 9)\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/BqTQ8aW42Gur7FfwNBayeZ-970-80.jpg.webp)\r\n\r\nLenovo made several welcome changes to the 9th Gen edition of its flagship business laptop. Along with fast performance from 11th Gen Intel CPUs, you get longer battery life (15 hours!), powerful quad speakers, a new 14-inch display with a 16:10 aspect ratio, and plenty of ports, all in an impossibly lightweight chassis (2.5 pounds). \r\n\r\nBut it's still those classic ThinkPad features —  a durable design (with MIL-STD-810G strength), best-in-class keyboard and stealthy black/red aesthetics — that carry the X1 Carbon to greatness.\r\n\r\nYes, we wish the ThinkPad X1 Carbon had a better webcam and hadn't ditched the SD card reader in the previous. Also, top configurations can get very expensive; still, you'd be hard-pressed to find a better business laptop for students going to college. If you want a 2-in-1 laptop with business features, consider the ThinkPad X1 Yoga (Gen 6).\r\n\r\n## Google Pixelbook Go\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/joGUDW4Gb6K49nGB4YHDcH-970-80.jpg.webp)\r\n\r\nThe Google Pixelbook Go is a fantastic laptop for students because you get the same sleek elegance as the Pixelbook but at a much lower cost. Starting at $649, the Pixelbook Go is among the cheapest laptops on this list, yet it delivers a lightweight chassis, fast performance and epic battery life. \r\nAdvertisement\r\n\r\nMore classrooms are shifting to Chromebooks, so the Pixelbook Go should feel familiar to students. It's an easy-to-use, lightweight operating system centered around the Chrome browser. What makes the Pixelbook Go such a good option is that it's durable and powerful enough to survive for several years, so buy it for your freshman child and it should last him through high school graduation and into college.\r\n\r\n## Lenovo Legion 5 Pro\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/zrRpB2DYw3MqQEPXwFtBSN-970-80.jpg.webp)\r\n\r\nLenovo's Legion 5 Pro proves what's possible when two opposing forces come together for the greater good. Those forces are AMD and Nvidia, and the greater good is the gaming community. Armed with an AMD Ryzen 7 5800 CPU and Nvidia GeForce RTX 3070 graphics, the Legion 5 Pro gives gamers the power they need to run the latest AAA titles at Ultra graphics settings. \r\n\r\nWhat it lacks in flashy aesthetics, it makes up for with a gorgeous 16-inch QHD display, an exceptional keyboard and touchpad, plenty of ports, and outstanding performance from the one-two punch of an AMD CPU and Nvidia GPU. And despite harnessing so much power, the Legion 5 Pro delivers respectable battery life. \r\n\r\nThanks for reading this far!"
	},
	{
		"_id": "6203bd57b0d50e4d201d5efa",
		"title": "DUPLICATE AMD could have a secret weapon to make gaming laptops better",
		"abstract": "RX 6000S mobile graphics cards might make their presence felt soon",
		"imageCover": "amd-cover.jpg",
		"tags": ["computer", "technology", "gaming"],
		"category": "technology",
		"typeFace": "main",
		"author": "61ed7e4a3c05a74b3559bb4d",
		"markdown": "AMD could be about to introduce new graphics cards for laptops, at least going by the rumor mill which predicts revamped RDNA 2 GPUs are waiting in the wings. The possible refresh of RX 6000 mobile GPUs might be based on TSMC’s 6nm process, and could be named as the RX 6000S series. VideoCardz cites hardware leaker Disclosuzen on Twitter as the source for details on these purported new graphics solutions (though note that as PC Gamer, which spotted this, observes, the leaker’s Twitter account has been suspended).\r\n\r\n![image](https://www.amd.com/system/files/2021-03/749511-amd-radeon-6000-series-4-gpus-1290x709_0.png)\r\n\r\nBacking this up, another well-known hardware leaker on Twitter, Greymon55, has previously theorized (a few months back) that AMD has a 6nm-based refresh of the 6000 mobile series inbound, though they believed it would be kick off with the RX 6900M, whereas this fresh leak claims it’ll be the RX 6800S.\r\n\r\nThe charge could be led by that RX 6800S, and apparently there may be other revamped laptop GPUs in line with that, as you might expect; but not the whole range. Greymon55 has previously guessed that we could see up to four models in the new ‘S’ series. Heavy salt with all this, it goes without saying.\r\n\r\nAs for rumored specs, apparently the RX 6800S will keep the same core count (2,560) and bus as the existing 6800M, but due to dropping to 6nm (from 7nm with the existing GPU), the 6800S should be capable of higher clock speeds for better performance.\r\n\r\n![image](https://i.itworldcanada.com/wp-content/uploads/2020/10/amd-radeon-rx-6000-feature.jpg)\r\n\r\nThe RX 6800S (the ‘S’ stands for Super, right?) could obviously be a useful boost for AMD’s laptop GPU line-up, and on 6nm rather than 7nm, as we observed above, it could potentially ramp up clocks nicely; and the other big plus would be improved power-efficiency, too. Of course, when it comes to laptop hardware which is packed into a tight chassis – where heat and the space for adequate cooling solutions becomes a trickier balancing act – more efficiency is a major boon.\r\n\r\nThat said, there’s little info on the potential spec yet, so we shouldn’t build up any expectations on the performance front. We’ve also heard arguments pushing the idea that 6nm may not offer much in terms of extra oomph or efficiency (but even if any performance gains were minimal, dropping to 6nm would still improve availability of GPUs – always an issue these days – simply because there’ll be more chips from a single wafer).\r\n\r\nWe’ll just have to see how things pan out, but if these new laptop graphics cards are indeed real, we’ll likely witness more spillage on them soon enough. Meanwhile, Nvidia is rumored to have new RTX 3000 Ti GPUs for laptops ready to launch at CES 2022, just around the corner at the start of January, with an RTX 3070 Ti mobile version recently being spotted in leaked product details of an Acer laptop."
	}, {
		"_id": "6203bd57b0d50e4d201d5efb",
		"title": "DUPLICATE-2 Can’t wait for Intel Arc Alchemist GPUs? We may have some bad news...",
		"abstract": " Slight doubts aired over Intel’s Q1 release timeframe via the rumor mill",
		"imageCover": "intel-arc.jpeg",
		"tags": ["technology", "computer"],
		"category": "technology",
		"typeFace": "main",
		"author": "61ed7e4a3c05a74b3559bb4a",
		"markdown": "Intel’s Arc Alchemist graphics chips have been shown in a video, complete with fresh rumors about the possible launch schedule. This comes from YouTuber Moore’s Law is Dead (MLID), a common source of Intel and AMD leaks, who shared some images in a video (spotted by VideoCardz), with the pics showing what appears to be two different graphics chips, high-end with up to 512 EUs (or Execution Units) and low-end with up to 128 EUs. MLID further speculates on Intel’s launch timeframes for next year, although this is on even shakier territory, and apparently even the chip giant itself has had difficulty pinning down a release schedule, with dates being moved multiple times according to sources.\r\n\r\n![images](https://i.cdn.newsbytesapp.com/images/l24420210817174233.jpeg)\r\n\r\nThe theory as it stands, though, is that while Intel appears confident of a Q1 2022 launch, MLID is still a little doubtful  that we’ll see products out there and available to buy in the first quarter. MLID further asserts that we could see the low-end Alchemist GPU (128 EUs) launch in the form of desktop graphics cards first, rather than mobile (the latter being first out the gate was what the rumor mill previously contended – and of course, that could still happen). These will likely emerge in April, or perhaps late March, meaning Q1 could still be a possibility (just about), to be followed by the high-end GPUs (512 EUs) likely later in April – assuming the drivers are ready.\r\n\r\n![image](https://static.techspot.com/images2/news/bigimage/2021/08/2021-08-24-image-26.jpg)\r\n\r\nThere are a lot of ifs and buts here, and indeed another point mentioned by MLID is that Intel’s flagship desktop reference boards may not be ready until mid-Q2, and there’s a possibility that third-party graphics cards could be out before the actual reference product. Or Intel might just let card makers do a paper launch, and hold up until a simultaneous release with reference boards is possible.\r\n\r\nIt seems possible, then, that we may see a reversal of the situation that was previously rumored whereby Intel would release laptop Alchemist GPUs first, then desktop cards. Desktop GPUs may come first, perhaps, but may not arrive until April, which is slightly disappointing. Then again, MLID also floats the possibility that low-end laptop cards might come first. The picture is unclear, with Intel apparently switching around the intended release schedule with some regularity.\r\n\r\n![image](https://www.notebookcheck.com/fileadmin/Notebooks/News/_nc3/Intel_ARC_Alchemist_Reference_Graphics_Card_Final_Design_Renders__8_2060x1299.png)\r\n\r\nIt sounds like nothing is set in stone, really, and that this has led MLID to doubt whether Intel might have anything but a paper launch in Q1 (and perhaps a tiny amount of product). A lot may depend on the state of play with the graphics driver, too, and while MLID makes it clear that he isn’t worried about the quality of Intel’s work on the driver long-term, Team Blue might struggle to get it fully in shape and optimized (particularly for the high-end GPU) to hit late March or early April. All of which isn’t what we really want to hear – we’d like leaks to be pointing to something definitely happening in Q1, of course, but it seems like there could be a possibility of things slipping.\r\n\r\nAll that said, Intel seems to have been pretty confident talking about a Q1 release, and again confirmed this timeframe in a video showing various games being run by an Alchemist GPU aired last week.\r\n\r\nWhat’s also interesting to hear from MLID is that Intel is set to really push at the budget end of the graphics card market, which will be music to the ears of those hunting for a wallet-friendly GPU, and having real problems finding viable candidates right now. There are fresh budget options purportedly in the pipeline from both AMD and Nvidia in the near future, of course, but it sounds like Intel is shaping up to make an impressive assault on the low-end GPU sector for laptops and desktops alike. Exciting times ahead…"
	},
	{
		"_id": "6203bd57b0d50e4d201d5efc",
		"title": "DUPLICATE-2 Game Awards 2021: Here’s the full list of winners",
		"abstract": "It Take Two wins the Game of the Year, and ties with Forza Horizon 5 for lifting 3 trophies",
		"imageCover": "game-awards.jpg",
		"tags": ["gaming", "entertainment"],
		"category": "gaming",
		"typeFace": "main",
		"author": "61ed7e4a3c05a74b3559bb4a",
		"markdown": "Hosted by Geoff Keighley, The Game Awards 2021 stunned the internet with the biggest reveals and honouring the most well-received titles this year. Arkane Studios’ Deathloop, despite earning nine spots on the nomination list, barely scratched the surface with 2 victories.\r\n\r\nOn the other hand, Hazelight studio’s co-op game, It Takes Two, which bagged five spots on the list, won 3 awards, including the prestigious Game of the Year trophy. This comes as a big relief for director Joseph Fares, who recently received a trademark claim from GTA parent company, Take-Two over similar-sounding names. Following the disastrous launch of the Marvel’s Avengers game, even Square Enix earned a redemption arc when Guardians of the Galaxy lifted the trophy for best narrative.\r\n\r\nIn the Player’s Choice category, Halo Infinite came victorious, despite only having released 2 nights ago. Keanu Reeves made an appearance this year as well, alongside co-star Carrie-Ann Moss to promote their film and the new Unreal Engine 5 tech demo – The Matrix Awakens. Players can download the game for free on their PS5 or Xbox Series X|S consoles and play a few missions based on iconic moments from the franchise.\r\n\r\nWith all that out of the way, here’s a complete list of winners from The Game Awards 2021.\r\n\r\n## Game of the Year\r\n\r\n### WINNER: It Takes Two (Hazelight Studios/EA)\r\n\r\n![image](https://static.digit.in/default/6f18903bae0b3317168eaacb4f93c1a3d915110b.jpeg)\r\n\r\nIt Takes Two is an action-adventure video game with elements from platform games. It is specifically designed for split-screen cooperative multiplayer, which means that it must be played with another player through either local or online play. The game features a large number of game mechanics from various video game genres. These gameplay mechanics are connected to the story and the theme of the level. For instance, in one level, Cody gains the ability to rewind time, whereas May can replicate herself. Players have to cooperate with each other and utilize these abilities in order to progress. The game also features a large number of minigames. \r\n\r\n**Nominees are:**\r\n\r\n- Deathloop (Arkane Studios/Bethesda)\r\n\r\n- It Takes Two (Hazelight Studios/EA)\r\n\r\n- Metroid Dread (Mercury Steam/Nintendo)\r\n\r\n- Psychonauts 2 (Double Fine/Xbox Game Studios)\r\n\r\n- Ratchet & Clank: Rift Apart (Insomniac Games/SIE)\r\n\r\n- Resident Evil Village (Capcom)\r\n\r\n## Best Game Direction\r\n\r\n### WINNER: Deathloop\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/NjKmtsWPWi8FxpXxtT6Grk.jpg)\r\n\r\nIn Deathloop, the player takes on the role of Colt, an assassin stuck in a time loop who has been tasked to take out eight targets called Visionaries across the island before midnight, as leaving even one alive will cause the time loop to reset and undo his work. Further, should Colt die before taking out the eight targets, he will wake back up at the start of the loop. The player uses a combination of stealth, parkour, attack skills, guns, gadgets, and powers as in Arkane's previous Dishonored and Prey games to move about the game world. They must avoid or take out guards, learn the patterns of Colt's targets, and to figure out the right order to eliminate said targets using guns, melee attacks, or other environmental means\r\n\r\n**Nominees are:**\r\n\r\n- Deathloop\r\n\r\n- It Takes Two\r\n\r\n- Returnal\r\n\r\n- Psychonauts 2\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n## Best Narrative\r\n\r\n### WINNER: Marvel’s Guardians of the Galaxy\r\n\r\n![image](https://cdn2.unrealengine.com/egs-marvelsguardiansofthegalaxy-eidosmontral-g1a-00-1920x1080-289382e51c76.jpg)\r\n\r\nIn Marvel's Guardians of the Galaxy, the player assumes control of Peter Quill / Star-Lord from a third-person perspective. The player can utilize Star-Lord's elemental guns to defeat enemies, and fly through the air using his jet boots. Other members of the titular team, which include Gamora, Rocket Raccoon, Groot, and Drax the Destroyer, are not directly playable as they are controlled by artificial intelligence, but players can issue commands to them during combat. Each character has their own unique skills and abilities which can be chained together to inflict more damage. As the player fight enemies, a meter will build up and allow players to unleash a special ability known as \"Team Huddle\", which prompts Star-Lord to create a motivational speech and play a song to inspire his teammates. A good speech will grant the other Guardians gameplay benefits, though Star-Lord's abilities will be boosted regardless of the quality of the speech.\r\n\r\nAt various points of the game, the player can make key decisions, via dialogue trees, that will affect the relationships between the Guardians and the outcomes of certain missions. Throughout the game, Star-Lord's decisions will be referenced by his teammates. Despite the branching dialogue paths, the core story remains the same and the game has one ending\r\n\r\n**Nominees are:**\r\n\r\n- Deathloop\r\n\r\n- It Takes Two\r\n\r\n- Life is Strange: True Colors\r\n\r\n- Marvel’s Guardians of the Galaxy\r\n\r\n- Psychonauts 2\r\n\r\n## Best Art Direction\r\n\r\n### WINNER: Deathloop\r\n\r\n![image](https://cdn.vox-cdn.com/thumbor/2kBy8KhanMObawAjxtC3kZr3JUU=/0x0:3840x2160/1200x675/filters:focal(1613x773:2227x1387)/cdn.vox-cdn.com/uploads/chorus_image/image/69310744/Deathloop_Dual_Spikers_8637260997138ea1827.42474129.0.jpg)\r\n\r\n**Nominees are:**\r\n\r\n- Kena: Bridge of Spirits\r\n\r\n- Deathloop\r\n\r\n- Psychonauts 2\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n- The Artful Escape\r\n\r\n## Best Score and Music\r\n\r\n### WINNER: NieR Replicant ver.1.22474487139\r\n\r\n![image](https://imgix.kotaku.com.au/content/uploads/sites/3/2021/04/23/ihueqnelaahslncmwjpp.jpg)\r\n\r\nPlayers take control of a middle-aged man in Nier Gestalt and a teenaged boy in Nier Replicant, named by the player. The player directly controls the main character through a third-person perspective to interact with people, objects, and enemies throughout the game. The player can also turn the camera around the characters, which allows for a 360° view of the surroundings. The three-dimensional world is divided into areas separated by loading screens, and the player can move freely throughout these areas by walking, running, jumping, and climbing ladders. In some rooms and buildings, the camera swings to the side and the main character is restricted to moving as in a two-dimensional platforming environment, while during certain battles the camera pulls up to simulate a top-down shoot 'em up or other video game genres\r\n\r\n**Nominees are:**\r\n\r\n- Cyberpunk 2077\r\n\r\n- Deathloop\r\n\r\n- NieR Replicant ver.1.22474487139\r\n\r\n- Marvel’s Guardians of the Galaxy\r\n\r\n- The Artful Escape\r\n\r\n## Best Audio Design\r\n\r\n### WINNER: Forza Horizon 5\r\n\r\n![image](https://venturebeat.com/wp-content/uploads/2021/11/forzahorizon5-1.jpg)\r\n\r\nForza Horizon 5 is a racing video game set in an open world environment based in a fictional representation of Mexico. The game has the largest map in the entire Forza Horizon series, being 50% larger than Forza Horizon 4 while also having the highest point in the Horizon series. The map was described by creative director Mike Brown as one of the most diverse Forza Horizon maps the team has built. The map contains an active caldera volcano, jungles and beaches, ancient Mayan temples, and towns and cities such as Guanajuato. Players can explore the open world freely, though they can also compete in multiplayer races and complete the campaign mode. Both the cars featured in the game and the player character can be extensively customised.\r\n\r\n**Nominees are:**\r\n\r\n- Deathloop\r\n\r\n- Forza Horizon 5\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n- Resident Evil Village\r\n\r\n- Returnal\r\n\r\n## Best Indie\r\n\r\n### WINNER: Kena: Bridge of Spirits\r\n\r\n![image](https://www.nme.com/wp-content/uploads/2021/09/kena-bridge-of-spirits-1.jpg)\r\n\r\nKena: Bridge of Spirits is an action-adventure game played from a third-person perspective. The player controls Kena, a young spirit guide with magical abilities. In combat, the player uses Kena's staff for light, heavy, and charged attacks. An upgrade transforms the staff into a bow, which can be used to attack enemies, act as a grappling hook, or hit crystals to solve puzzles. When defending against enemies, the player can activate Kena's pulse ability, which acts as a shield and has a health meter that depletes when attacked; it also serves to provide clues and activate objects, and an upgrade allows the player to dash forwards, which can be used to pass through barriers to the Spirit Realm, dodge attacks and stun enemies, and corporealize spirit enemies. Activating the pulse ability before an attack stuns the enemy. The player also gains the ability to use Spirit Bombs, which can be used to float shimmering rocks for platforming or as an attack against enemies\r\n\r\n**Nominees are:**\r\n\r\n- 12 Minutes\r\n\r\n- Death’s Door\r\n\r\n- Kena: Bridge of Spirits\r\n\r\n- Inscryption\r\n\r\n- Loop Hero\r\n\r\n## Best Debut Indie\r\n\r\n### WINNER: Kena: Bridge of Spirits\r\n\r\n![image](https://crazygamer.ca/wp-content/uploads/2021/08/kena-bridge-of-spirits-1620308200917_160w.jpg)\r\n\r\n**Nominees are:**\r\n\r\n- Sable\r\n\r\n- Kena: Bridge of Spirits\r\n\r\n- The Artful Escape\r\n\r\n- The Forgotten City\r\n\r\n- Valheim\r\n\r\n## Best Mobile Game\r\n\r\n### WINNER: Genshin Impact\r\n\r\n![image](https://cdn1.epicgames.com/salesEvent/salesEvent/EGS_GenshinImpact_miHoYoLimited_S1_2560x1440-91c6cd7312cc2647c3ebccca10f30399)\r\n\r\nGenshin Impact is an open-world action role-playing game that allows the player to control one of four interchangeable characters in a party. Switching between characters can be done quickly during combat, allowing the player to use several different combinations of skills and attacks.  Characters may have their strengths enhanced in various ways, such as increasing a character's level and improving artifacts and the weapons that the character equips. In addition to exploration, the player can attempt various challenges for rewards. Scattered across Teyvat are bosses and challenges that reward highly valuable resources, such as Stormterror and the Electro Hypostasis, but claiming them uses up a currency called resin, which slowly regenerates over time. Completing these challenges grants the player progress towards increasing their Adventure Rank, which in turn unlocks new quests, challenges, and raises the World Level. The World Level is a measure of how strong the enemies within the world are and the rarity of rewards that defeating them gives\r\n\r\n**Nominees are:**\r\n\r\n- Fantasian\r\n\r\n- Genshin Impact\r\n\r\n- League of Legends: Wild Rift\r\n\r\n- MARVEL Future Revolution\r\n\r\n- Pokemon Unite\r\n\r\n## Best Action\r\n\r\n### WINNER: Returnal\r\n\r\n![image](https://i.pinimg.com/originals/08/80/f6/0880f6f95229577094ef8be092498639.png)\r\n\r\nReturnal is a third-person shooter video game featuring roguelike elements and covering the psychological horror genre. Set in a futuristic science fiction setting, the player controls Selene (Jane Perry), a space pilot, equipped with a suit and armed with high-tech weapons, who is stranded on the alien planet Atropos, and stuck in a time loop. After every death, Selene is resurrected, following a pattern of traversing across foreign environments and combating extraterrestrial entities with growing visions in an ever changing world\r\n\r\n**Nominees are:**\r\n\r\n- Back 4 Blood\r\n\r\n- Chivalry II\r\n\r\n- Deathloop\r\n\r\n- Far Cry 6\r\n\r\n- Returnal\r\n\r\n## Best Action/Adventure\r\n\r\n### WINNER: Metroid Dread\r\n\r\n![image](https://media.wired.com/photos/615de4bdcb3eb413e3a033ab/master/pass/Games-Metroid-Dread.jpg)\r\n\r\nMetroid Dread is an action-adventure game in which players control bounty hunter Samus Aran as she explores the planet ZDR. It retains the side-scrolling gameplay of previous Metroid games, alongside the free aim and melee attacks added in Samus Returns (2017). As the player explores, they discover new items and weapons, allowing them to access new areas\r\n\r\nDread adds stealth elements, with Samus avoiding the EMMI robots in certain areas by hiding, reducing her noise, and using the Phantom Cloak, camouflage that makes her invisible but slows her movement. If an EMMI catches Samus, the player has two brief chances to perform melee counters and escape. If they fail, Samus is killed. EMMIs can only be destroyed when Samus obtains the temporary \"Omega Blaster\" upgrade, which is lost upon using it to destroy one; however, destroying an EMMI grants Samus a new permanent upgrade. Players unlock images in an in-game gallery based on their completion time, difficulty level, and percentage of items collected\r\n\r\n**Nominees are:**\r\n\r\n- Marvel’s Guardians of the Galaxy\r\n\r\n- Metroid Dread\r\n\r\n- Psychonauts 2\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n- Resident Evil Village\r\n\r\n## Best Role Playing\r\n\r\n### WINNER: Tales of Arise\r\n\r\n![image](https://i.ytimg.com/vi/95h8JiignvA/maxresdefault.jpg)\r\n\r\nLike previous games in the series, Tales of Arise is an action role-playing game, although its gameplay has gone through unspecified alterations as part of its development goals while retaining the basic Tales battle system, dubbed the Linear Motion Battle System. The game has a big focus on evading and countering, with Tales of Graces, a 2009 entry praised for its combat, cited as inspiration. Unlike many of the previous titles in the series, the game doesn't feature multiplayer, with the development team deciding to focus on various interactions between characters in combat, including the addition of the \"Boost Strike\" feature, allowing multiple party members to perform destructive attacks together under certain conditions\r\n\r\n**Nominees are:**\r\n\r\n- Cyberpunk 2077\r\n\r\n- Monster Hunter Rise\r\n\r\n- Scarlet Nexus\r\n\r\n- Shin Megami Tensei V\r\n\r\n- Tales of Arise\r\n\r\n## Best Fighting\r\n\r\n### WINNER: Guilty Gear: Strive\r\n\r\n![image](https://cdn.akamai.steamstatic.com/steam/apps/1384160/capsule_616x353.jpg)\r\n\r\nIntended as a \"complete reconstruction of the franchise\", Guilty Gear Strive retains the core essence of the series but revamps many features and mechanics, except for the removal of the series’ signature mechanic, the Instant Kill. It introduces the \"Wall Break\" feature, which allows for stage transitions when a combo is initiated in the corner of the arena.\r\n\r\n**Nominees are:**\r\n\r\n- Demon Slayer: Kimetsu no Yaiba – The Hinokami Chronicles\r\n\r\n- Guilty Gear: Strive\r\n\r\n- Melty Blood: Type Lumina\r\n\r\n- Nickelodeon All-Star Brawl\r\n\r\n- Virtua Fighter 5: Ultimate Showdown\r\n\r\n## Best Family\r\n\r\n### WINNER: It Takes Two\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/HXDLVhmdqPzGJMtfysBjti.png)\r\n\r\n**Nominees are:**\r\n\r\n- It Takes Two\r\n\r\n- Mario Party Superstars\r\n\r\n- New Pokémon Snap\r\n\r\n- Super Mario 3D World + Bowser’s Fury\r\n\r\n- WarioWare: Get It Together!\r\n\r\n## Best Multiplayer\r\n\r\n### WINNER: It Takes Two\r\n\r\n![image](https://cdn.vox-cdn.com/thumbor/e7CjCG5gmFXnpbchq2xqUB2OdRY=/0x0:3819x1599/1200x675/filters:focal(1605x495:2215x1105)/cdn.vox-cdn.com/uploads/chorus_image/image/69017949/two.0.png)\r\n\r\n**Nominees are:**\r\n\r\n- Back 4 Blood\r\n\r\n- It Takes Two\r\n\r\n- Knockout City\r\n\r\n- Monster Hunter Rise\r\n\r\n- New World\r\n\r\nValheim\r\n \r\n## Most Anticipated\r\n\r\n### WINNER: Elden Ring\r\n\r\n![image](https://cdn.vox-cdn.com/thumbor/1A4-XjfBdFlaazdEv-74Nr4Hcnc=/0x0:1920x1280/1400x933/filters:focal(807x487:1113x793):no_upscale()/cdn.vox-cdn.com/uploads/chorus_image/image/70124039/elden_ring_1.0.jpg)\r\n\r\nElden Ring is an action role-playing game played in a third-person perspective and features elements similar to those found in its predecessors, the Souls series as well as Bloodborne and Sekiro: Shadows Die Twice, with gameplay focusing on combat and exploration. Director Hidetaka Miyazaki explained that players start with a linear opening but will eventually progress to freely explore the Lands Between, including its six main areas, as well as castles, fortresses, and catacombs scattered throughout the vast open-world map. These main areas are interconnected through a central hub that players can access later in the game's progression—similar to Firelink Shrine from Dark Souls—and will be explorable using the character's mount as the main mode of transport, although a fast travel system will be an available option. Throughout the game, players will encounter non-player characters (NPCs) and enemies alike, including the demigods who rule each main area and will serve as the game's main bosses\r\n\r\n**Nominees are:**\r\n\r\n- God of War Ragnarok\r\n\r\n- Elden Ring\r\n\r\n- Horizon Forbidden West\r\n\r\n- Sequel to The Legend of Zelda: Breath of the Wild\r\n\r\n- Starfield\r\n\r\n \r\n## Innovation in Accessibility\r\n\r\n### WINNER: Forza Horizon 5\r\n\r\n![image](https://assets.gamepur.com/wp-content/uploads/2021/06/13134935/Forza-Horizon-5-Official-Release-Date-Trailer-4K-_-E3-2021-00-01-44-.jpg)\r\n\r\n**Nominees are:**\r\n\r\n- Far Cry 6\r\n\r\n- Forza Horizon 5\r\n\r\n- Marvel’s Guardians of the Galaxy\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n- The Vale: Shadow of the Crown\r\n \r\n## Best Esports Game\r\n\r\n### WINNER: League of Legends\r\n\r\n![image](https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_obituary/public/d8/images/methode/2020/10/29/9ae7fa98-1902-11eb-8f67-a484f6db61a1_image_hires_022408.jpeg?itok=E90OZb1k&v=1603909455)\r\n\r\nSummoner's Rift is the flagship game mode of League of Legends and the most prominent in professional-level play. The mode has a ranked competitive ladder; a matchmaking system determines a player's skill level and generates a starting rank from which they can climb. There are nine tiers; the least skilled are Iron, Bronze, and Silver, and the highest are Master, Grandmaster, and Challenger\r\n\r\n**Nominees are:**\r\n\r\n- Call of Duty: Warzone\r\n\r\n- Counter-Strike: Global Offensive\r\n\r\n- DOTA2\r\n\r\n- League of Legends\r\n\r\n- Valorant"
	},
	{
		"_id": "6203bd57b0d50e4d201d5efd",
		"title": "DUPLICATE-2 CES 2022: what will we see at the world’s largest electronics expo in January?",
		"abstract": "CES 2022 will return to Las Vegas – but will it be worth attending in-person?",
		"imageCover": "ces-logo.jpg",
		"tags": ["computer", "technology", "science", "events"],
		"category": "events",
		"typeFace": "main",
		"author": "61ed7e4a3c05a74b3559bb4a",
		"markdown": "Watching CES online last year was certainly an experience – but we’re happy to see it return to its regular old in-person format for 2022. \r\n\r\nWhen it kicks off in January, CES 2022 will bring us a bevy of new devices from all the major players in the industry. We’ll see some cutting-edge TV technology from the likes of LG, Samsung and Sony, plus new laptops, smartphones, wearables and headphones, too. \r\n\r\nThat said, we’re expecting a slightly more subdued show than in years past due to the ongoing Covid-19 pandemic and its impact on international travel – but as of right now, the CTA says that most of the main players will be returning to their usual spots on the Las Vegas Convention Center show floor. It sounds like it will be slightly smaller than in years past, but with all of the same tech-y goodness that you’d expect from a CES.\r\n\r\n## CES 2022: Date and Timings\r\n\r\n![image](https://miro.medium.com/max/1000/1*MgdcQrN0nQa5DF2VqmVV4Q.jpeg)\r\n\r\nOfficially, CES 2022 runs from Wednesday, January 5 through Saturday, January 8, 2022. That’s when the show floor will be open, and you’ll be able to walk around to check out the different booths - as long as you have official documentation that you’ve been vaccinated.\r\n\r\nLike previous conferences, however, there are two days of press conferences that happen before the show floor opens that take place on Monday, January 3 and Tuesday, January 4. That includes CES Unveiled that takes place from 5 - 8 pm PST on Monday, January 3 and the big press events from LG, Samsung and Sony that happen on Tuesday at 8 am PST and run through the entire day.\r\n\r\nWhen most folks get there on Wednesday, the CES show floor will be open from 10 am PST until 6 pm PST then from 9 am to 6pm PST from Thursday to Friday. CES 2022 will officially wrap up at 4 pm PST on Saturday, January 8. \r\n\r\nSo what are we going to see there?\r\n\r\n## Samsung at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/XgiCMPpcmAXxJaPjkK8DLc-970-80.jpg.webp)\r\n\r\nFrom TVs to phones to appliances you’ll be able to buy next year, as well as chef bots and ball robot concepts that may never reach the market, Samsung always has a lot to show at CES, and we anticipate a similar range of products shown off at CES 2022. \r\n\r\nWe expect Samsung to show off a number of new 4K and 8K Neo QLED TVs, following up last year’s excellent Samsung QN90A and QN900A models. As far as phones go, we anticipate seeing some of its more recent mid-range phones as well as the long-delayed Samsung Galaxy S21 FE, and maybe even a hint of the upcoming Samsung Galaxy S22 flagship range.\r\n\r\n## Sony at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/3b1e077c48920e8f8fee4a0c4c3f3de6-970-80.jpg.webp)\r\n\r\nSony is always tough to nail down when it comes to CES plans. Some years they show up with a concept car. Other times they show up with an animatronic dog. You never really know what Sony will have in any given year. \r\n\r\nThat being said, we do have a few hunches of what we’re going to see there. From Sony’s audio department, we’re likely to see a new lineup of digital media players (i.e. Walkmans) as well as a pair of premium headphones or two. We’ll see some wireless speakers and, from the TV side, at least three to four new 4K and 8K screens to whet our appetites for the 2022 Sony TV lineup. \r\n\r\nSony usually doesn’t show off much from its camera business at CES but expect to at least hear how the company’s music and movie arms are doing. Will we see the PlayStation VR 2 there? Probably not, but we’ll certainly keep our eyes peeled just in case Sony surprises us.\r\n\r\n## TCL at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/2cEj53dGM34jiECtLEfuug-970-80.jpg.webp)\r\n\r\nTCL has embraced CES as a launchpad for its new products coming out in the year and concepts we might not see for awhile. Though some of those devices slated to come out get quietly delayed (or never release at all), there’s always an interesting range of TVs, phones, flexible-screen devices, and other gadgets from TCL, and we expect CES 2022 to be no different.\r\n\r\nGiven TVs are TCL’s bread and butter, we expect new 6-Series Mini LED TVs following up on last year's fantastic TCL 6-Series 8K. TCL is only a few years into releasing phones under its own name, and we expect a follow-up to the TCL 20 series released last year – perhaps the TCL 30 line. There could also be TCL Tab tablets to see, along with concept devices we can’t begin to predict.\r\n\r\n## Hisense at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/FLtFpvfPCcrk827heqRSzF-970-80.png.webp)\r\n\r\nHisense never gets the same amount of airtime as companies like Sony, Samsung and LG at CES, but it’s still worth a stop at the company’s booth if you’re walking around the Las Vegas Convention Center. What we’re expecting from Hisense this year is another lineup of Google TV-toting smart TVs for the UK as well as some nice new laser TVs for the US. \r\n\r\nIf you’re looking for super futuristic display technology, you’ll find it at Hisense’s booth as well – however, most of it is either conceptual or exclusive to the Chinese market. \r\n\r\n## Intel at CES 2022\r\n\r\n![image](https://static.techspot.com/images2/news/bigimage/2021/08/2021-08-19-image-12-j.webp)\r\n\r\nThe biggest reveal we expect from Intel at CES is the continued release of new Alder Lake CPUs. We’re expecting some of its flagship enthusiast silicon to be released in November, but those will mostly be high-end desktop chip. CES 2022 might see Alder Lake chips making it to the mobile computing segment, where the big.LITTLE architecture should significantly boost laptop energy efficiency.\r\n\r\nIf early indications hold up, the new Alder Lake chips might leave the Apple M1 and M1X processors in the dust along with AMD’s Zen 3 chips.\r\n\r\n## Panasonic at CES 2022\r\n\r\n![image](https://m.thepeninsulaqatar.com/get/maximage/20171010_1507665098-180025.jpg)\r\n\r\nPanasonic usually shows up to CES with two big announcements – one for its new OLED TV and another for its Technics line of vinyl players and headphones. This year, that could certainly change and Panasonic might surprise us with something totally new and different, but this game plan has always served Panasonic well in the past.\r\n\r\nUnfortunately, the rest of Panasonic’s announcement will likely come during IFA 2022 – which isn’t happening until September of next year. \r\nOur predictions for...\r\n\r\n## Phones at CES 2022\r\n\r\n![image](https://i2.wp.com/www.maggt.com/wp-content/uploads/2021/11/samsung-s21-fe-ces-launch.jpg)\r\n\r\nCES isn’t a big stage for phones coming out this year – that’s usually Mobile World Congress (MWC), which happens in February – but several brands choose to debut some new handsets at the first big annual show. These include some flagship devices but mostly mid-range and budget phones, as companies save their heavy hitters for MWC.\r\n\r\nAs previously mentioned in their own sections, we expect Samsung and TCL to have several devices on display, if previous CES shows are anything to go by. That includes pricier Samsung mid-range devices like follow-ups to the Samsung Galaxy A52 and Samsung Galaxy A72, as well as the potential debut of the still-unseen Samsung Galaxy S21 FE. For TCL, we’d expect the first round of devices in the TCL 30 lineup, with others coming later in the year.\r\n\r\nIt’s possible we see other brands show off their traditional phones, as Motorola has done with Moto G phones in years past. But we’re also expecting non-traditional phones, especially flexible-display devices: both the TCL Rollable and LG Rollable were shown off at CES 2021, and though neither has reached the market (RIP LG phones), they’re still showing where phone design could go.\r\n\r\n## Audio at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/vazDB9FLc4i3xaTE5B7yL4-970-80.jpg.webp)\r\n\r\nWe’re spoiled when it comes to audio products at trade shows. Between NAB, The Bristol Hi-Fi Show and CanJam, we have a new event every three months that will show us what’s hot in the world of hi-fi headphones, speakers and soundbars. That said, while we have plenty of opportunities to get our ears on the latest and greatest cans, CES provides the unique opportunity of seeing what comes next – i.e. the experimental stuff.\r\n\r\nIn years past, that’s included Creative’s Super X-Fi technology and Sony 360 Reality Audio and we’re expecting to see more upgrades to both technologies at this year’s event. \r\n\r\nBeyond headphones, expect to see plenty of new Bluetooth speakers and soundbars from LG, Samsung and Sony – plus bookshelves and standing speakers from Klipsch, JBL and more. That’s a fairly murky prediction, honestly, but the world of hi-fi moves fast and products are announced and released faster than most folks can keep up with them.\r\n\r\nTVs at CES 2022\r\n\r\n![image](https://mma.prnewswire.com/media/1685539/SKYWORTH_W82.jpg?p=facebook)\r\n\r\nBigger. Brighter. More pixels. Better contrast. It sounds so simple when you break it down like that, but in reality those are the four traits that every TV maker in the whole world are chasing right now. Bigger screens have always been a trend at CES but these past few years we’ve seen some truly super-sized models reaching upwards of 90 inches. Crossing that barrier will be difficult - and expensive - but it’s only a matter of time until we see affordable 100-inch TVs.\r\nAdvertisement\r\n\r\nIn terms of brightness and contrast, we’ll be looking for new Mini LED TVs to push the envelope on both fronts. We got our first batch of models from LG and Samsung this year in the form of the Samsung QN90A QLED TV and LG QNED99, and both blew us away. \r\n\r\nThere are some interesting rumors floating around about what could come next for display technologies - holographic and transparent TVs anyone? - but we’ll just have to wait until we get to Vegas to find out what the big three have in store for us.\r\n\r\n## Smart Home at CES 2022\r\n\r\n![image](https://d1wa5qhtul915h.cloudfront.net/app/uploads/2021/07/Bike-Europe-CES-2020.jpg)\r\n\r\nTouchless tech was a big thing at CES 2021; from Kohler’s kitchen faucet that can dispense water by simply placing a hand in front of it, to Arlo’s video doorbell that can alert you when someone is standing on your doorstep rather than actually needing to push the doorbell itself. Thanks to the on-going effects from the global pandemic we expect to see a lot more touchless tech at CES 2022. \r\n\r\nThere’s likely to also be the usual crop of smart home devices including home security cameras with better resolutions and smarter AI that can help ensure you’re not plagued by unwanted motions alerts. We also expect to see a plethora of robot vacuums that offer better suction and utilize AI to navigate around your home, carefully avoiding obstacles such as socks that have escaped from the laundry pile and rogue phone charging cables. \r\n\r\n## Wearables at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/XuFbfK4dg9YixtxCsrEPdP-970-80.jpg.webp)\r\n\r\nMost of the big names in fitness tracking (including Garmin and Fitbit) prefer to host their own events for each of their product launches rather than doing a big reveal at CES. That doesn’t mean Fitbit will be entirely absent from CES 2022, though.\r\n\r\nFitbit is now owned by Google, which is working to bring Fitbit apps and celebrations to its own smartwatch operating system, WearOS. CES is traditionally used as a showcase for new Wear OS watches, with companies like Skagen, Suunto, and Withings all showing off their latest Google-powered devices, so the 2022 show could give us our first glimpse of how the Fitbit integration will work on a smartwatch.\r\n\r\nWe could also see some fitness trackers that are a little outside the norm. At CES 2021, UK-based DNABand revealed a watch that uses data derived from a saliva sample to provide customized advice while you’re shopping for groceries. It’s likely that we’ll see something equally unusual at the 2022 show, and we’ll be keeping a close eye on the startups showing off weird and wonderful wearables in the hopes of attracting an investor’s attention.\r\n\r\nOne final possibility is the appearance of ‘fitness tracking as a service’. We’ve seen some interesting developments in this area recently, with Amazon and Fitbit both releasing new devices that keep some insights hidden behind a paywall. At CES 2022, it’s possible that we might get our first glimpse of a fitness tracker that’s free up-front, but requires a rolling monthly subscription if you want to see your health data.\r\n\r\n## CES 2022: how to register\r\n\r\n![image](https://larepublica.pe/resizer/vvGDWnZ22WVd5KPxzoNVqt6XDbU=/1200x660/top/cloudfront-us-east-1.images.arcpublishing.com/gruporepublica/WPYHOGS5YNDHRJULOUXR3N2CDI.jpg)\r\n\r\nRegistration for CES 2022 is available now to the consumer technology industry now at the [CES website.](https://www.ces.tech/Logistics/Register-Now.aspx) In terms of cost, the CTA plans to charge a $300 fee. The fee will apply to most attendees, including retailers, but like in past years, credentialed journalists and analysts will be exempt."
	},
	{
		"_id": "6203bd57b0d50e4d201d5efe",
		"title": "DUPLICATE-2 Best college laptops for students, from budget laptops to workstations.",
		"abstract": "The complete list of best laptops available for the college students to help their coding.",
		"imageCover": "laptop-cover.jpg",
		"tags": ["computer", "technology", "general"],
		"category": "general",
		"typeFace": "main",
		"author": "61ed7e4a3c05a74b3559bb4d",
		"markdown": "If you're a student, you'll want one of the best college laptops so you can ace your exams then stream TV or play games when it's time to relax. But with so many choices at so many different prices, it can be homework in itself to find the very best laptops for students. \r\n\r\nWhen you're buying a laptop for school, make sure it has long battery life and fast CPU performance. You can find a lot of these units on our main best laptops page, which gives you a wide selection of the top notebooks to choose from. And if you prefer to take notes by hand, buy one of the best 2-in-1 laptops. We've also ranked the best gaming laptops for those who like to unwind after the coursework is wrapped up. We're still in a process of reviewing some laptops that could find their way on this list, so be sure to check back in regularly for the latest and great laptops for students. \r\n\r\n## HP Envy . \r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/X65pzFAjWZpsydiR8L5XoK-970-80.jpg.webp)\r\n\r\nThe best laptop for students is now better than ever. Refreshed with a new design and a Thunderbolt 4 port, the new HP Envy 13 is the best sub-$1,000 laptop for students or anyone who needs a portable machine with loads of power and long battery life (11:15 on the FHD model). \r\n\r\nWith even slimmer bezels and faster performance, the 2021 model shows that it can hang with much pricier flagship models. Combine those features with a sleek chassis, bright and vivid 1080p display and plenty of performance from an 11th Gen Core i5 CPU, and it's easy to see why the Envy 13 is the best college laptop for students. And frankly, given that this is a budget laptop compared to many of the others on this list, the Envy 13 is an awesome choice. If you need a larger display, see our HP Envy 14 review. \r\n\r\n## MacBook Air with M1\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/AUaDk6VmkFriSBiQJHrx4V-970-80.jpg.webp)\r\n\r\nIf you prefer macOS to Windows 10, then go with the Apple MacBook Air. The biggest improvement to this year's model is the new M1 chip, which delivers outstanding performance and excellent battery life, making the new MacBook Air the fastest ultrathin laptop ever.  \r\n\r\nBest of all, the MacBook Air still costs only $999, and yet, you can unrivaled performance along with 14 hours and 41 minutes of battery life. This is a combination you'll only find from the very best Windows 10 laptops, and even they can't compete in head-to-head performance. \r\n\r\nSo why buy the MacBook Air instead of the Pro? While the Pro has better sustained performance, the MacBook Air is cheaper and is pin-drop silent because it doesn't have a fan. And, of course, Apple's least expensive 13.3-inch model is the most portable, coming in at only 0.6 inches thick and 2.8 pounds. \r\n\r\nBut now the MacBook Air is slower to parity with the MacBook Pro than ever before. It has similar speed and battery life, the same 720p webcam, a comfortable Magic keyboard and two USB-C ports. Also, the 13.3-inch, 2560 x 1600-pixel Retina display on the M1 model was improved with P3 color coverage, making it more vibrant than the previous panel. \r\n\r\n## Dell XPS 13 \r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/8dTpBaD5tdkcVwYhFpJvfb-970-80.jpeg.webp)\r\n\r\nThe Dell XPS 13 is a serious workhorse and the best premium laptop for college students. Powered by an 11th Gen Intel Core i7 processor with integrated Intel Iris Xe graphics, the notebook is ready for work or play. And with more than 11 hours of battery life, you've got plenty of time for both. The laptop consistently performed either better or on a par with competing systems.\r\n\r\nBut rest assured, the XPS 13 is just as pretty as it is powerful. The company managed to make a laptop that's smaller and lighter than previous models. Despite the smaller size, Dell added some big changes, including a larger trackpad and keyboard. Plus, you get a 13.4-inch, near-bezelless display on every side –– the first in the world to do so. \r\nAdvertisement\r\n\r\nIt's an exercise in patient restraint, improving the notebook in a bunch of small ways that add up to a big leap for the system. If you're looking for the total package, the Dell XPS 13 is the laptop for you. \r\n\r\n\r\n## HP Envy x360 \r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/rZxKJRZLwQ6RDgWHCJnRTM-970-80.jpg.webp)\r\n\r\nThe HP Envy x360 13 is the best laptop for under $1,000 and one of the best Ultrabooks on the market. While it doesn't come with a stylus (neither does the Surface Pro), the Envy is a 2-in-1, which lets you flip it into tent or tablet mode. What makes this such a fantastic value is its entirely aluminum design and Herculian AMD Ryzen processors. \r\n\r\nIn our testing, we found that an Envy x360 13 with a Ryzen 5 4500U CPU can outperform laptops with 10th Gen Intel chips. This specific Envy costs just $800 and can outmuscle laptops that cost well over $1,000, including the exorbitant MacBook Pro. Moreover, the Envy x360 13 has a bright, vivid 13.3-inch display and a comfortable keyboard. \r\n\r\nThere is very little we don't like about the Envy x360. If you can get over the lack of a Thunderbolt 3 port and IR camera, then it is the ultimate money-saving laptop. If you prefer a larger display, see our HP Envy x360 15 review. \r\n\r\n\r\n## Apple MacBook Pro \r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/GhzFxPPWGGom7wLjUjQYDA-970-80.jpg.webp)\r\n\r\nThis is the huge leap forward we've been waiting on. It is all thanks to the new M1 chip, Apple's first-ever custom SoC for laptops. With the best power-per-watt performance of any processor, the M1 brings the MacBook Pro's performance and battery life to the next level.\r\n\r\nMore specifically, the MacBook Pro is more powerful than nearly every PC on the market, including some workstations. And despite cramming so much power into such a slim and sleek chassis, the Pro lasted for an outstanding 16 hours and 32 minutes on our battery test, which simulates real-world testing.\r\n\r\nWith an image processing unit, the webcam (sadly, still 720p) is better than before and since it runs on Apple's ARM-based architecture, iPad and iPhone apps are now available on Mac. Yep, you can run all your favorite iOS games and apps on your laptop now. \r\n\r\nRounding out the numerous enhancements found in the latest MacBook Pro is Big Sur, the latest version of macOS. The largest update since OS X launched a decade ago, Big Sur is a beautiful redesign of the desktop OS.  \r\n\r\n## HP Spectre x360 14\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/qBfGdkRvjJszWvRJGJfdhS-970-80.jpg.webp)\r\n\r\nThe Spectre x360 14 is the best 2-in-1 laptop ever. Newly released for 2021, the 13.5-inch model builds upon its predecessors but adds useful new features including a 3:2 aspect ratio display and 11th Gen Intel CPUs with Iris Xe graphics. Highlights of this laptop include a stunning design, bright and vivid 1920 x 1280-pixel IPS and 3K2K OLED display options, epic 12+ hour battery life and fast overall performance. \r\n\r\nAdd to that a generously sized touchpad that is silky to the touch as well as a comfortable (albeit shallow) keyboard, excellent security options (fingerprint sensor and facial recognition) and a good selection of ports, and well, it's easy to see why we like this laptop so much. \r\n\r\nWe recommend buying the Spectre x360 14 over the Envy 13 if you have the money, especially if you need the flexible design. In fact, the Spectre x360 14 is the best laptop if you want a convertible notebook, period. Sure, it has a few faults, but those are easily forgotten once you get this beauty in your hands. \r\n\r\n## Acer Swift 3 (2020, AMD Ryzen)\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/ZwJ97S9pSrMho8diQwGUp6-970-80.jpg.webp)\r\n\r\nIf you want blistering performance at a budget price, look no further than the Acer Swift 3 with AMD Ryzen CPUs. This $649 laptop can outperform the Dell XPS 13 and even make a run at the MacBook Pro. It's really all about the Ryzen 7 4700U CPU inside, which trounces its Intel opposites in raw performance.\r\n\r\nWe also like the Swift 3's clicky keyboard, which was comfortable to type on thanks to the springy feedback. You also get a fingerprint reader on the deck for quick login and the chassis is made of aluminum and magnesium, not plastic. Our biggest beef with the Swift 3 is the dim and dull display. If that isn't a concern for you, the Swift 3 is an excellent choice at a reasonable price.\r\n\r\n## Lenovo ThinkPad X1 Carbon (Gen 9)\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/BqTQ8aW42Gur7FfwNBayeZ-970-80.jpg.webp)\r\n\r\nLenovo made several welcome changes to the 9th Gen edition of its flagship business laptop. Along with fast performance from 11th Gen Intel CPUs, you get longer battery life (15 hours!), powerful quad speakers, a new 14-inch display with a 16:10 aspect ratio, and plenty of ports, all in an impossibly lightweight chassis (2.5 pounds). \r\n\r\nBut it's still those classic ThinkPad features —  a durable design (with MIL-STD-810G strength), best-in-class keyboard and stealthy black/red aesthetics — that carry the X1 Carbon to greatness.\r\n\r\nYes, we wish the ThinkPad X1 Carbon had a better webcam and hadn't ditched the SD card reader in the previous. Also, top configurations can get very expensive; still, you'd be hard-pressed to find a better business laptop for students going to college. If you want a 2-in-1 laptop with business features, consider the ThinkPad X1 Yoga (Gen 6).\r\n\r\n## Google Pixelbook Go\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/joGUDW4Gb6K49nGB4YHDcH-970-80.jpg.webp)\r\n\r\nThe Google Pixelbook Go is a fantastic laptop for students because you get the same sleek elegance as the Pixelbook but at a much lower cost. Starting at $649, the Pixelbook Go is among the cheapest laptops on this list, yet it delivers a lightweight chassis, fast performance and epic battery life. \r\nAdvertisement\r\n\r\nMore classrooms are shifting to Chromebooks, so the Pixelbook Go should feel familiar to students. It's an easy-to-use, lightweight operating system centered around the Chrome browser. What makes the Pixelbook Go such a good option is that it's durable and powerful enough to survive for several years, so buy it for your freshman child and it should last him through high school graduation and into college.\r\n\r\n## Lenovo Legion 5 Pro\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/zrRpB2DYw3MqQEPXwFtBSN-970-80.jpg.webp)\r\n\r\nLenovo's Legion 5 Pro proves what's possible when two opposing forces come together for the greater good. Those forces are AMD and Nvidia, and the greater good is the gaming community. Armed with an AMD Ryzen 7 5800 CPU and Nvidia GeForce RTX 3070 graphics, the Legion 5 Pro gives gamers the power they need to run the latest AAA titles at Ultra graphics settings. \r\n\r\nWhat it lacks in flashy aesthetics, it makes up for with a gorgeous 16-inch QHD display, an exceptional keyboard and touchpad, plenty of ports, and outstanding performance from the one-two punch of an AMD CPU and Nvidia GPU. And despite harnessing so much power, the Legion 5 Pro delivers respectable battery life. \r\n\r\nThanks for reading this far!"
	},
	{
		"_id": "6203bd57b0d50e4d201d5eff",
		"title": "DUPLICATE-2 AMD could have a secret weapon to make gaming laptops better",
		"abstract": "RX 6000S mobile graphics cards might make their presence felt soon",
		"imageCover": "amd-cover.jpg",
		"tags": ["computer", "technology", "gaming"],
		"category": "technology",
		"typeFace": "main",
		"author": "61ed7e4a3c05a74b3559bb4d",
		"markdown": "AMD could be about to introduce new graphics cards for laptops, at least going by the rumor mill which predicts revamped RDNA 2 GPUs are waiting in the wings. The possible refresh of RX 6000 mobile GPUs might be based on TSMC’s 6nm process, and could be named as the RX 6000S series. VideoCardz cites hardware leaker Disclosuzen on Twitter as the source for details on these purported new graphics solutions (though note that as PC Gamer, which spotted this, observes, the leaker’s Twitter account has been suspended).\r\n\r\n![image](https://www.amd.com/system/files/2021-03/749511-amd-radeon-6000-series-4-gpus-1290x709_0.png)\r\n\r\nBacking this up, another well-known hardware leaker on Twitter, Greymon55, has previously theorized (a few months back) that AMD has a 6nm-based refresh of the 6000 mobile series inbound, though they believed it would be kick off with the RX 6900M, whereas this fresh leak claims it’ll be the RX 6800S.\r\n\r\nThe charge could be led by that RX 6800S, and apparently there may be other revamped laptop GPUs in line with that, as you might expect; but not the whole range. Greymon55 has previously guessed that we could see up to four models in the new ‘S’ series. Heavy salt with all this, it goes without saying.\r\n\r\nAs for rumored specs, apparently the RX 6800S will keep the same core count (2,560) and bus as the existing 6800M, but due to dropping to 6nm (from 7nm with the existing GPU), the 6800S should be capable of higher clock speeds for better performance.\r\n\r\n![image](https://i.itworldcanada.com/wp-content/uploads/2020/10/amd-radeon-rx-6000-feature.jpg)\r\n\r\nThe RX 6800S (the ‘S’ stands for Super, right?) could obviously be a useful boost for AMD’s laptop GPU line-up, and on 6nm rather than 7nm, as we observed above, it could potentially ramp up clocks nicely; and the other big plus would be improved power-efficiency, too. Of course, when it comes to laptop hardware which is packed into a tight chassis – where heat and the space for adequate cooling solutions becomes a trickier balancing act – more efficiency is a major boon.\r\n\r\nThat said, there’s little info on the potential spec yet, so we shouldn’t build up any expectations on the performance front. We’ve also heard arguments pushing the idea that 6nm may not offer much in terms of extra oomph or efficiency (but even if any performance gains were minimal, dropping to 6nm would still improve availability of GPUs – always an issue these days – simply because there’ll be more chips from a single wafer).\r\n\r\nWe’ll just have to see how things pan out, but if these new laptop graphics cards are indeed real, we’ll likely witness more spillage on them soon enough. Meanwhile, Nvidia is rumored to have new RTX 3000 Ti GPUs for laptops ready to launch at CES 2022, just around the corner at the start of January, with an RTX 3070 Ti mobile version recently being spotted in leaked product details of an Acer laptop."
	}, {
		"_id": "6203bd57b0d50e4d201d5f01",
		"title": "DUPLICATE-3 Can’t wait for Intel Arc Alchemist GPUs? We may have some bad news...",
		"abstract": " Slight doubts aired over Intel’s Q1 release timeframe via the rumor mill",
		"imageCover": "intel-arc.jpeg",
		"tags": ["technology", "computer"],
		"category": "technology",
		"typeFace": "main",
		"author": "61ed7e4a3c05a74b3559bb4a",
		"markdown": "Intel’s Arc Alchemist graphics chips have been shown in a video, complete with fresh rumors about the possible launch schedule. This comes from YouTuber Moore’s Law is Dead (MLID), a common source of Intel and AMD leaks, who shared some images in a video (spotted by VideoCardz), with the pics showing what appears to be two different graphics chips, high-end with up to 512 EUs (or Execution Units) and low-end with up to 128 EUs. MLID further speculates on Intel’s launch timeframes for next year, although this is on even shakier territory, and apparently even the chip giant itself has had difficulty pinning down a release schedule, with dates being moved multiple times according to sources.\r\n\r\n![images](https://i.cdn.newsbytesapp.com/images/l24420210817174233.jpeg)\r\n\r\nThe theory as it stands, though, is that while Intel appears confident of a Q1 2022 launch, MLID is still a little doubtful  that we’ll see products out there and available to buy in the first quarter. MLID further asserts that we could see the low-end Alchemist GPU (128 EUs) launch in the form of desktop graphics cards first, rather than mobile (the latter being first out the gate was what the rumor mill previously contended – and of course, that could still happen). These will likely emerge in April, or perhaps late March, meaning Q1 could still be a possibility (just about), to be followed by the high-end GPUs (512 EUs) likely later in April – assuming the drivers are ready.\r\n\r\n![image](https://static.techspot.com/images2/news/bigimage/2021/08/2021-08-24-image-26.jpg)\r\n\r\nThere are a lot of ifs and buts here, and indeed another point mentioned by MLID is that Intel’s flagship desktop reference boards may not be ready until mid-Q2, and there’s a possibility that third-party graphics cards could be out before the actual reference product. Or Intel might just let card makers do a paper launch, and hold up until a simultaneous release with reference boards is possible.\r\n\r\nIt seems possible, then, that we may see a reversal of the situation that was previously rumored whereby Intel would release laptop Alchemist GPUs first, then desktop cards. Desktop GPUs may come first, perhaps, but may not arrive until April, which is slightly disappointing. Then again, MLID also floats the possibility that low-end laptop cards might come first. The picture is unclear, with Intel apparently switching around the intended release schedule with some regularity.\r\n\r\n![image](https://www.notebookcheck.com/fileadmin/Notebooks/News/_nc3/Intel_ARC_Alchemist_Reference_Graphics_Card_Final_Design_Renders__8_2060x1299.png)\r\n\r\nIt sounds like nothing is set in stone, really, and that this has led MLID to doubt whether Intel might have anything but a paper launch in Q1 (and perhaps a tiny amount of product). A lot may depend on the state of play with the graphics driver, too, and while MLID makes it clear that he isn’t worried about the quality of Intel’s work on the driver long-term, Team Blue might struggle to get it fully in shape and optimized (particularly for the high-end GPU) to hit late March or early April. All of which isn’t what we really want to hear – we’d like leaks to be pointing to something definitely happening in Q1, of course, but it seems like there could be a possibility of things slipping.\r\n\r\nAll that said, Intel seems to have been pretty confident talking about a Q1 release, and again confirmed this timeframe in a video showing various games being run by an Alchemist GPU aired last week.\r\n\r\nWhat’s also interesting to hear from MLID is that Intel is set to really push at the budget end of the graphics card market, which will be music to the ears of those hunting for a wallet-friendly GPU, and having real problems finding viable candidates right now. There are fresh budget options purportedly in the pipeline from both AMD and Nvidia in the near future, of course, but it sounds like Intel is shaping up to make an impressive assault on the low-end GPU sector for laptops and desktops alike. Exciting times ahead…"
	},
	{
		"_id": "6203bd57b0d50e4d201d5f02",
		"title": "DUPLICATE-3 Game Awards 2021: Here’s the full list of winners",
		"abstract": "It Take Two wins the Game of the Year, and ties with Forza Horizon 5 for lifting 3 trophies",
		"imageCover": "game-awards.jpg",
		"tags": ["gaming", "entertainment"],
		"category": "gaming",
		"typeFace": "main",
		"author": "61ed7e4a3c05a74b3559bb4a",
		"markdown": "Hosted by Geoff Keighley, The Game Awards 2021 stunned the internet with the biggest reveals and honouring the most well-received titles this year. Arkane Studios’ Deathloop, despite earning nine spots on the nomination list, barely scratched the surface with 2 victories.\r\n\r\nOn the other hand, Hazelight studio’s co-op game, It Takes Two, which bagged five spots on the list, won 3 awards, including the prestigious Game of the Year trophy. This comes as a big relief for director Joseph Fares, who recently received a trademark claim from GTA parent company, Take-Two over similar-sounding names. Following the disastrous launch of the Marvel’s Avengers game, even Square Enix earned a redemption arc when Guardians of the Galaxy lifted the trophy for best narrative.\r\n\r\nIn the Player’s Choice category, Halo Infinite came victorious, despite only having released 2 nights ago. Keanu Reeves made an appearance this year as well, alongside co-star Carrie-Ann Moss to promote their film and the new Unreal Engine 5 tech demo – The Matrix Awakens. Players can download the game for free on their PS5 or Xbox Series X|S consoles and play a few missions based on iconic moments from the franchise.\r\n\r\nWith all that out of the way, here’s a complete list of winners from The Game Awards 2021.\r\n\r\n## Game of the Year\r\n\r\n### WINNER: It Takes Two (Hazelight Studios/EA)\r\n\r\n![image](https://static.digit.in/default/6f18903bae0b3317168eaacb4f93c1a3d915110b.jpeg)\r\n\r\nIt Takes Two is an action-adventure video game with elements from platform games. It is specifically designed for split-screen cooperative multiplayer, which means that it must be played with another player through either local or online play. The game features a large number of game mechanics from various video game genres. These gameplay mechanics are connected to the story and the theme of the level. For instance, in one level, Cody gains the ability to rewind time, whereas May can replicate herself. Players have to cooperate with each other and utilize these abilities in order to progress. The game also features a large number of minigames. \r\n\r\n**Nominees are:**\r\n\r\n- Deathloop (Arkane Studios/Bethesda)\r\n\r\n- It Takes Two (Hazelight Studios/EA)\r\n\r\n- Metroid Dread (Mercury Steam/Nintendo)\r\n\r\n- Psychonauts 2 (Double Fine/Xbox Game Studios)\r\n\r\n- Ratchet & Clank: Rift Apart (Insomniac Games/SIE)\r\n\r\n- Resident Evil Village (Capcom)\r\n\r\n## Best Game Direction\r\n\r\n### WINNER: Deathloop\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/NjKmtsWPWi8FxpXxtT6Grk.jpg)\r\n\r\nIn Deathloop, the player takes on the role of Colt, an assassin stuck in a time loop who has been tasked to take out eight targets called Visionaries across the island before midnight, as leaving even one alive will cause the time loop to reset and undo his work. Further, should Colt die before taking out the eight targets, he will wake back up at the start of the loop. The player uses a combination of stealth, parkour, attack skills, guns, gadgets, and powers as in Arkane's previous Dishonored and Prey games to move about the game world. They must avoid or take out guards, learn the patterns of Colt's targets, and to figure out the right order to eliminate said targets using guns, melee attacks, or other environmental means\r\n\r\n**Nominees are:**\r\n\r\n- Deathloop\r\n\r\n- It Takes Two\r\n\r\n- Returnal\r\n\r\n- Psychonauts 2\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n## Best Narrative\r\n\r\n### WINNER: Marvel’s Guardians of the Galaxy\r\n\r\n![image](https://cdn2.unrealengine.com/egs-marvelsguardiansofthegalaxy-eidosmontral-g1a-00-1920x1080-289382e51c76.jpg)\r\n\r\nIn Marvel's Guardians of the Galaxy, the player assumes control of Peter Quill / Star-Lord from a third-person perspective. The player can utilize Star-Lord's elemental guns to defeat enemies, and fly through the air using his jet boots. Other members of the titular team, which include Gamora, Rocket Raccoon, Groot, and Drax the Destroyer, are not directly playable as they are controlled by artificial intelligence, but players can issue commands to them during combat. Each character has their own unique skills and abilities which can be chained together to inflict more damage. As the player fight enemies, a meter will build up and allow players to unleash a special ability known as \"Team Huddle\", which prompts Star-Lord to create a motivational speech and play a song to inspire his teammates. A good speech will grant the other Guardians gameplay benefits, though Star-Lord's abilities will be boosted regardless of the quality of the speech.\r\n\r\nAt various points of the game, the player can make key decisions, via dialogue trees, that will affect the relationships between the Guardians and the outcomes of certain missions. Throughout the game, Star-Lord's decisions will be referenced by his teammates. Despite the branching dialogue paths, the core story remains the same and the game has one ending\r\n\r\n**Nominees are:**\r\n\r\n- Deathloop\r\n\r\n- It Takes Two\r\n\r\n- Life is Strange: True Colors\r\n\r\n- Marvel’s Guardians of the Galaxy\r\n\r\n- Psychonauts 2\r\n\r\n## Best Art Direction\r\n\r\n### WINNER: Deathloop\r\n\r\n![image](https://cdn.vox-cdn.com/thumbor/2kBy8KhanMObawAjxtC3kZr3JUU=/0x0:3840x2160/1200x675/filters:focal(1613x773:2227x1387)/cdn.vox-cdn.com/uploads/chorus_image/image/69310744/Deathloop_Dual_Spikers_8637260997138ea1827.42474129.0.jpg)\r\n\r\n**Nominees are:**\r\n\r\n- Kena: Bridge of Spirits\r\n\r\n- Deathloop\r\n\r\n- Psychonauts 2\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n- The Artful Escape\r\n\r\n## Best Score and Music\r\n\r\n### WINNER: NieR Replicant ver.1.22474487139\r\n\r\n![image](https://imgix.kotaku.com.au/content/uploads/sites/3/2021/04/23/ihueqnelaahslncmwjpp.jpg)\r\n\r\nPlayers take control of a middle-aged man in Nier Gestalt and a teenaged boy in Nier Replicant, named by the player. The player directly controls the main character through a third-person perspective to interact with people, objects, and enemies throughout the game. The player can also turn the camera around the characters, which allows for a 360° view of the surroundings. The three-dimensional world is divided into areas separated by loading screens, and the player can move freely throughout these areas by walking, running, jumping, and climbing ladders. In some rooms and buildings, the camera swings to the side and the main character is restricted to moving as in a two-dimensional platforming environment, while during certain battles the camera pulls up to simulate a top-down shoot 'em up or other video game genres\r\n\r\n**Nominees are:**\r\n\r\n- Cyberpunk 2077\r\n\r\n- Deathloop\r\n\r\n- NieR Replicant ver.1.22474487139\r\n\r\n- Marvel’s Guardians of the Galaxy\r\n\r\n- The Artful Escape\r\n\r\n## Best Audio Design\r\n\r\n### WINNER: Forza Horizon 5\r\n\r\n![image](https://venturebeat.com/wp-content/uploads/2021/11/forzahorizon5-1.jpg)\r\n\r\nForza Horizon 5 is a racing video game set in an open world environment based in a fictional representation of Mexico. The game has the largest map in the entire Forza Horizon series, being 50% larger than Forza Horizon 4 while also having the highest point in the Horizon series. The map was described by creative director Mike Brown as one of the most diverse Forza Horizon maps the team has built. The map contains an active caldera volcano, jungles and beaches, ancient Mayan temples, and towns and cities such as Guanajuato. Players can explore the open world freely, though they can also compete in multiplayer races and complete the campaign mode. Both the cars featured in the game and the player character can be extensively customised.\r\n\r\n**Nominees are:**\r\n\r\n- Deathloop\r\n\r\n- Forza Horizon 5\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n- Resident Evil Village\r\n\r\n- Returnal\r\n\r\n## Best Indie\r\n\r\n### WINNER: Kena: Bridge of Spirits\r\n\r\n![image](https://www.nme.com/wp-content/uploads/2021/09/kena-bridge-of-spirits-1.jpg)\r\n\r\nKena: Bridge of Spirits is an action-adventure game played from a third-person perspective. The player controls Kena, a young spirit guide with magical abilities. In combat, the player uses Kena's staff for light, heavy, and charged attacks. An upgrade transforms the staff into a bow, which can be used to attack enemies, act as a grappling hook, or hit crystals to solve puzzles. When defending against enemies, the player can activate Kena's pulse ability, which acts as a shield and has a health meter that depletes when attacked; it also serves to provide clues and activate objects, and an upgrade allows the player to dash forwards, which can be used to pass through barriers to the Spirit Realm, dodge attacks and stun enemies, and corporealize spirit enemies. Activating the pulse ability before an attack stuns the enemy. The player also gains the ability to use Spirit Bombs, which can be used to float shimmering rocks for platforming or as an attack against enemies\r\n\r\n**Nominees are:**\r\n\r\n- 12 Minutes\r\n\r\n- Death’s Door\r\n\r\n- Kena: Bridge of Spirits\r\n\r\n- Inscryption\r\n\r\n- Loop Hero\r\n\r\n## Best Debut Indie\r\n\r\n### WINNER: Kena: Bridge of Spirits\r\n\r\n![image](https://crazygamer.ca/wp-content/uploads/2021/08/kena-bridge-of-spirits-1620308200917_160w.jpg)\r\n\r\n**Nominees are:**\r\n\r\n- Sable\r\n\r\n- Kena: Bridge of Spirits\r\n\r\n- The Artful Escape\r\n\r\n- The Forgotten City\r\n\r\n- Valheim\r\n\r\n## Best Mobile Game\r\n\r\n### WINNER: Genshin Impact\r\n\r\n![image](https://cdn1.epicgames.com/salesEvent/salesEvent/EGS_GenshinImpact_miHoYoLimited_S1_2560x1440-91c6cd7312cc2647c3ebccca10f30399)\r\n\r\nGenshin Impact is an open-world action role-playing game that allows the player to control one of four interchangeable characters in a party. Switching between characters can be done quickly during combat, allowing the player to use several different combinations of skills and attacks.  Characters may have their strengths enhanced in various ways, such as increasing a character's level and improving artifacts and the weapons that the character equips. In addition to exploration, the player can attempt various challenges for rewards. Scattered across Teyvat are bosses and challenges that reward highly valuable resources, such as Stormterror and the Electro Hypostasis, but claiming them uses up a currency called resin, which slowly regenerates over time. Completing these challenges grants the player progress towards increasing their Adventure Rank, which in turn unlocks new quests, challenges, and raises the World Level. The World Level is a measure of how strong the enemies within the world are and the rarity of rewards that defeating them gives\r\n\r\n**Nominees are:**\r\n\r\n- Fantasian\r\n\r\n- Genshin Impact\r\n\r\n- League of Legends: Wild Rift\r\n\r\n- MARVEL Future Revolution\r\n\r\n- Pokemon Unite\r\n\r\n## Best Action\r\n\r\n### WINNER: Returnal\r\n\r\n![image](https://i.pinimg.com/originals/08/80/f6/0880f6f95229577094ef8be092498639.png)\r\n\r\nReturnal is a third-person shooter video game featuring roguelike elements and covering the psychological horror genre. Set in a futuristic science fiction setting, the player controls Selene (Jane Perry), a space pilot, equipped with a suit and armed with high-tech weapons, who is stranded on the alien planet Atropos, and stuck in a time loop. After every death, Selene is resurrected, following a pattern of traversing across foreign environments and combating extraterrestrial entities with growing visions in an ever changing world\r\n\r\n**Nominees are:**\r\n\r\n- Back 4 Blood\r\n\r\n- Chivalry II\r\n\r\n- Deathloop\r\n\r\n- Far Cry 6\r\n\r\n- Returnal\r\n\r\n## Best Action/Adventure\r\n\r\n### WINNER: Metroid Dread\r\n\r\n![image](https://media.wired.com/photos/615de4bdcb3eb413e3a033ab/master/pass/Games-Metroid-Dread.jpg)\r\n\r\nMetroid Dread is an action-adventure game in which players control bounty hunter Samus Aran as she explores the planet ZDR. It retains the side-scrolling gameplay of previous Metroid games, alongside the free aim and melee attacks added in Samus Returns (2017). As the player explores, they discover new items and weapons, allowing them to access new areas\r\n\r\nDread adds stealth elements, with Samus avoiding the EMMI robots in certain areas by hiding, reducing her noise, and using the Phantom Cloak, camouflage that makes her invisible but slows her movement. If an EMMI catches Samus, the player has two brief chances to perform melee counters and escape. If they fail, Samus is killed. EMMIs can only be destroyed when Samus obtains the temporary \"Omega Blaster\" upgrade, which is lost upon using it to destroy one; however, destroying an EMMI grants Samus a new permanent upgrade. Players unlock images in an in-game gallery based on their completion time, difficulty level, and percentage of items collected\r\n\r\n**Nominees are:**\r\n\r\n- Marvel’s Guardians of the Galaxy\r\n\r\n- Metroid Dread\r\n\r\n- Psychonauts 2\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n- Resident Evil Village\r\n\r\n## Best Role Playing\r\n\r\n### WINNER: Tales of Arise\r\n\r\n![image](https://i.ytimg.com/vi/95h8JiignvA/maxresdefault.jpg)\r\n\r\nLike previous games in the series, Tales of Arise is an action role-playing game, although its gameplay has gone through unspecified alterations as part of its development goals while retaining the basic Tales battle system, dubbed the Linear Motion Battle System. The game has a big focus on evading and countering, with Tales of Graces, a 2009 entry praised for its combat, cited as inspiration. Unlike many of the previous titles in the series, the game doesn't feature multiplayer, with the development team deciding to focus on various interactions between characters in combat, including the addition of the \"Boost Strike\" feature, allowing multiple party members to perform destructive attacks together under certain conditions\r\n\r\n**Nominees are:**\r\n\r\n- Cyberpunk 2077\r\n\r\n- Monster Hunter Rise\r\n\r\n- Scarlet Nexus\r\n\r\n- Shin Megami Tensei V\r\n\r\n- Tales of Arise\r\n\r\n## Best Fighting\r\n\r\n### WINNER: Guilty Gear: Strive\r\n\r\n![image](https://cdn.akamai.steamstatic.com/steam/apps/1384160/capsule_616x353.jpg)\r\n\r\nIntended as a \"complete reconstruction of the franchise\", Guilty Gear Strive retains the core essence of the series but revamps many features and mechanics, except for the removal of the series’ signature mechanic, the Instant Kill. It introduces the \"Wall Break\" feature, which allows for stage transitions when a combo is initiated in the corner of the arena.\r\n\r\n**Nominees are:**\r\n\r\n- Demon Slayer: Kimetsu no Yaiba – The Hinokami Chronicles\r\n\r\n- Guilty Gear: Strive\r\n\r\n- Melty Blood: Type Lumina\r\n\r\n- Nickelodeon All-Star Brawl\r\n\r\n- Virtua Fighter 5: Ultimate Showdown\r\n\r\n## Best Family\r\n\r\n### WINNER: It Takes Two\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/HXDLVhmdqPzGJMtfysBjti.png)\r\n\r\n**Nominees are:**\r\n\r\n- It Takes Two\r\n\r\n- Mario Party Superstars\r\n\r\n- New Pokémon Snap\r\n\r\n- Super Mario 3D World + Bowser’s Fury\r\n\r\n- WarioWare: Get It Together!\r\n\r\n## Best Multiplayer\r\n\r\n### WINNER: It Takes Two\r\n\r\n![image](https://cdn.vox-cdn.com/thumbor/e7CjCG5gmFXnpbchq2xqUB2OdRY=/0x0:3819x1599/1200x675/filters:focal(1605x495:2215x1105)/cdn.vox-cdn.com/uploads/chorus_image/image/69017949/two.0.png)\r\n\r\n**Nominees are:**\r\n\r\n- Back 4 Blood\r\n\r\n- It Takes Two\r\n\r\n- Knockout City\r\n\r\n- Monster Hunter Rise\r\n\r\n- New World\r\n\r\nValheim\r\n \r\n## Most Anticipated\r\n\r\n### WINNER: Elden Ring\r\n\r\n![image](https://cdn.vox-cdn.com/thumbor/1A4-XjfBdFlaazdEv-74Nr4Hcnc=/0x0:1920x1280/1400x933/filters:focal(807x487:1113x793):no_upscale()/cdn.vox-cdn.com/uploads/chorus_image/image/70124039/elden_ring_1.0.jpg)\r\n\r\nElden Ring is an action role-playing game played in a third-person perspective and features elements similar to those found in its predecessors, the Souls series as well as Bloodborne and Sekiro: Shadows Die Twice, with gameplay focusing on combat and exploration. Director Hidetaka Miyazaki explained that players start with a linear opening but will eventually progress to freely explore the Lands Between, including its six main areas, as well as castles, fortresses, and catacombs scattered throughout the vast open-world map. These main areas are interconnected through a central hub that players can access later in the game's progression—similar to Firelink Shrine from Dark Souls—and will be explorable using the character's mount as the main mode of transport, although a fast travel system will be an available option. Throughout the game, players will encounter non-player characters (NPCs) and enemies alike, including the demigods who rule each main area and will serve as the game's main bosses\r\n\r\n**Nominees are:**\r\n\r\n- God of War Ragnarok\r\n\r\n- Elden Ring\r\n\r\n- Horizon Forbidden West\r\n\r\n- Sequel to The Legend of Zelda: Breath of the Wild\r\n\r\n- Starfield\r\n\r\n \r\n## Innovation in Accessibility\r\n\r\n### WINNER: Forza Horizon 5\r\n\r\n![image](https://assets.gamepur.com/wp-content/uploads/2021/06/13134935/Forza-Horizon-5-Official-Release-Date-Trailer-4K-_-E3-2021-00-01-44-.jpg)\r\n\r\n**Nominees are:**\r\n\r\n- Far Cry 6\r\n\r\n- Forza Horizon 5\r\n\r\n- Marvel’s Guardians of the Galaxy\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n- The Vale: Shadow of the Crown\r\n \r\n## Best Esports Game\r\n\r\n### WINNER: League of Legends\r\n\r\n![image](https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_obituary/public/d8/images/methode/2020/10/29/9ae7fa98-1902-11eb-8f67-a484f6db61a1_image_hires_022408.jpeg?itok=E90OZb1k&v=1603909455)\r\n\r\nSummoner's Rift is the flagship game mode of League of Legends and the most prominent in professional-level play. The mode has a ranked competitive ladder; a matchmaking system determines a player's skill level and generates a starting rank from which they can climb. There are nine tiers; the least skilled are Iron, Bronze, and Silver, and the highest are Master, Grandmaster, and Challenger\r\n\r\n**Nominees are:**\r\n\r\n- Call of Duty: Warzone\r\n\r\n- Counter-Strike: Global Offensive\r\n\r\n- DOTA2\r\n\r\n- League of Legends\r\n\r\n- Valorant"
	},
	{
		"_id": "6203bd57b0d50e4d201d5f03",
		"title": "DUPLICATE-3 CES 2022: what will we see at the world’s largest electronics expo in January?",
		"abstract": "CES 2022 will return to Las Vegas – but will it be worth attending in-person?",
		"imageCover": "ces-logo.jpg",
		"tags": ["computer", "technology", "science", "events"],
		"category": "events",
		"typeFace": "main",
		"author": "61ed7e4a3c05a74b3559bb4a",
		"markdown": "Watching CES online last year was certainly an experience – but we’re happy to see it return to its regular old in-person format for 2022. \r\n\r\nWhen it kicks off in January, CES 2022 will bring us a bevy of new devices from all the major players in the industry. We’ll see some cutting-edge TV technology from the likes of LG, Samsung and Sony, plus new laptops, smartphones, wearables and headphones, too. \r\n\r\nThat said, we’re expecting a slightly more subdued show than in years past due to the ongoing Covid-19 pandemic and its impact on international travel – but as of right now, the CTA says that most of the main players will be returning to their usual spots on the Las Vegas Convention Center show floor. It sounds like it will be slightly smaller than in years past, but with all of the same tech-y goodness that you’d expect from a CES.\r\n\r\n## CES 2022: Date and Timings\r\n\r\n![image](https://miro.medium.com/max/1000/1*MgdcQrN0nQa5DF2VqmVV4Q.jpeg)\r\n\r\nOfficially, CES 2022 runs from Wednesday, January 5 through Saturday, January 8, 2022. That’s when the show floor will be open, and you’ll be able to walk around to check out the different booths - as long as you have official documentation that you’ve been vaccinated.\r\n\r\nLike previous conferences, however, there are two days of press conferences that happen before the show floor opens that take place on Monday, January 3 and Tuesday, January 4. That includes CES Unveiled that takes place from 5 - 8 pm PST on Monday, January 3 and the big press events from LG, Samsung and Sony that happen on Tuesday at 8 am PST and run through the entire day.\r\n\r\nWhen most folks get there on Wednesday, the CES show floor will be open from 10 am PST until 6 pm PST then from 9 am to 6pm PST from Thursday to Friday. CES 2022 will officially wrap up at 4 pm PST on Saturday, January 8. \r\n\r\nSo what are we going to see there?\r\n\r\n## Samsung at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/XgiCMPpcmAXxJaPjkK8DLc-970-80.jpg.webp)\r\n\r\nFrom TVs to phones to appliances you’ll be able to buy next year, as well as chef bots and ball robot concepts that may never reach the market, Samsung always has a lot to show at CES, and we anticipate a similar range of products shown off at CES 2022. \r\n\r\nWe expect Samsung to show off a number of new 4K and 8K Neo QLED TVs, following up last year’s excellent Samsung QN90A and QN900A models. As far as phones go, we anticipate seeing some of its more recent mid-range phones as well as the long-delayed Samsung Galaxy S21 FE, and maybe even a hint of the upcoming Samsung Galaxy S22 flagship range.\r\n\r\n## Sony at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/3b1e077c48920e8f8fee4a0c4c3f3de6-970-80.jpg.webp)\r\n\r\nSony is always tough to nail down when it comes to CES plans. Some years they show up with a concept car. Other times they show up with an animatronic dog. You never really know what Sony will have in any given year. \r\n\r\nThat being said, we do have a few hunches of what we’re going to see there. From Sony’s audio department, we’re likely to see a new lineup of digital media players (i.e. Walkmans) as well as a pair of premium headphones or two. We’ll see some wireless speakers and, from the TV side, at least three to four new 4K and 8K screens to whet our appetites for the 2022 Sony TV lineup. \r\n\r\nSony usually doesn’t show off much from its camera business at CES but expect to at least hear how the company’s music and movie arms are doing. Will we see the PlayStation VR 2 there? Probably not, but we’ll certainly keep our eyes peeled just in case Sony surprises us.\r\n\r\n## TCL at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/2cEj53dGM34jiECtLEfuug-970-80.jpg.webp)\r\n\r\nTCL has embraced CES as a launchpad for its new products coming out in the year and concepts we might not see for awhile. Though some of those devices slated to come out get quietly delayed (or never release at all), there’s always an interesting range of TVs, phones, flexible-screen devices, and other gadgets from TCL, and we expect CES 2022 to be no different.\r\n\r\nGiven TVs are TCL’s bread and butter, we expect new 6-Series Mini LED TVs following up on last year's fantastic TCL 6-Series 8K. TCL is only a few years into releasing phones under its own name, and we expect a follow-up to the TCL 20 series released last year – perhaps the TCL 30 line. There could also be TCL Tab tablets to see, along with concept devices we can’t begin to predict.\r\n\r\n## Hisense at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/FLtFpvfPCcrk827heqRSzF-970-80.png.webp)\r\n\r\nHisense never gets the same amount of airtime as companies like Sony, Samsung and LG at CES, but it’s still worth a stop at the company’s booth if you’re walking around the Las Vegas Convention Center. What we’re expecting from Hisense this year is another lineup of Google TV-toting smart TVs for the UK as well as some nice new laser TVs for the US. \r\n\r\nIf you’re looking for super futuristic display technology, you’ll find it at Hisense’s booth as well – however, most of it is either conceptual or exclusive to the Chinese market. \r\n\r\n## Intel at CES 2022\r\n\r\n![image](https://static.techspot.com/images2/news/bigimage/2021/08/2021-08-19-image-12-j.webp)\r\n\r\nThe biggest reveal we expect from Intel at CES is the continued release of new Alder Lake CPUs. We’re expecting some of its flagship enthusiast silicon to be released in November, but those will mostly be high-end desktop chip. CES 2022 might see Alder Lake chips making it to the mobile computing segment, where the big.LITTLE architecture should significantly boost laptop energy efficiency.\r\n\r\nIf early indications hold up, the new Alder Lake chips might leave the Apple M1 and M1X processors in the dust along with AMD’s Zen 3 chips.\r\n\r\n## Panasonic at CES 2022\r\n\r\n![image](https://m.thepeninsulaqatar.com/get/maximage/20171010_1507665098-180025.jpg)\r\n\r\nPanasonic usually shows up to CES with two big announcements – one for its new OLED TV and another for its Technics line of vinyl players and headphones. This year, that could certainly change and Panasonic might surprise us with something totally new and different, but this game plan has always served Panasonic well in the past.\r\n\r\nUnfortunately, the rest of Panasonic’s announcement will likely come during IFA 2022 – which isn’t happening until September of next year. \r\nOur predictions for...\r\n\r\n## Phones at CES 2022\r\n\r\n![image](https://i2.wp.com/www.maggt.com/wp-content/uploads/2021/11/samsung-s21-fe-ces-launch.jpg)\r\n\r\nCES isn’t a big stage for phones coming out this year – that’s usually Mobile World Congress (MWC), which happens in February – but several brands choose to debut some new handsets at the first big annual show. These include some flagship devices but mostly mid-range and budget phones, as companies save their heavy hitters for MWC.\r\n\r\nAs previously mentioned in their own sections, we expect Samsung and TCL to have several devices on display, if previous CES shows are anything to go by. That includes pricier Samsung mid-range devices like follow-ups to the Samsung Galaxy A52 and Samsung Galaxy A72, as well as the potential debut of the still-unseen Samsung Galaxy S21 FE. For TCL, we’d expect the first round of devices in the TCL 30 lineup, with others coming later in the year.\r\n\r\nIt’s possible we see other brands show off their traditional phones, as Motorola has done with Moto G phones in years past. But we’re also expecting non-traditional phones, especially flexible-display devices: both the TCL Rollable and LG Rollable were shown off at CES 2021, and though neither has reached the market (RIP LG phones), they’re still showing where phone design could go.\r\n\r\n## Audio at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/vazDB9FLc4i3xaTE5B7yL4-970-80.jpg.webp)\r\n\r\nWe’re spoiled when it comes to audio products at trade shows. Between NAB, The Bristol Hi-Fi Show and CanJam, we have a new event every three months that will show us what’s hot in the world of hi-fi headphones, speakers and soundbars. That said, while we have plenty of opportunities to get our ears on the latest and greatest cans, CES provides the unique opportunity of seeing what comes next – i.e. the experimental stuff.\r\n\r\nIn years past, that’s included Creative’s Super X-Fi technology and Sony 360 Reality Audio and we’re expecting to see more upgrades to both technologies at this year’s event. \r\n\r\nBeyond headphones, expect to see plenty of new Bluetooth speakers and soundbars from LG, Samsung and Sony – plus bookshelves and standing speakers from Klipsch, JBL and more. That’s a fairly murky prediction, honestly, but the world of hi-fi moves fast and products are announced and released faster than most folks can keep up with them.\r\n\r\nTVs at CES 2022\r\n\r\n![image](https://mma.prnewswire.com/media/1685539/SKYWORTH_W82.jpg?p=facebook)\r\n\r\nBigger. Brighter. More pixels. Better contrast. It sounds so simple when you break it down like that, but in reality those are the four traits that every TV maker in the whole world are chasing right now. Bigger screens have always been a trend at CES but these past few years we’ve seen some truly super-sized models reaching upwards of 90 inches. Crossing that barrier will be difficult - and expensive - but it’s only a matter of time until we see affordable 100-inch TVs.\r\nAdvertisement\r\n\r\nIn terms of brightness and contrast, we’ll be looking for new Mini LED TVs to push the envelope on both fronts. We got our first batch of models from LG and Samsung this year in the form of the Samsung QN90A QLED TV and LG QNED99, and both blew us away. \r\n\r\nThere are some interesting rumors floating around about what could come next for display technologies - holographic and transparent TVs anyone? - but we’ll just have to wait until we get to Vegas to find out what the big three have in store for us.\r\n\r\n## Smart Home at CES 2022\r\n\r\n![image](https://d1wa5qhtul915h.cloudfront.net/app/uploads/2021/07/Bike-Europe-CES-2020.jpg)\r\n\r\nTouchless tech was a big thing at CES 2021; from Kohler’s kitchen faucet that can dispense water by simply placing a hand in front of it, to Arlo’s video doorbell that can alert you when someone is standing on your doorstep rather than actually needing to push the doorbell itself. Thanks to the on-going effects from the global pandemic we expect to see a lot more touchless tech at CES 2022. \r\n\r\nThere’s likely to also be the usual crop of smart home devices including home security cameras with better resolutions and smarter AI that can help ensure you’re not plagued by unwanted motions alerts. We also expect to see a plethora of robot vacuums that offer better suction and utilize AI to navigate around your home, carefully avoiding obstacles such as socks that have escaped from the laundry pile and rogue phone charging cables. \r\n\r\n## Wearables at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/XuFbfK4dg9YixtxCsrEPdP-970-80.jpg.webp)\r\n\r\nMost of the big names in fitness tracking (including Garmin and Fitbit) prefer to host their own events for each of their product launches rather than doing a big reveal at CES. That doesn’t mean Fitbit will be entirely absent from CES 2022, though.\r\n\r\nFitbit is now owned by Google, which is working to bring Fitbit apps and celebrations to its own smartwatch operating system, WearOS. CES is traditionally used as a showcase for new Wear OS watches, with companies like Skagen, Suunto, and Withings all showing off their latest Google-powered devices, so the 2022 show could give us our first glimpse of how the Fitbit integration will work on a smartwatch.\r\n\r\nWe could also see some fitness trackers that are a little outside the norm. At CES 2021, UK-based DNABand revealed a watch that uses data derived from a saliva sample to provide customized advice while you’re shopping for groceries. It’s likely that we’ll see something equally unusual at the 2022 show, and we’ll be keeping a close eye on the startups showing off weird and wonderful wearables in the hopes of attracting an investor’s attention.\r\n\r\nOne final possibility is the appearance of ‘fitness tracking as a service’. We’ve seen some interesting developments in this area recently, with Amazon and Fitbit both releasing new devices that keep some insights hidden behind a paywall. At CES 2022, it’s possible that we might get our first glimpse of a fitness tracker that’s free up-front, but requires a rolling monthly subscription if you want to see your health data.\r\n\r\n## CES 2022: how to register\r\n\r\n![image](https://larepublica.pe/resizer/vvGDWnZ22WVd5KPxzoNVqt6XDbU=/1200x660/top/cloudfront-us-east-1.images.arcpublishing.com/gruporepublica/WPYHOGS5YNDHRJULOUXR3N2CDI.jpg)\r\n\r\nRegistration for CES 2022 is available now to the consumer technology industry now at the [CES website.](https://www.ces.tech/Logistics/Register-Now.aspx) In terms of cost, the CTA plans to charge a $300 fee. The fee will apply to most attendees, including retailers, but like in past years, credentialed journalists and analysts will be exempt."
	},
	{
		"_id": "6203bd57b0d50e4d201d5f04",
		"title": "DUPLICATE-3 Best college laptops for students, from budget laptops to workstations.",
		"abstract": "The complete list of best laptops available for the college students to help their coding.",
		"imageCover": "laptop-cover.jpg",
		"tags": ["computer", "technology", "general"],
		"category": "general",
		"typeFace": "main",
		"author": "61ed7e4a3c05a74b3559bb4d",
		"markdown": "If you're a student, you'll want one of the best college laptops so you can ace your exams then stream TV or play games when it's time to relax. But with so many choices at so many different prices, it can be homework in itself to find the very best laptops for students. \r\n\r\nWhen you're buying a laptop for school, make sure it has long battery life and fast CPU performance. You can find a lot of these units on our main best laptops page, which gives you a wide selection of the top notebooks to choose from. And if you prefer to take notes by hand, buy one of the best 2-in-1 laptops. We've also ranked the best gaming laptops for those who like to unwind after the coursework is wrapped up. We're still in a process of reviewing some laptops that could find their way on this list, so be sure to check back in regularly for the latest and great laptops for students. \r\n\r\n## HP Envy . \r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/X65pzFAjWZpsydiR8L5XoK-970-80.jpg.webp)\r\n\r\nThe best laptop for students is now better than ever. Refreshed with a new design and a Thunderbolt 4 port, the new HP Envy 13 is the best sub-$1,000 laptop for students or anyone who needs a portable machine with loads of power and long battery life (11:15 on the FHD model). \r\n\r\nWith even slimmer bezels and faster performance, the 2021 model shows that it can hang with much pricier flagship models. Combine those features with a sleek chassis, bright and vivid 1080p display and plenty of performance from an 11th Gen Core i5 CPU, and it's easy to see why the Envy 13 is the best college laptop for students. And frankly, given that this is a budget laptop compared to many of the others on this list, the Envy 13 is an awesome choice. If you need a larger display, see our HP Envy 14 review. \r\n\r\n## MacBook Air with M1\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/AUaDk6VmkFriSBiQJHrx4V-970-80.jpg.webp)\r\n\r\nIf you prefer macOS to Windows 10, then go with the Apple MacBook Air. The biggest improvement to this year's model is the new M1 chip, which delivers outstanding performance and excellent battery life, making the new MacBook Air the fastest ultrathin laptop ever.  \r\n\r\nBest of all, the MacBook Air still costs only $999, and yet, you can unrivaled performance along with 14 hours and 41 minutes of battery life. This is a combination you'll only find from the very best Windows 10 laptops, and even they can't compete in head-to-head performance. \r\n\r\nSo why buy the MacBook Air instead of the Pro? While the Pro has better sustained performance, the MacBook Air is cheaper and is pin-drop silent because it doesn't have a fan. And, of course, Apple's least expensive 13.3-inch model is the most portable, coming in at only 0.6 inches thick and 2.8 pounds. \r\n\r\nBut now the MacBook Air is slower to parity with the MacBook Pro than ever before. It has similar speed and battery life, the same 720p webcam, a comfortable Magic keyboard and two USB-C ports. Also, the 13.3-inch, 2560 x 1600-pixel Retina display on the M1 model was improved with P3 color coverage, making it more vibrant than the previous panel. \r\n\r\n## Dell XPS 13 \r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/8dTpBaD5tdkcVwYhFpJvfb-970-80.jpeg.webp)\r\n\r\nThe Dell XPS 13 is a serious workhorse and the best premium laptop for college students. Powered by an 11th Gen Intel Core i7 processor with integrated Intel Iris Xe graphics, the notebook is ready for work or play. And with more than 11 hours of battery life, you've got plenty of time for both. The laptop consistently performed either better or on a par with competing systems.\r\n\r\nBut rest assured, the XPS 13 is just as pretty as it is powerful. The company managed to make a laptop that's smaller and lighter than previous models. Despite the smaller size, Dell added some big changes, including a larger trackpad and keyboard. Plus, you get a 13.4-inch, near-bezelless display on every side –– the first in the world to do so. \r\nAdvertisement\r\n\r\nIt's an exercise in patient restraint, improving the notebook in a bunch of small ways that add up to a big leap for the system. If you're looking for the total package, the Dell XPS 13 is the laptop for you. \r\n\r\n\r\n## HP Envy x360 \r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/rZxKJRZLwQ6RDgWHCJnRTM-970-80.jpg.webp)\r\n\r\nThe HP Envy x360 13 is the best laptop for under $1,000 and one of the best Ultrabooks on the market. While it doesn't come with a stylus (neither does the Surface Pro), the Envy is a 2-in-1, which lets you flip it into tent or tablet mode. What makes this such a fantastic value is its entirely aluminum design and Herculian AMD Ryzen processors. \r\n\r\nIn our testing, we found that an Envy x360 13 with a Ryzen 5 4500U CPU can outperform laptops with 10th Gen Intel chips. This specific Envy costs just $800 and can outmuscle laptops that cost well over $1,000, including the exorbitant MacBook Pro. Moreover, the Envy x360 13 has a bright, vivid 13.3-inch display and a comfortable keyboard. \r\n\r\nThere is very little we don't like about the Envy x360. If you can get over the lack of a Thunderbolt 3 port and IR camera, then it is the ultimate money-saving laptop. If you prefer a larger display, see our HP Envy x360 15 review. \r\n\r\n\r\n## Apple MacBook Pro \r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/GhzFxPPWGGom7wLjUjQYDA-970-80.jpg.webp)\r\n\r\nThis is the huge leap forward we've been waiting on. It is all thanks to the new M1 chip, Apple's first-ever custom SoC for laptops. With the best power-per-watt performance of any processor, the M1 brings the MacBook Pro's performance and battery life to the next level.\r\n\r\nMore specifically, the MacBook Pro is more powerful than nearly every PC on the market, including some workstations. And despite cramming so much power into such a slim and sleek chassis, the Pro lasted for an outstanding 16 hours and 32 minutes on our battery test, which simulates real-world testing.\r\n\r\nWith an image processing unit, the webcam (sadly, still 720p) is better than before and since it runs on Apple's ARM-based architecture, iPad and iPhone apps are now available on Mac. Yep, you can run all your favorite iOS games and apps on your laptop now. \r\n\r\nRounding out the numerous enhancements found in the latest MacBook Pro is Big Sur, the latest version of macOS. The largest update since OS X launched a decade ago, Big Sur is a beautiful redesign of the desktop OS.  \r\n\r\n## HP Spectre x360 14\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/qBfGdkRvjJszWvRJGJfdhS-970-80.jpg.webp)\r\n\r\nThe Spectre x360 14 is the best 2-in-1 laptop ever. Newly released for 2021, the 13.5-inch model builds upon its predecessors but adds useful new features including a 3:2 aspect ratio display and 11th Gen Intel CPUs with Iris Xe graphics. Highlights of this laptop include a stunning design, bright and vivid 1920 x 1280-pixel IPS and 3K2K OLED display options, epic 12+ hour battery life and fast overall performance. \r\n\r\nAdd to that a generously sized touchpad that is silky to the touch as well as a comfortable (albeit shallow) keyboard, excellent security options (fingerprint sensor and facial recognition) and a good selection of ports, and well, it's easy to see why we like this laptop so much. \r\n\r\nWe recommend buying the Spectre x360 14 over the Envy 13 if you have the money, especially if you need the flexible design. In fact, the Spectre x360 14 is the best laptop if you want a convertible notebook, period. Sure, it has a few faults, but those are easily forgotten once you get this beauty in your hands. \r\n\r\n## Acer Swift 3 (2020, AMD Ryzen)\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/ZwJ97S9pSrMho8diQwGUp6-970-80.jpg.webp)\r\n\r\nIf you want blistering performance at a budget price, look no further than the Acer Swift 3 with AMD Ryzen CPUs. This $649 laptop can outperform the Dell XPS 13 and even make a run at the MacBook Pro. It's really all about the Ryzen 7 4700U CPU inside, which trounces its Intel opposites in raw performance.\r\n\r\nWe also like the Swift 3's clicky keyboard, which was comfortable to type on thanks to the springy feedback. You also get a fingerprint reader on the deck for quick login and the chassis is made of aluminum and magnesium, not plastic. Our biggest beef with the Swift 3 is the dim and dull display. If that isn't a concern for you, the Swift 3 is an excellent choice at a reasonable price.\r\n\r\n## Lenovo ThinkPad X1 Carbon (Gen 9)\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/BqTQ8aW42Gur7FfwNBayeZ-970-80.jpg.webp)\r\n\r\nLenovo made several welcome changes to the 9th Gen edition of its flagship business laptop. Along with fast performance from 11th Gen Intel CPUs, you get longer battery life (15 hours!), powerful quad speakers, a new 14-inch display with a 16:10 aspect ratio, and plenty of ports, all in an impossibly lightweight chassis (2.5 pounds). \r\n\r\nBut it's still those classic ThinkPad features —  a durable design (with MIL-STD-810G strength), best-in-class keyboard and stealthy black/red aesthetics — that carry the X1 Carbon to greatness.\r\n\r\nYes, we wish the ThinkPad X1 Carbon had a better webcam and hadn't ditched the SD card reader in the previous. Also, top configurations can get very expensive; still, you'd be hard-pressed to find a better business laptop for students going to college. If you want a 2-in-1 laptop with business features, consider the ThinkPad X1 Yoga (Gen 6).\r\n\r\n## Google Pixelbook Go\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/joGUDW4Gb6K49nGB4YHDcH-970-80.jpg.webp)\r\n\r\nThe Google Pixelbook Go is a fantastic laptop for students because you get the same sleek elegance as the Pixelbook but at a much lower cost. Starting at $649, the Pixelbook Go is among the cheapest laptops on this list, yet it delivers a lightweight chassis, fast performance and epic battery life. \r\nAdvertisement\r\n\r\nMore classrooms are shifting to Chromebooks, so the Pixelbook Go should feel familiar to students. It's an easy-to-use, lightweight operating system centered around the Chrome browser. What makes the Pixelbook Go such a good option is that it's durable and powerful enough to survive for several years, so buy it for your freshman child and it should last him through high school graduation and into college.\r\n\r\n## Lenovo Legion 5 Pro\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/zrRpB2DYw3MqQEPXwFtBSN-970-80.jpg.webp)\r\n\r\nLenovo's Legion 5 Pro proves what's possible when two opposing forces come together for the greater good. Those forces are AMD and Nvidia, and the greater good is the gaming community. Armed with an AMD Ryzen 7 5800 CPU and Nvidia GeForce RTX 3070 graphics, the Legion 5 Pro gives gamers the power they need to run the latest AAA titles at Ultra graphics settings. \r\n\r\nWhat it lacks in flashy aesthetics, it makes up for with a gorgeous 16-inch QHD display, an exceptional keyboard and touchpad, plenty of ports, and outstanding performance from the one-two punch of an AMD CPU and Nvidia GPU. And despite harnessing so much power, the Legion 5 Pro delivers respectable battery life. \r\n\r\nThanks for reading this far!"
	},
	{
		"_id": "6203bd57b0d50e4d201d5f05",
		"title": "DUPLICATE-3 AMD could have a secret weapon to make gaming laptops better",
		"abstract": "RX 6000S mobile graphics cards might make their presence felt soon",
		"imageCover": "amd-cover.jpg",
		"tags": ["computer", "technology", "gaming"],
		"category": "technology",
		"typeFace": "main",
		"author": "61ed7e4a3c05a74b3559bb4d",
		"markdown": "AMD could be about to introduce new graphics cards for laptops, at least going by the rumor mill which predicts revamped RDNA 2 GPUs are waiting in the wings. The possible refresh of RX 6000 mobile GPUs might be based on TSMC’s 6nm process, and could be named as the RX 6000S series. VideoCardz cites hardware leaker Disclosuzen on Twitter as the source for details on these purported new graphics solutions (though note that as PC Gamer, which spotted this, observes, the leaker’s Twitter account has been suspended).\r\n\r\n![image](https://www.amd.com/system/files/2021-03/749511-amd-radeon-6000-series-4-gpus-1290x709_0.png)\r\n\r\nBacking this up, another well-known hardware leaker on Twitter, Greymon55, has previously theorized (a few months back) that AMD has a 6nm-based refresh of the 6000 mobile series inbound, though they believed it would be kick off with the RX 6900M, whereas this fresh leak claims it’ll be the RX 6800S.\r\n\r\nThe charge could be led by that RX 6800S, and apparently there may be other revamped laptop GPUs in line with that, as you might expect; but not the whole range. Greymon55 has previously guessed that we could see up to four models in the new ‘S’ series. Heavy salt with all this, it goes without saying.\r\n\r\nAs for rumored specs, apparently the RX 6800S will keep the same core count (2,560) and bus as the existing 6800M, but due to dropping to 6nm (from 7nm with the existing GPU), the 6800S should be capable of higher clock speeds for better performance.\r\n\r\n![image](https://i.itworldcanada.com/wp-content/uploads/2020/10/amd-radeon-rx-6000-feature.jpg)\r\n\r\nThe RX 6800S (the ‘S’ stands for Super, right?) could obviously be a useful boost for AMD’s laptop GPU line-up, and on 6nm rather than 7nm, as we observed above, it could potentially ramp up clocks nicely; and the other big plus would be improved power-efficiency, too. Of course, when it comes to laptop hardware which is packed into a tight chassis – where heat and the space for adequate cooling solutions becomes a trickier balancing act – more efficiency is a major boon.\r\n\r\nThat said, there’s little info on the potential spec yet, so we shouldn’t build up any expectations on the performance front. We’ve also heard arguments pushing the idea that 6nm may not offer much in terms of extra oomph or efficiency (but even if any performance gains were minimal, dropping to 6nm would still improve availability of GPUs – always an issue these days – simply because there’ll be more chips from a single wafer).\r\n\r\nWe’ll just have to see how things pan out, but if these new laptop graphics cards are indeed real, we’ll likely witness more spillage on them soon enough. Meanwhile, Nvidia is rumored to have new RTX 3000 Ti GPUs for laptops ready to launch at CES 2022, just around the corner at the start of January, with an RTX 3070 Ti mobile version recently being spotted in leaked product details of an Acer laptop."
	}, {
		"_id": "6203bd57b0d50e4d201d5f06",
		"title": "DUPLICATE-4 Can’t wait for Intel Arc Alchemist GPUs? We may have some bad news...",
		"abstract": " Slight doubts aired over Intel’s Q1 release timeframe via the rumor mill",
		"imageCover": "intel-arc.jpeg",
		"tags": ["technology", "computer"],
		"category": "technology",
		"typeFace": "main",
		"author": "61ed7e4a3c05a74b3559bb4a",
		"markdown": "Intel’s Arc Alchemist graphics chips have been shown in a video, complete with fresh rumors about the possible launch schedule. This comes from YouTuber Moore’s Law is Dead (MLID), a common source of Intel and AMD leaks, who shared some images in a video (spotted by VideoCardz), with the pics showing what appears to be two different graphics chips, high-end with up to 512 EUs (or Execution Units) and low-end with up to 128 EUs. MLID further speculates on Intel’s launch timeframes for next year, although this is on even shakier territory, and apparently even the chip giant itself has had difficulty pinning down a release schedule, with dates being moved multiple times according to sources.\r\n\r\n![images](https://i.cdn.newsbytesapp.com/images/l24420210817174233.jpeg)\r\n\r\nThe theory as it stands, though, is that while Intel appears confident of a Q1 2022 launch, MLID is still a little doubtful  that we’ll see products out there and available to buy in the first quarter. MLID further asserts that we could see the low-end Alchemist GPU (128 EUs) launch in the form of desktop graphics cards first, rather than mobile (the latter being first out the gate was what the rumor mill previously contended – and of course, that could still happen). These will likely emerge in April, or perhaps late March, meaning Q1 could still be a possibility (just about), to be followed by the high-end GPUs (512 EUs) likely later in April – assuming the drivers are ready.\r\n\r\n![image](https://static.techspot.com/images2/news/bigimage/2021/08/2021-08-24-image-26.jpg)\r\n\r\nThere are a lot of ifs and buts here, and indeed another point mentioned by MLID is that Intel’s flagship desktop reference boards may not be ready until mid-Q2, and there’s a possibility that third-party graphics cards could be out before the actual reference product. Or Intel might just let card makers do a paper launch, and hold up until a simultaneous release with reference boards is possible.\r\n\r\nIt seems possible, then, that we may see a reversal of the situation that was previously rumored whereby Intel would release laptop Alchemist GPUs first, then desktop cards. Desktop GPUs may come first, perhaps, but may not arrive until April, which is slightly disappointing. Then again, MLID also floats the possibility that low-end laptop cards might come first. The picture is unclear, with Intel apparently switching around the intended release schedule with some regularity.\r\n\r\n![image](https://www.notebookcheck.com/fileadmin/Notebooks/News/_nc3/Intel_ARC_Alchemist_Reference_Graphics_Card_Final_Design_Renders__8_2060x1299.png)\r\n\r\nIt sounds like nothing is set in stone, really, and that this has led MLID to doubt whether Intel might have anything but a paper launch in Q1 (and perhaps a tiny amount of product). A lot may depend on the state of play with the graphics driver, too, and while MLID makes it clear that he isn’t worried about the quality of Intel’s work on the driver long-term, Team Blue might struggle to get it fully in shape and optimized (particularly for the high-end GPU) to hit late March or early April. All of which isn’t what we really want to hear – we’d like leaks to be pointing to something definitely happening in Q1, of course, but it seems like there could be a possibility of things slipping.\r\n\r\nAll that said, Intel seems to have been pretty confident talking about a Q1 release, and again confirmed this timeframe in a video showing various games being run by an Alchemist GPU aired last week.\r\n\r\nWhat’s also interesting to hear from MLID is that Intel is set to really push at the budget end of the graphics card market, which will be music to the ears of those hunting for a wallet-friendly GPU, and having real problems finding viable candidates right now. There are fresh budget options purportedly in the pipeline from both AMD and Nvidia in the near future, of course, but it sounds like Intel is shaping up to make an impressive assault on the low-end GPU sector for laptops and desktops alike. Exciting times ahead…"
	},
	{
		"_id": "6203bd57b0d50e4d201d5f07",
		"title": "DUPLICATE-4 Game Awards 2021: Here’s the full list of winners",
		"abstract": "It Take Two wins the Game of the Year, and ties with Forza Horizon 5 for lifting 3 trophies",
		"imageCover": "game-awards.jpg",
		"tags": ["gaming", "entertainment"],
		"category": "gaming",
		"typeFace": "main",
		"author": "61ed7e4a3c05a74b3559bb4a",
		"markdown": "Hosted by Geoff Keighley, The Game Awards 2021 stunned the internet with the biggest reveals and honouring the most well-received titles this year. Arkane Studios’ Deathloop, despite earning nine spots on the nomination list, barely scratched the surface with 2 victories.\r\n\r\nOn the other hand, Hazelight studio’s co-op game, It Takes Two, which bagged five spots on the list, won 3 awards, including the prestigious Game of the Year trophy. This comes as a big relief for director Joseph Fares, who recently received a trademark claim from GTA parent company, Take-Two over similar-sounding names. Following the disastrous launch of the Marvel’s Avengers game, even Square Enix earned a redemption arc when Guardians of the Galaxy lifted the trophy for best narrative.\r\n\r\nIn the Player’s Choice category, Halo Infinite came victorious, despite only having released 2 nights ago. Keanu Reeves made an appearance this year as well, alongside co-star Carrie-Ann Moss to promote their film and the new Unreal Engine 5 tech demo – The Matrix Awakens. Players can download the game for free on their PS5 or Xbox Series X|S consoles and play a few missions based on iconic moments from the franchise.\r\n\r\nWith all that out of the way, here’s a complete list of winners from The Game Awards 2021.\r\n\r\n## Game of the Year\r\n\r\n### WINNER: It Takes Two (Hazelight Studios/EA)\r\n\r\n![image](https://static.digit.in/default/6f18903bae0b3317168eaacb4f93c1a3d915110b.jpeg)\r\n\r\nIt Takes Two is an action-adventure video game with elements from platform games. It is specifically designed for split-screen cooperative multiplayer, which means that it must be played with another player through either local or online play. The game features a large number of game mechanics from various video game genres. These gameplay mechanics are connected to the story and the theme of the level. For instance, in one level, Cody gains the ability to rewind time, whereas May can replicate herself. Players have to cooperate with each other and utilize these abilities in order to progress. The game also features a large number of minigames. \r\n\r\n**Nominees are:**\r\n\r\n- Deathloop (Arkane Studios/Bethesda)\r\n\r\n- It Takes Two (Hazelight Studios/EA)\r\n\r\n- Metroid Dread (Mercury Steam/Nintendo)\r\n\r\n- Psychonauts 2 (Double Fine/Xbox Game Studios)\r\n\r\n- Ratchet & Clank: Rift Apart (Insomniac Games/SIE)\r\n\r\n- Resident Evil Village (Capcom)\r\n\r\n## Best Game Direction\r\n\r\n### WINNER: Deathloop\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/NjKmtsWPWi8FxpXxtT6Grk.jpg)\r\n\r\nIn Deathloop, the player takes on the role of Colt, an assassin stuck in a time loop who has been tasked to take out eight targets called Visionaries across the island before midnight, as leaving even one alive will cause the time loop to reset and undo his work. Further, should Colt die before taking out the eight targets, he will wake back up at the start of the loop. The player uses a combination of stealth, parkour, attack skills, guns, gadgets, and powers as in Arkane's previous Dishonored and Prey games to move about the game world. They must avoid or take out guards, learn the patterns of Colt's targets, and to figure out the right order to eliminate said targets using guns, melee attacks, or other environmental means\r\n\r\n**Nominees are:**\r\n\r\n- Deathloop\r\n\r\n- It Takes Two\r\n\r\n- Returnal\r\n\r\n- Psychonauts 2\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n## Best Narrative\r\n\r\n### WINNER: Marvel’s Guardians of the Galaxy\r\n\r\n![image](https://cdn2.unrealengine.com/egs-marvelsguardiansofthegalaxy-eidosmontral-g1a-00-1920x1080-289382e51c76.jpg)\r\n\r\nIn Marvel's Guardians of the Galaxy, the player assumes control of Peter Quill / Star-Lord from a third-person perspective. The player can utilize Star-Lord's elemental guns to defeat enemies, and fly through the air using his jet boots. Other members of the titular team, which include Gamora, Rocket Raccoon, Groot, and Drax the Destroyer, are not directly playable as they are controlled by artificial intelligence, but players can issue commands to them during combat. Each character has their own unique skills and abilities which can be chained together to inflict more damage. As the player fight enemies, a meter will build up and allow players to unleash a special ability known as \"Team Huddle\", which prompts Star-Lord to create a motivational speech and play a song to inspire his teammates. A good speech will grant the other Guardians gameplay benefits, though Star-Lord's abilities will be boosted regardless of the quality of the speech.\r\n\r\nAt various points of the game, the player can make key decisions, via dialogue trees, that will affect the relationships between the Guardians and the outcomes of certain missions. Throughout the game, Star-Lord's decisions will be referenced by his teammates. Despite the branching dialogue paths, the core story remains the same and the game has one ending\r\n\r\n**Nominees are:**\r\n\r\n- Deathloop\r\n\r\n- It Takes Two\r\n\r\n- Life is Strange: True Colors\r\n\r\n- Marvel’s Guardians of the Galaxy\r\n\r\n- Psychonauts 2\r\n\r\n## Best Art Direction\r\n\r\n### WINNER: Deathloop\r\n\r\n![image](https://cdn.vox-cdn.com/thumbor/2kBy8KhanMObawAjxtC3kZr3JUU=/0x0:3840x2160/1200x675/filters:focal(1613x773:2227x1387)/cdn.vox-cdn.com/uploads/chorus_image/image/69310744/Deathloop_Dual_Spikers_8637260997138ea1827.42474129.0.jpg)\r\n\r\n**Nominees are:**\r\n\r\n- Kena: Bridge of Spirits\r\n\r\n- Deathloop\r\n\r\n- Psychonauts 2\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n- The Artful Escape\r\n\r\n## Best Score and Music\r\n\r\n### WINNER: NieR Replicant ver.1.22474487139\r\n\r\n![image](https://imgix.kotaku.com.au/content/uploads/sites/3/2021/04/23/ihueqnelaahslncmwjpp.jpg)\r\n\r\nPlayers take control of a middle-aged man in Nier Gestalt and a teenaged boy in Nier Replicant, named by the player. The player directly controls the main character through a third-person perspective to interact with people, objects, and enemies throughout the game. The player can also turn the camera around the characters, which allows for a 360° view of the surroundings. The three-dimensional world is divided into areas separated by loading screens, and the player can move freely throughout these areas by walking, running, jumping, and climbing ladders. In some rooms and buildings, the camera swings to the side and the main character is restricted to moving as in a two-dimensional platforming environment, while during certain battles the camera pulls up to simulate a top-down shoot 'em up or other video game genres\r\n\r\n**Nominees are:**\r\n\r\n- Cyberpunk 2077\r\n\r\n- Deathloop\r\n\r\n- NieR Replicant ver.1.22474487139\r\n\r\n- Marvel’s Guardians of the Galaxy\r\n\r\n- The Artful Escape\r\n\r\n## Best Audio Design\r\n\r\n### WINNER: Forza Horizon 5\r\n\r\n![image](https://venturebeat.com/wp-content/uploads/2021/11/forzahorizon5-1.jpg)\r\n\r\nForza Horizon 5 is a racing video game set in an open world environment based in a fictional representation of Mexico. The game has the largest map in the entire Forza Horizon series, being 50% larger than Forza Horizon 4 while also having the highest point in the Horizon series. The map was described by creative director Mike Brown as one of the most diverse Forza Horizon maps the team has built. The map contains an active caldera volcano, jungles and beaches, ancient Mayan temples, and towns and cities such as Guanajuato. Players can explore the open world freely, though they can also compete in multiplayer races and complete the campaign mode. Both the cars featured in the game and the player character can be extensively customised.\r\n\r\n**Nominees are:**\r\n\r\n- Deathloop\r\n\r\n- Forza Horizon 5\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n- Resident Evil Village\r\n\r\n- Returnal\r\n\r\n## Best Indie\r\n\r\n### WINNER: Kena: Bridge of Spirits\r\n\r\n![image](https://www.nme.com/wp-content/uploads/2021/09/kena-bridge-of-spirits-1.jpg)\r\n\r\nKena: Bridge of Spirits is an action-adventure game played from a third-person perspective. The player controls Kena, a young spirit guide with magical abilities. In combat, the player uses Kena's staff for light, heavy, and charged attacks. An upgrade transforms the staff into a bow, which can be used to attack enemies, act as a grappling hook, or hit crystals to solve puzzles. When defending against enemies, the player can activate Kena's pulse ability, which acts as a shield and has a health meter that depletes when attacked; it also serves to provide clues and activate objects, and an upgrade allows the player to dash forwards, which can be used to pass through barriers to the Spirit Realm, dodge attacks and stun enemies, and corporealize spirit enemies. Activating the pulse ability before an attack stuns the enemy. The player also gains the ability to use Spirit Bombs, which can be used to float shimmering rocks for platforming or as an attack against enemies\r\n\r\n**Nominees are:**\r\n\r\n- 12 Minutes\r\n\r\n- Death’s Door\r\n\r\n- Kena: Bridge of Spirits\r\n\r\n- Inscryption\r\n\r\n- Loop Hero\r\n\r\n## Best Debut Indie\r\n\r\n### WINNER: Kena: Bridge of Spirits\r\n\r\n![image](https://crazygamer.ca/wp-content/uploads/2021/08/kena-bridge-of-spirits-1620308200917_160w.jpg)\r\n\r\n**Nominees are:**\r\n\r\n- Sable\r\n\r\n- Kena: Bridge of Spirits\r\n\r\n- The Artful Escape\r\n\r\n- The Forgotten City\r\n\r\n- Valheim\r\n\r\n## Best Mobile Game\r\n\r\n### WINNER: Genshin Impact\r\n\r\n![image](https://cdn1.epicgames.com/salesEvent/salesEvent/EGS_GenshinImpact_miHoYoLimited_S1_2560x1440-91c6cd7312cc2647c3ebccca10f30399)\r\n\r\nGenshin Impact is an open-world action role-playing game that allows the player to control one of four interchangeable characters in a party. Switching between characters can be done quickly during combat, allowing the player to use several different combinations of skills and attacks.  Characters may have their strengths enhanced in various ways, such as increasing a character's level and improving artifacts and the weapons that the character equips. In addition to exploration, the player can attempt various challenges for rewards. Scattered across Teyvat are bosses and challenges that reward highly valuable resources, such as Stormterror and the Electro Hypostasis, but claiming them uses up a currency called resin, which slowly regenerates over time. Completing these challenges grants the player progress towards increasing their Adventure Rank, which in turn unlocks new quests, challenges, and raises the World Level. The World Level is a measure of how strong the enemies within the world are and the rarity of rewards that defeating them gives\r\n\r\n**Nominees are:**\r\n\r\n- Fantasian\r\n\r\n- Genshin Impact\r\n\r\n- League of Legends: Wild Rift\r\n\r\n- MARVEL Future Revolution\r\n\r\n- Pokemon Unite\r\n\r\n## Best Action\r\n\r\n### WINNER: Returnal\r\n\r\n![image](https://i.pinimg.com/originals/08/80/f6/0880f6f95229577094ef8be092498639.png)\r\n\r\nReturnal is a third-person shooter video game featuring roguelike elements and covering the psychological horror genre. Set in a futuristic science fiction setting, the player controls Selene (Jane Perry), a space pilot, equipped with a suit and armed with high-tech weapons, who is stranded on the alien planet Atropos, and stuck in a time loop. After every death, Selene is resurrected, following a pattern of traversing across foreign environments and combating extraterrestrial entities with growing visions in an ever changing world\r\n\r\n**Nominees are:**\r\n\r\n- Back 4 Blood\r\n\r\n- Chivalry II\r\n\r\n- Deathloop\r\n\r\n- Far Cry 6\r\n\r\n- Returnal\r\n\r\n## Best Action/Adventure\r\n\r\n### WINNER: Metroid Dread\r\n\r\n![image](https://media.wired.com/photos/615de4bdcb3eb413e3a033ab/master/pass/Games-Metroid-Dread.jpg)\r\n\r\nMetroid Dread is an action-adventure game in which players control bounty hunter Samus Aran as she explores the planet ZDR. It retains the side-scrolling gameplay of previous Metroid games, alongside the free aim and melee attacks added in Samus Returns (2017). As the player explores, they discover new items and weapons, allowing them to access new areas\r\n\r\nDread adds stealth elements, with Samus avoiding the EMMI robots in certain areas by hiding, reducing her noise, and using the Phantom Cloak, camouflage that makes her invisible but slows her movement. If an EMMI catches Samus, the player has two brief chances to perform melee counters and escape. If they fail, Samus is killed. EMMIs can only be destroyed when Samus obtains the temporary \"Omega Blaster\" upgrade, which is lost upon using it to destroy one; however, destroying an EMMI grants Samus a new permanent upgrade. Players unlock images in an in-game gallery based on their completion time, difficulty level, and percentage of items collected\r\n\r\n**Nominees are:**\r\n\r\n- Marvel’s Guardians of the Galaxy\r\n\r\n- Metroid Dread\r\n\r\n- Psychonauts 2\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n- Resident Evil Village\r\n\r\n## Best Role Playing\r\n\r\n### WINNER: Tales of Arise\r\n\r\n![image](https://i.ytimg.com/vi/95h8JiignvA/maxresdefault.jpg)\r\n\r\nLike previous games in the series, Tales of Arise is an action role-playing game, although its gameplay has gone through unspecified alterations as part of its development goals while retaining the basic Tales battle system, dubbed the Linear Motion Battle System. The game has a big focus on evading and countering, with Tales of Graces, a 2009 entry praised for its combat, cited as inspiration. Unlike many of the previous titles in the series, the game doesn't feature multiplayer, with the development team deciding to focus on various interactions between characters in combat, including the addition of the \"Boost Strike\" feature, allowing multiple party members to perform destructive attacks together under certain conditions\r\n\r\n**Nominees are:**\r\n\r\n- Cyberpunk 2077\r\n\r\n- Monster Hunter Rise\r\n\r\n- Scarlet Nexus\r\n\r\n- Shin Megami Tensei V\r\n\r\n- Tales of Arise\r\n\r\n## Best Fighting\r\n\r\n### WINNER: Guilty Gear: Strive\r\n\r\n![image](https://cdn.akamai.steamstatic.com/steam/apps/1384160/capsule_616x353.jpg)\r\n\r\nIntended as a \"complete reconstruction of the franchise\", Guilty Gear Strive retains the core essence of the series but revamps many features and mechanics, except for the removal of the series’ signature mechanic, the Instant Kill. It introduces the \"Wall Break\" feature, which allows for stage transitions when a combo is initiated in the corner of the arena.\r\n\r\n**Nominees are:**\r\n\r\n- Demon Slayer: Kimetsu no Yaiba – The Hinokami Chronicles\r\n\r\n- Guilty Gear: Strive\r\n\r\n- Melty Blood: Type Lumina\r\n\r\n- Nickelodeon All-Star Brawl\r\n\r\n- Virtua Fighter 5: Ultimate Showdown\r\n\r\n## Best Family\r\n\r\n### WINNER: It Takes Two\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/HXDLVhmdqPzGJMtfysBjti.png)\r\n\r\n**Nominees are:**\r\n\r\n- It Takes Two\r\n\r\n- Mario Party Superstars\r\n\r\n- New Pokémon Snap\r\n\r\n- Super Mario 3D World + Bowser’s Fury\r\n\r\n- WarioWare: Get It Together!\r\n\r\n## Best Multiplayer\r\n\r\n### WINNER: It Takes Two\r\n\r\n![image](https://cdn.vox-cdn.com/thumbor/e7CjCG5gmFXnpbchq2xqUB2OdRY=/0x0:3819x1599/1200x675/filters:focal(1605x495:2215x1105)/cdn.vox-cdn.com/uploads/chorus_image/image/69017949/two.0.png)\r\n\r\n**Nominees are:**\r\n\r\n- Back 4 Blood\r\n\r\n- It Takes Two\r\n\r\n- Knockout City\r\n\r\n- Monster Hunter Rise\r\n\r\n- New World\r\n\r\nValheim\r\n \r\n## Most Anticipated\r\n\r\n### WINNER: Elden Ring\r\n\r\n![image](https://cdn.vox-cdn.com/thumbor/1A4-XjfBdFlaazdEv-74Nr4Hcnc=/0x0:1920x1280/1400x933/filters:focal(807x487:1113x793):no_upscale()/cdn.vox-cdn.com/uploads/chorus_image/image/70124039/elden_ring_1.0.jpg)\r\n\r\nElden Ring is an action role-playing game played in a third-person perspective and features elements similar to those found in its predecessors, the Souls series as well as Bloodborne and Sekiro: Shadows Die Twice, with gameplay focusing on combat and exploration. Director Hidetaka Miyazaki explained that players start with a linear opening but will eventually progress to freely explore the Lands Between, including its six main areas, as well as castles, fortresses, and catacombs scattered throughout the vast open-world map. These main areas are interconnected through a central hub that players can access later in the game's progression—similar to Firelink Shrine from Dark Souls—and will be explorable using the character's mount as the main mode of transport, although a fast travel system will be an available option. Throughout the game, players will encounter non-player characters (NPCs) and enemies alike, including the demigods who rule each main area and will serve as the game's main bosses\r\n\r\n**Nominees are:**\r\n\r\n- God of War Ragnarok\r\n\r\n- Elden Ring\r\n\r\n- Horizon Forbidden West\r\n\r\n- Sequel to The Legend of Zelda: Breath of the Wild\r\n\r\n- Starfield\r\n\r\n \r\n## Innovation in Accessibility\r\n\r\n### WINNER: Forza Horizon 5\r\n\r\n![image](https://assets.gamepur.com/wp-content/uploads/2021/06/13134935/Forza-Horizon-5-Official-Release-Date-Trailer-4K-_-E3-2021-00-01-44-.jpg)\r\n\r\n**Nominees are:**\r\n\r\n- Far Cry 6\r\n\r\n- Forza Horizon 5\r\n\r\n- Marvel’s Guardians of the Galaxy\r\n\r\n- Ratchet & Clank: Rift Apart\r\n\r\n- The Vale: Shadow of the Crown\r\n \r\n## Best Esports Game\r\n\r\n### WINNER: League of Legends\r\n\r\n![image](https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_obituary/public/d8/images/methode/2020/10/29/9ae7fa98-1902-11eb-8f67-a484f6db61a1_image_hires_022408.jpeg?itok=E90OZb1k&v=1603909455)\r\n\r\nSummoner's Rift is the flagship game mode of League of Legends and the most prominent in professional-level play. The mode has a ranked competitive ladder; a matchmaking system determines a player's skill level and generates a starting rank from which they can climb. There are nine tiers; the least skilled are Iron, Bronze, and Silver, and the highest are Master, Grandmaster, and Challenger\r\n\r\n**Nominees are:**\r\n\r\n- Call of Duty: Warzone\r\n\r\n- Counter-Strike: Global Offensive\r\n\r\n- DOTA2\r\n\r\n- League of Legends\r\n\r\n- Valorant"
	},
	{
		"_id": "6203bd57b0d50e4d201d5f08",
		"title": "DUPLICATE-4 CES 2022: what will we see at the world’s largest electronics expo in January?",
		"abstract": "CES 2022 will return to Las Vegas – but will it be worth attending in-person?",
		"imageCover": "ces-logo.jpg",
		"tags": ["computer", "technology", "science", "events"],
		"category": "events",
		"typeFace": "main",
		"author": "61ed7e4a3c05a74b3559bb4a",
		"markdown": "Watching CES online last year was certainly an experience – but we’re happy to see it return to its regular old in-person format for 2022. \r\n\r\nWhen it kicks off in January, CES 2022 will bring us a bevy of new devices from all the major players in the industry. We’ll see some cutting-edge TV technology from the likes of LG, Samsung and Sony, plus new laptops, smartphones, wearables and headphones, too. \r\n\r\nThat said, we’re expecting a slightly more subdued show than in years past due to the ongoing Covid-19 pandemic and its impact on international travel – but as of right now, the CTA says that most of the main players will be returning to their usual spots on the Las Vegas Convention Center show floor. It sounds like it will be slightly smaller than in years past, but with all of the same tech-y goodness that you’d expect from a CES.\r\n\r\n## CES 2022: Date and Timings\r\n\r\n![image](https://miro.medium.com/max/1000/1*MgdcQrN0nQa5DF2VqmVV4Q.jpeg)\r\n\r\nOfficially, CES 2022 runs from Wednesday, January 5 through Saturday, January 8, 2022. That’s when the show floor will be open, and you’ll be able to walk around to check out the different booths - as long as you have official documentation that you’ve been vaccinated.\r\n\r\nLike previous conferences, however, there are two days of press conferences that happen before the show floor opens that take place on Monday, January 3 and Tuesday, January 4. That includes CES Unveiled that takes place from 5 - 8 pm PST on Monday, January 3 and the big press events from LG, Samsung and Sony that happen on Tuesday at 8 am PST and run through the entire day.\r\n\r\nWhen most folks get there on Wednesday, the CES show floor will be open from 10 am PST until 6 pm PST then from 9 am to 6pm PST from Thursday to Friday. CES 2022 will officially wrap up at 4 pm PST on Saturday, January 8. \r\n\r\nSo what are we going to see there?\r\n\r\n## Samsung at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/XgiCMPpcmAXxJaPjkK8DLc-970-80.jpg.webp)\r\n\r\nFrom TVs to phones to appliances you’ll be able to buy next year, as well as chef bots and ball robot concepts that may never reach the market, Samsung always has a lot to show at CES, and we anticipate a similar range of products shown off at CES 2022. \r\n\r\nWe expect Samsung to show off a number of new 4K and 8K Neo QLED TVs, following up last year’s excellent Samsung QN90A and QN900A models. As far as phones go, we anticipate seeing some of its more recent mid-range phones as well as the long-delayed Samsung Galaxy S21 FE, and maybe even a hint of the upcoming Samsung Galaxy S22 flagship range.\r\n\r\n## Sony at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/3b1e077c48920e8f8fee4a0c4c3f3de6-970-80.jpg.webp)\r\n\r\nSony is always tough to nail down when it comes to CES plans. Some years they show up with a concept car. Other times they show up with an animatronic dog. You never really know what Sony will have in any given year. \r\n\r\nThat being said, we do have a few hunches of what we’re going to see there. From Sony’s audio department, we’re likely to see a new lineup of digital media players (i.e. Walkmans) as well as a pair of premium headphones or two. We’ll see some wireless speakers and, from the TV side, at least three to four new 4K and 8K screens to whet our appetites for the 2022 Sony TV lineup. \r\n\r\nSony usually doesn’t show off much from its camera business at CES but expect to at least hear how the company’s music and movie arms are doing. Will we see the PlayStation VR 2 there? Probably not, but we’ll certainly keep our eyes peeled just in case Sony surprises us.\r\n\r\n## TCL at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/2cEj53dGM34jiECtLEfuug-970-80.jpg.webp)\r\n\r\nTCL has embraced CES as a launchpad for its new products coming out in the year and concepts we might not see for awhile. Though some of those devices slated to come out get quietly delayed (or never release at all), there’s always an interesting range of TVs, phones, flexible-screen devices, and other gadgets from TCL, and we expect CES 2022 to be no different.\r\n\r\nGiven TVs are TCL’s bread and butter, we expect new 6-Series Mini LED TVs following up on last year's fantastic TCL 6-Series 8K. TCL is only a few years into releasing phones under its own name, and we expect a follow-up to the TCL 20 series released last year – perhaps the TCL 30 line. There could also be TCL Tab tablets to see, along with concept devices we can’t begin to predict.\r\n\r\n## Hisense at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/FLtFpvfPCcrk827heqRSzF-970-80.png.webp)\r\n\r\nHisense never gets the same amount of airtime as companies like Sony, Samsung and LG at CES, but it’s still worth a stop at the company’s booth if you’re walking around the Las Vegas Convention Center. What we’re expecting from Hisense this year is another lineup of Google TV-toting smart TVs for the UK as well as some nice new laser TVs for the US. \r\n\r\nIf you’re looking for super futuristic display technology, you’ll find it at Hisense’s booth as well – however, most of it is either conceptual or exclusive to the Chinese market. \r\n\r\n## Intel at CES 2022\r\n\r\n![image](https://static.techspot.com/images2/news/bigimage/2021/08/2021-08-19-image-12-j.webp)\r\n\r\nThe biggest reveal we expect from Intel at CES is the continued release of new Alder Lake CPUs. We’re expecting some of its flagship enthusiast silicon to be released in November, but those will mostly be high-end desktop chip. CES 2022 might see Alder Lake chips making it to the mobile computing segment, where the big.LITTLE architecture should significantly boost laptop energy efficiency.\r\n\r\nIf early indications hold up, the new Alder Lake chips might leave the Apple M1 and M1X processors in the dust along with AMD’s Zen 3 chips.\r\n\r\n## Panasonic at CES 2022\r\n\r\n![image](https://m.thepeninsulaqatar.com/get/maximage/20171010_1507665098-180025.jpg)\r\n\r\nPanasonic usually shows up to CES with two big announcements – one for its new OLED TV and another for its Technics line of vinyl players and headphones. This year, that could certainly change and Panasonic might surprise us with something totally new and different, but this game plan has always served Panasonic well in the past.\r\n\r\nUnfortunately, the rest of Panasonic’s announcement will likely come during IFA 2022 – which isn’t happening until September of next year. \r\nOur predictions for...\r\n\r\n## Phones at CES 2022\r\n\r\n![image](https://i2.wp.com/www.maggt.com/wp-content/uploads/2021/11/samsung-s21-fe-ces-launch.jpg)\r\n\r\nCES isn’t a big stage for phones coming out this year – that’s usually Mobile World Congress (MWC), which happens in February – but several brands choose to debut some new handsets at the first big annual show. These include some flagship devices but mostly mid-range and budget phones, as companies save their heavy hitters for MWC.\r\n\r\nAs previously mentioned in their own sections, we expect Samsung and TCL to have several devices on display, if previous CES shows are anything to go by. That includes pricier Samsung mid-range devices like follow-ups to the Samsung Galaxy A52 and Samsung Galaxy A72, as well as the potential debut of the still-unseen Samsung Galaxy S21 FE. For TCL, we’d expect the first round of devices in the TCL 30 lineup, with others coming later in the year.\r\n\r\nIt’s possible we see other brands show off their traditional phones, as Motorola has done with Moto G phones in years past. But we’re also expecting non-traditional phones, especially flexible-display devices: both the TCL Rollable and LG Rollable were shown off at CES 2021, and though neither has reached the market (RIP LG phones), they’re still showing where phone design could go.\r\n\r\n## Audio at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/vazDB9FLc4i3xaTE5B7yL4-970-80.jpg.webp)\r\n\r\nWe’re spoiled when it comes to audio products at trade shows. Between NAB, The Bristol Hi-Fi Show and CanJam, we have a new event every three months that will show us what’s hot in the world of hi-fi headphones, speakers and soundbars. That said, while we have plenty of opportunities to get our ears on the latest and greatest cans, CES provides the unique opportunity of seeing what comes next – i.e. the experimental stuff.\r\n\r\nIn years past, that’s included Creative’s Super X-Fi technology and Sony 360 Reality Audio and we’re expecting to see more upgrades to both technologies at this year’s event. \r\n\r\nBeyond headphones, expect to see plenty of new Bluetooth speakers and soundbars from LG, Samsung and Sony – plus bookshelves and standing speakers from Klipsch, JBL and more. That’s a fairly murky prediction, honestly, but the world of hi-fi moves fast and products are announced and released faster than most folks can keep up with them.\r\n\r\nTVs at CES 2022\r\n\r\n![image](https://mma.prnewswire.com/media/1685539/SKYWORTH_W82.jpg?p=facebook)\r\n\r\nBigger. Brighter. More pixels. Better contrast. It sounds so simple when you break it down like that, but in reality those are the four traits that every TV maker in the whole world are chasing right now. Bigger screens have always been a trend at CES but these past few years we’ve seen some truly super-sized models reaching upwards of 90 inches. Crossing that barrier will be difficult - and expensive - but it’s only a matter of time until we see affordable 100-inch TVs.\r\nAdvertisement\r\n\r\nIn terms of brightness and contrast, we’ll be looking for new Mini LED TVs to push the envelope on both fronts. We got our first batch of models from LG and Samsung this year in the form of the Samsung QN90A QLED TV and LG QNED99, and both blew us away. \r\n\r\nThere are some interesting rumors floating around about what could come next for display technologies - holographic and transparent TVs anyone? - but we’ll just have to wait until we get to Vegas to find out what the big three have in store for us.\r\n\r\n## Smart Home at CES 2022\r\n\r\n![image](https://d1wa5qhtul915h.cloudfront.net/app/uploads/2021/07/Bike-Europe-CES-2020.jpg)\r\n\r\nTouchless tech was a big thing at CES 2021; from Kohler’s kitchen faucet that can dispense water by simply placing a hand in front of it, to Arlo’s video doorbell that can alert you when someone is standing on your doorstep rather than actually needing to push the doorbell itself. Thanks to the on-going effects from the global pandemic we expect to see a lot more touchless tech at CES 2022. \r\n\r\nThere’s likely to also be the usual crop of smart home devices including home security cameras with better resolutions and smarter AI that can help ensure you’re not plagued by unwanted motions alerts. We also expect to see a plethora of robot vacuums that offer better suction and utilize AI to navigate around your home, carefully avoiding obstacles such as socks that have escaped from the laundry pile and rogue phone charging cables. \r\n\r\n## Wearables at CES 2022\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/XuFbfK4dg9YixtxCsrEPdP-970-80.jpg.webp)\r\n\r\nMost of the big names in fitness tracking (including Garmin and Fitbit) prefer to host their own events for each of their product launches rather than doing a big reveal at CES. That doesn’t mean Fitbit will be entirely absent from CES 2022, though.\r\n\r\nFitbit is now owned by Google, which is working to bring Fitbit apps and celebrations to its own smartwatch operating system, WearOS. CES is traditionally used as a showcase for new Wear OS watches, with companies like Skagen, Suunto, and Withings all showing off their latest Google-powered devices, so the 2022 show could give us our first glimpse of how the Fitbit integration will work on a smartwatch.\r\n\r\nWe could also see some fitness trackers that are a little outside the norm. At CES 2021, UK-based DNABand revealed a watch that uses data derived from a saliva sample to provide customized advice while you’re shopping for groceries. It’s likely that we’ll see something equally unusual at the 2022 show, and we’ll be keeping a close eye on the startups showing off weird and wonderful wearables in the hopes of attracting an investor’s attention.\r\n\r\nOne final possibility is the appearance of ‘fitness tracking as a service’. We’ve seen some interesting developments in this area recently, with Amazon and Fitbit both releasing new devices that keep some insights hidden behind a paywall. At CES 2022, it’s possible that we might get our first glimpse of a fitness tracker that’s free up-front, but requires a rolling monthly subscription if you want to see your health data.\r\n\r\n## CES 2022: how to register\r\n\r\n![image](https://larepublica.pe/resizer/vvGDWnZ22WVd5KPxzoNVqt6XDbU=/1200x660/top/cloudfront-us-east-1.images.arcpublishing.com/gruporepublica/WPYHOGS5YNDHRJULOUXR3N2CDI.jpg)\r\n\r\nRegistration for CES 2022 is available now to the consumer technology industry now at the [CES website.](https://www.ces.tech/Logistics/Register-Now.aspx) In terms of cost, the CTA plans to charge a $300 fee. The fee will apply to most attendees, including retailers, but like in past years, credentialed journalists and analysts will be exempt."
	},
	{
		"_id": "6203bd57b0d50e4d201d5f09",
		"title": "DUPLICATE-4 Best college laptops for students, from budget laptops to workstations.",
		"abstract": "The complete list of best laptops available for the college students to help their coding.",
		"imageCover": "laptop-cover.jpg",
		"tags": ["computer", "technology", "general"],
		"category": "general",
		"typeFace": "main",
		"author": "61ed7e4a3c05a74b3559bb4d",
		"markdown": "If you're a student, you'll want one of the best college laptops so you can ace your exams then stream TV or play games when it's time to relax. But with so many choices at so many different prices, it can be homework in itself to find the very best laptops for students. \r\n\r\nWhen you're buying a laptop for school, make sure it has long battery life and fast CPU performance. You can find a lot of these units on our main best laptops page, which gives you a wide selection of the top notebooks to choose from. And if you prefer to take notes by hand, buy one of the best 2-in-1 laptops. We've also ranked the best gaming laptops for those who like to unwind after the coursework is wrapped up. We're still in a process of reviewing some laptops that could find their way on this list, so be sure to check back in regularly for the latest and great laptops for students. \r\n\r\n## HP Envy . \r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/X65pzFAjWZpsydiR8L5XoK-970-80.jpg.webp)\r\n\r\nThe best laptop for students is now better than ever. Refreshed with a new design and a Thunderbolt 4 port, the new HP Envy 13 is the best sub-$1,000 laptop for students or anyone who needs a portable machine with loads of power and long battery life (11:15 on the FHD model). \r\n\r\nWith even slimmer bezels and faster performance, the 2021 model shows that it can hang with much pricier flagship models. Combine those features with a sleek chassis, bright and vivid 1080p display and plenty of performance from an 11th Gen Core i5 CPU, and it's easy to see why the Envy 13 is the best college laptop for students. And frankly, given that this is a budget laptop compared to many of the others on this list, the Envy 13 is an awesome choice. If you need a larger display, see our HP Envy 14 review. \r\n\r\n## MacBook Air with M1\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/AUaDk6VmkFriSBiQJHrx4V-970-80.jpg.webp)\r\n\r\nIf you prefer macOS to Windows 10, then go with the Apple MacBook Air. The biggest improvement to this year's model is the new M1 chip, which delivers outstanding performance and excellent battery life, making the new MacBook Air the fastest ultrathin laptop ever.  \r\n\r\nBest of all, the MacBook Air still costs only $999, and yet, you can unrivaled performance along with 14 hours and 41 minutes of battery life. This is a combination you'll only find from the very best Windows 10 laptops, and even they can't compete in head-to-head performance. \r\n\r\nSo why buy the MacBook Air instead of the Pro? While the Pro has better sustained performance, the MacBook Air is cheaper and is pin-drop silent because it doesn't have a fan. And, of course, Apple's least expensive 13.3-inch model is the most portable, coming in at only 0.6 inches thick and 2.8 pounds. \r\n\r\nBut now the MacBook Air is slower to parity with the MacBook Pro than ever before. It has similar speed and battery life, the same 720p webcam, a comfortable Magic keyboard and two USB-C ports. Also, the 13.3-inch, 2560 x 1600-pixel Retina display on the M1 model was improved with P3 color coverage, making it more vibrant than the previous panel. \r\n\r\n## Dell XPS 13 \r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/8dTpBaD5tdkcVwYhFpJvfb-970-80.jpeg.webp)\r\n\r\nThe Dell XPS 13 is a serious workhorse and the best premium laptop for college students. Powered by an 11th Gen Intel Core i7 processor with integrated Intel Iris Xe graphics, the notebook is ready for work or play. And with more than 11 hours of battery life, you've got plenty of time for both. The laptop consistently performed either better or on a par with competing systems.\r\n\r\nBut rest assured, the XPS 13 is just as pretty as it is powerful. The company managed to make a laptop that's smaller and lighter than previous models. Despite the smaller size, Dell added some big changes, including a larger trackpad and keyboard. Plus, you get a 13.4-inch, near-bezelless display on every side –– the first in the world to do so. \r\nAdvertisement\r\n\r\nIt's an exercise in patient restraint, improving the notebook in a bunch of small ways that add up to a big leap for the system. If you're looking for the total package, the Dell XPS 13 is the laptop for you. \r\n\r\n\r\n## HP Envy x360 \r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/rZxKJRZLwQ6RDgWHCJnRTM-970-80.jpg.webp)\r\n\r\nThe HP Envy x360 13 is the best laptop for under $1,000 and one of the best Ultrabooks on the market. While it doesn't come with a stylus (neither does the Surface Pro), the Envy is a 2-in-1, which lets you flip it into tent or tablet mode. What makes this such a fantastic value is its entirely aluminum design and Herculian AMD Ryzen processors. \r\n\r\nIn our testing, we found that an Envy x360 13 with a Ryzen 5 4500U CPU can outperform laptops with 10th Gen Intel chips. This specific Envy costs just $800 and can outmuscle laptops that cost well over $1,000, including the exorbitant MacBook Pro. Moreover, the Envy x360 13 has a bright, vivid 13.3-inch display and a comfortable keyboard. \r\n\r\nThere is very little we don't like about the Envy x360. If you can get over the lack of a Thunderbolt 3 port and IR camera, then it is the ultimate money-saving laptop. If you prefer a larger display, see our HP Envy x360 15 review. \r\n\r\n\r\n## Apple MacBook Pro \r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/GhzFxPPWGGom7wLjUjQYDA-970-80.jpg.webp)\r\n\r\nThis is the huge leap forward we've been waiting on. It is all thanks to the new M1 chip, Apple's first-ever custom SoC for laptops. With the best power-per-watt performance of any processor, the M1 brings the MacBook Pro's performance and battery life to the next level.\r\n\r\nMore specifically, the MacBook Pro is more powerful than nearly every PC on the market, including some workstations. And despite cramming so much power into such a slim and sleek chassis, the Pro lasted for an outstanding 16 hours and 32 minutes on our battery test, which simulates real-world testing.\r\n\r\nWith an image processing unit, the webcam (sadly, still 720p) is better than before and since it runs on Apple's ARM-based architecture, iPad and iPhone apps are now available on Mac. Yep, you can run all your favorite iOS games and apps on your laptop now. \r\n\r\nRounding out the numerous enhancements found in the latest MacBook Pro is Big Sur, the latest version of macOS. The largest update since OS X launched a decade ago, Big Sur is a beautiful redesign of the desktop OS.  \r\n\r\n## HP Spectre x360 14\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/qBfGdkRvjJszWvRJGJfdhS-970-80.jpg.webp)\r\n\r\nThe Spectre x360 14 is the best 2-in-1 laptop ever. Newly released for 2021, the 13.5-inch model builds upon its predecessors but adds useful new features including a 3:2 aspect ratio display and 11th Gen Intel CPUs with Iris Xe graphics. Highlights of this laptop include a stunning design, bright and vivid 1920 x 1280-pixel IPS and 3K2K OLED display options, epic 12+ hour battery life and fast overall performance. \r\n\r\nAdd to that a generously sized touchpad that is silky to the touch as well as a comfortable (albeit shallow) keyboard, excellent security options (fingerprint sensor and facial recognition) and a good selection of ports, and well, it's easy to see why we like this laptop so much. \r\n\r\nWe recommend buying the Spectre x360 14 over the Envy 13 if you have the money, especially if you need the flexible design. In fact, the Spectre x360 14 is the best laptop if you want a convertible notebook, period. Sure, it has a few faults, but those are easily forgotten once you get this beauty in your hands. \r\n\r\n## Acer Swift 3 (2020, AMD Ryzen)\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/ZwJ97S9pSrMho8diQwGUp6-970-80.jpg.webp)\r\n\r\nIf you want blistering performance at a budget price, look no further than the Acer Swift 3 with AMD Ryzen CPUs. This $649 laptop can outperform the Dell XPS 13 and even make a run at the MacBook Pro. It's really all about the Ryzen 7 4700U CPU inside, which trounces its Intel opposites in raw performance.\r\n\r\nWe also like the Swift 3's clicky keyboard, which was comfortable to type on thanks to the springy feedback. You also get a fingerprint reader on the deck for quick login and the chassis is made of aluminum and magnesium, not plastic. Our biggest beef with the Swift 3 is the dim and dull display. If that isn't a concern for you, the Swift 3 is an excellent choice at a reasonable price.\r\n\r\n## Lenovo ThinkPad X1 Carbon (Gen 9)\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/BqTQ8aW42Gur7FfwNBayeZ-970-80.jpg.webp)\r\n\r\nLenovo made several welcome changes to the 9th Gen edition of its flagship business laptop. Along with fast performance from 11th Gen Intel CPUs, you get longer battery life (15 hours!), powerful quad speakers, a new 14-inch display with a 16:10 aspect ratio, and plenty of ports, all in an impossibly lightweight chassis (2.5 pounds). \r\n\r\nBut it's still those classic ThinkPad features —  a durable design (with MIL-STD-810G strength), best-in-class keyboard and stealthy black/red aesthetics — that carry the X1 Carbon to greatness.\r\n\r\nYes, we wish the ThinkPad X1 Carbon had a better webcam and hadn't ditched the SD card reader in the previous. Also, top configurations can get very expensive; still, you'd be hard-pressed to find a better business laptop for students going to college. If you want a 2-in-1 laptop with business features, consider the ThinkPad X1 Yoga (Gen 6).\r\n\r\n## Google Pixelbook Go\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/joGUDW4Gb6K49nGB4YHDcH-970-80.jpg.webp)\r\n\r\nThe Google Pixelbook Go is a fantastic laptop for students because you get the same sleek elegance as the Pixelbook but at a much lower cost. Starting at $649, the Pixelbook Go is among the cheapest laptops on this list, yet it delivers a lightweight chassis, fast performance and epic battery life. \r\nAdvertisement\r\n\r\nMore classrooms are shifting to Chromebooks, so the Pixelbook Go should feel familiar to students. It's an easy-to-use, lightweight operating system centered around the Chrome browser. What makes the Pixelbook Go such a good option is that it's durable and powerful enough to survive for several years, so buy it for your freshman child and it should last him through high school graduation and into college.\r\n\r\n## Lenovo Legion 5 Pro\r\n\r\n![image](https://cdn.mos.cms.futurecdn.net/zrRpB2DYw3MqQEPXwFtBSN-970-80.jpg.webp)\r\n\r\nLenovo's Legion 5 Pro proves what's possible when two opposing forces come together for the greater good. Those forces are AMD and Nvidia, and the greater good is the gaming community. Armed with an AMD Ryzen 7 5800 CPU and Nvidia GeForce RTX 3070 graphics, the Legion 5 Pro gives gamers the power they need to run the latest AAA titles at Ultra graphics settings. \r\n\r\nWhat it lacks in flashy aesthetics, it makes up for with a gorgeous 16-inch QHD display, an exceptional keyboard and touchpad, plenty of ports, and outstanding performance from the one-two punch of an AMD CPU and Nvidia GPU. And despite harnessing so much power, the Legion 5 Pro delivers respectable battery life. \r\n\r\nThanks for reading this far!"
	},
	{
		"_id": "6203bd57b0d50e4d201d5f10",
		"title": "DUPLICATE-4 AMD could have a secret weapon to make gaming laptops better",
		"abstract": "RX 6000S mobile graphics cards might make their presence felt soon",
		"imageCover": "amd-cover.jpg",
		"tags": ["computer", "technology", "gaming"],
		"category": "technology",
		"typeFace": "main",
		"author": "61ed7e4a3c05a74b3559bb4d",
		"markdown": "AMD could be about to introduce new graphics cards for laptops, at least going by the rumor mill which predicts revamped RDNA 2 GPUs are waiting in the wings. The possible refresh of RX 6000 mobile GPUs might be based on TSMC’s 6nm process, and could be named as the RX 6000S series. VideoCardz cites hardware leaker Disclosuzen on Twitter as the source for details on these purported new graphics solutions (though note that as PC Gamer, which spotted this, observes, the leaker’s Twitter account has been suspended).\r\n\r\n![image](https://www.amd.com/system/files/2021-03/749511-amd-radeon-6000-series-4-gpus-1290x709_0.png)\r\n\r\nBacking this up, another well-known hardware leaker on Twitter, Greymon55, has previously theorized (a few months back) that AMD has a 6nm-based refresh of the 6000 mobile series inbound, though they believed it would be kick off with the RX 6900M, whereas this fresh leak claims it’ll be the RX 6800S.\r\n\r\nThe charge could be led by that RX 6800S, and apparently there may be other revamped laptop GPUs in line with that, as you might expect; but not the whole range. Greymon55 has previously guessed that we could see up to four models in the new ‘S’ series. Heavy salt with all this, it goes without saying.\r\n\r\nAs for rumored specs, apparently the RX 6800S will keep the same core count (2,560) and bus as the existing 6800M, but due to dropping to 6nm (from 7nm with the existing GPU), the 6800S should be capable of higher clock speeds for better performance.\r\n\r\n![image](https://i.itworldcanada.com/wp-content/uploads/2020/10/amd-radeon-rx-6000-feature.jpg)\r\n\r\nThe RX 6800S (the ‘S’ stands for Super, right?) could obviously be a useful boost for AMD’s laptop GPU line-up, and on 6nm rather than 7nm, as we observed above, it could potentially ramp up clocks nicely; and the other big plus would be improved power-efficiency, too. Of course, when it comes to laptop hardware which is packed into a tight chassis – where heat and the space for adequate cooling solutions becomes a trickier balancing act – more efficiency is a major boon.\r\n\r\nThat said, there’s little info on the potential spec yet, so we shouldn’t build up any expectations on the performance front. We’ve also heard arguments pushing the idea that 6nm may not offer much in terms of extra oomph or efficiency (but even if any performance gains were minimal, dropping to 6nm would still improve availability of GPUs – always an issue these days – simply because there’ll be more chips from a single wafer).\r\n\r\nWe’ll just have to see how things pan out, but if these new laptop graphics cards are indeed real, we’ll likely witness more spillage on them soon enough. Meanwhile, Nvidia is rumored to have new RTX 3000 Ti GPUs for laptops ready to launch at CES 2022, just around the corner at the start of January, with an RTX 3070 Ti mobile version recently being spotted in leaked product details of an Acer laptop."
	}
]